[
  {
    "state_code": "AL",
    "state_name": "Alabama",
    "agency_name": "Alabama Department of Labor",
    "registration_portal_url": "https://labor.alabama.gov/egov/login.aspx",
    "ui_wage_threshold_text": "$1,500 in wages in any calendar quarter or one worker employed on at least 20 different weeks in a year; household employers become liable when they pay $1,000 in cash wages in a quarter; agricultural employers become liable when cash wages reach $20,000 in a quarter or when 10 or more workers are employed for 20 weeks; nonprofits (501(c)(3)) become liable with four or more workers for 20 weeks",
    "ui_threshold_weeks_text": "20 different weeks with at least one worker (general); 20 weeks with 10 or more workers for agricultural employment; 20 weeks with four or more workers for nonprofits",
    "withholding_registration_required": true,
    "withholding_threshold_description": "Employers with employees working in Alabama must register for a withholding tax account and withhold Alabama income tax from those employees, even when Alabama residents work out of state; registration is done through My Alabama Taxes",
    "typical_processing_time": "Registrations submitted via the eGov portal typically receive an unemployment account number within days; paper Form SR‑2 applications may take several weeks. Withholding registration via My Alabama Taxes is processed online (time varies).",
    "required_information": [
      "Federal Employer Identification Number (FEIN)",
      "Legal name and trade name of the business",
      "Business physical and mailing addresses and phone number",
      "Entity type and date employing workers began",
      "Date of first payroll and total wages paid in the quarter",
      "Names, Social Security numbers and addresses of owners/officers",
      "Whether the business acquired another business or changed form of organization"
    ],
    "filing_methods": [
      "Online via the Alabama Department of Labor eGov Employer Registration (Form SR‑2) for state unemployment insurance",
      "Paper Form SR‑2 mailed to the Status Unit",
      "Withholding registration via My Alabama Taxes (online)"
    ],
    "confirmation_proof": "Unemployment insurance account number issued by the Department of Labor and confirmation email/letter; withholding registration provides an account number beginning with “R”",
    "contacts": {
      "phone": "334-954-4730",
      "email": null
    },
    "last_verified_date": "2025-11-05",
    "source_notes": "Alabama UC Employer information on liability and registration; eGov registration portal description; Alabama Department of Revenue withholding account requirement",
    "rules": {
      "status": "complete",
      "ui_liability": {
        "general": {
          "wage_threshold": {
            "amount": 1500.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "weeks": 20,
            "unit": "weeks_in_year",
            "min_employees": 1
          }
        },
        "domestic": {
          "wage_threshold": {
            "amount": 1000.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "weeks": null,
            "unit": null,
            "min_employees": null
          }
        },
        "agricultural": {
          "wage_threshold": {
            "amount": 20000.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "weeks": 20,
            "unit": "weeks_in_year",
            "min_employees": 10
          }
        },
        "nonprofit": {
          "wage_threshold": {
            "amount": null,
            "period": null
          },
          "weeks_threshold": {
            "weeks": 20,
            "unit": "weeks_in_year",
            "min_employees": 4
          }
        },
        "notes": []
      },
      "withholding": {
        "required_from_first_payroll": true,
        "notes": []
      },
      "todo": []
    }
  },
  {
    "state_code": "AK",
    "state_name": "Alaska",
    "agency_name": "Alaska Department of Labor and Workforce Development – Employment Security Division",
    "registration_portal_url": "https://labor.alaska.gov/estax/",
    "ui_wage_threshold_text": "Alaska covers virtually all employers. Any person or business that hires one or more individuals to perform services for any portion of a day is an employer liable for unemployment insurance tax. There is no minimum wage threshold. Nonprofit organizations exempt under IRC 501(c)(3) become liable when they pay an individual $250 or more in a calendar quarter or employ four or more individuals for some portion of a day in each of 20 weeks in a calendar year",
    "ui_threshold_weeks_text": "General employers become liable as soon as one worker performs services; there is no minimum number of weeks. Nonprofit employers become liable when they employ four or more workers for some portion of a day in each of 20 weeks in the current or preceding calendar year",
    "withholding_registration_required": false,
    "withholding_threshold_description": "Alaska has no state personal income tax. Employers do not register for state income tax withholding; they only register for unemployment insurance (employment security tax).",
    "typical_processing_time": "Employers who register online via TaxWeb receive an Employer Account Number and coverage determination letter by mail. The letter is typically mailed within several business days to a couple of weeks, depending on the season.",
    "required_information": [
      "Federal Employer Identification Number (FEIN)",
      "Business legal name and mailing address",
      "Business phone/fax numbers and email address",
      "Entity type (e.g., corporation, LLC, sole proprietor)",
      "Date you will first pay wages to employees",
      "Responsible party or owner/officer names and contact information"
    ],
    "filing_methods": [
      "Online via the Alaska Employment Security Tax (TaxWeb) system through myAlaska",
      "By mail using the Employer Registration Form (available from the Employment Security Tax office)",
      "In person at a Field Tax Office of the Alaska Department of Labor and Workforce Development"
    ],
    "confirmation_proof": "Employer account number and coverage determination letter (blue Notice to Employees) mailed by the Alaska Department of Labor after registration",
    "contacts": {
      "phone": "907-465-2757 (statewide toll-free: 888-448-3527)",
      "email": null
    },
    "last_verified_date": "2026-02-05",
    "source_notes": "Information obtained from the Alaska Employment Security Tax Handbook (updated April 2024) describing who is an employer and how to establish an account; Alaska Department of Labor TaxWeb FAQ listing required information for registration",
    "rules": {
      "status": "complete",
      "ui_liability": {
        "general": {
          "wage_threshold": {
            "amount": null,
            "period": null
          },
          "weeks_threshold": {
            "weeks": null,
            "unit": null,
            "min_employees": 1
          }
        },
        "domestic": {
          "wage_threshold": {
            "amount": null,
            "period": null
          },
          "weeks_threshold": {
            "weeks": null,
            "unit": null,
            "min_employees": 1
          }
        },
        "agricultural": {
          "wage_threshold": {
            "amount": null,
            "period": null
          },
          "weeks_threshold": {
            "weeks": null,
            "unit": null,
            "min_employees": 1
          }
        },
        "nonprofit": {
          "wage_threshold": {
            "amount": 250.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "weeks": 20,
            "unit": "weeks_in_year",
            "min_employees": 4
          }
        },
        "notes": [
          "Nonprofit organizations exempt under IRC 501(c)(3) are liable when they pay $250 or more in a quarter or have four or more employees for some portion of a day in 20 weeks"
        ]
      },
      "withholding": {
        "required_from_first_payroll": false,
        "notes": [
          "Alaska does not levy a state personal income tax, so no withholding account is required."
        ]
      },
      "todo": []
    }
  },
  {
    "state_code": "AZ",
    "state_name": "Arizona",
    "agency_name": "Arizona Department of Economic Security (DES) – Employer Registration Unit & Arizona Department of Revenue",
    "registration_portal_url": "https://aztaxes.gov",
    "ui_wage_threshold_text": "General employers become liable when they pay at least $1,500 in wages in a calendar quarter; domestic employers are liable when cash wages reach $1,000 in a quarter; agricultural employers are liable when they pay $20,000 in wages in a quarter or employ 10 or more workers for part of a day in 20 weeks; nonprofits that are exempt under IRC 501(c)(3) become liable when they have four or more employees for part of a day in 20 weeks.",
    "ui_threshold_weeks_text": "Liability also arises when at least one worker is employed for some part of a day in 20 weeks during a calendar year (for general employers); agricultural employers are liable when 10 or more workers are employed for part of a day in 20 weeks; nonprofits are liable when they employ four or more workers for part of a day in 20 weeks.",
    "withholding_registration_required": true,
    "withholding_threshold_description": "Employers who compensate employees for services performed in Arizona must deduct and remit state income tax beginning with the first payroll; all employers must register their EIN with the Arizona Department of Revenue by completing the Joint Tax Application (JT‑1).",
    "typical_processing_time": "1–2 weeks (DES mails a determination letter after processing the application)",
    "required_information": [
      "Federal Employer Identification Number (FEIN)",
      "License types to register for (check Withholding/Unemployment Tax on the JT‑1/UC‑001 form)",
      "Type of organization (sole proprietorship, corporation, partnership, LLC, etc.)",
      "Legal business name and any trade name (DBA)",
      "Physical location and mailing address of the business",
      "Business phone number, fax number and email address",
      "Description of business and NAICS code",
      "State of incorporation and date business started in Arizona",
      "Date of first payroll in Arizona",
      "Names, titles, Social Security numbers, addresses and contact information for all responsible owners, partners or corporate officers"
    ],
    "filing_methods": [
      "Complete the Joint Tax Application (JT‑1/UC‑001) online at AZTaxes.gov to register for unemployment insurance and withholding",
      "Alternatively, submit the paper JT‑1/UC‑001 form by mail to the Arizona Department of Revenue (processing is slower)",
      "After registration, file quarterly wage reports and pay UI contributions through the DES Employer online services"
    ],
    "confirmation_proof": "DES mails a Determination of Unemployment Insurance Liability letter with the employer account number and tax rate after processing the Joint Tax Application; the Department of Revenue uses the employer’s FEIN as the withholding account number and issues a confirmation notice.",
    "contacts": {
      "phone": "(602) 771‑6602",
      "email": "uitstatus@azdes.gov"
    },
    "last_verified_date": "2026-02-05",
    "source_notes": [
      "Arizona DES explains that employers pay unemployment tax when they pay $1,500 in wages in a quarter or have one employee for 20 weeks; domestic employers are liable at $1,000; agricultural employers are liable at $20,000 or 10 workers for 20 weeks; nonprofits become liable when they employ four or more people for 20 weeks【152754052872605†L421-L437】.",
      "The DES “Applying for an Unemployment Insurance Tax Account Number” instructions say new businesses must register with DES and the Department of Revenue by completing the Arizona Joint Tax Application (JT‑1/UC‑001); the application cannot be processed without a FEIN and DES mails a Determination of Liability letter with the employer account number and tax rate after processing【147277426253297†L405-L416】.",
      "The Arizona Department of Revenue notes that every employer compensating an employee for services performed in Arizona must register its EIN via the Joint Tax Application and withhold state income tax from the first payroll【996119115762198†L129-L139】; once registered, the company’s EIN is its withholding ID and DES mails a determination letter if UI taxes are due【996119115762198†L142-L151】.",
      "The DES contact page lists the Employer Registration Unit phone number (602‑771‑6602) and email uitstatus@azdes.gov【634438238097038†L470-L477】.",
      "The Joint Tax Application (JT‑1/UC‑001) form shows that employers must provide their FEIN, organization type, business name and addresses, business phone/fax/email, description of business, NAICS code, state of incorporation, date business started, first payroll date, and names and Social Security numbers of owners/officers【807060179444228†L22-L69】."
    ],
    "rules": {
      "status": "complete",
      "todo": [],
      "ui_liability": {
        "general": {
          "wage_threshold": {
            "amount": 1500.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "min_employees": 1,
            "weeks": 20,
            "unit": "weeks_in_year"
          }
        },
        "domestic": {
          "wage_threshold": {
            "amount": 1000.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "min_employees": null,
            "weeks": null,
            "unit": null
          }
        },
        "agricultural": {
          "wage_threshold": {
            "amount": 20000.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "min_employees": 10,
            "weeks": 20,
            "unit": "weeks_in_year"
          }
        },
        "nonprofit": {
          "wage_threshold": {
            "amount": null,
            "period": null
          },
          "weeks_threshold": {
            "min_employees": 4,
            "weeks": 20,
            "unit": "weeks_in_year"
          }
        },
        "notes": [
          "Arizona DES outlines liability thresholds for general, domestic, agricultural and nonprofit employers【152754052872605†L421-L437】."
        ]
      },
      "withholding": {
        "required_from_first_payroll": true,
        "notes": [
          "The Arizona Department of Revenue states that employers must register and withhold state income tax for employees performing services in Arizona beginning with the first payroll【996119115762198†L129-L139】."
        ]
      }
    }
  },
  {
    "state_code": "AR",
    "state_name": "Arkansas",
    "agency_name": "Arkansas Division of Workforce Services",
    "registration_portal_url": "https://www.workforce.arkansas.gov/",
    "ui_wage_threshold_text": "Employ one or more workers for 10 days or more during a calendar year; domestic employers become liable when cash wages total $1,000 or more in a quarter; agricultural employers become liable when cash wages total $20,000 in a quarter or when at least 10 workers are employed for some part of a day in 20 different weeks",
    "ui_threshold_weeks_text": "10 days of employment for general liability; 20 different weeks with 10 workers for agricultural employment",
    "withholding_registration_required": true,
    "withholding_threshold_description": "Employers paying wages to employees in Arkansas must register with the Department of Finance and Administration for a withholding wage tax account and withhold Arkansas income tax beginning with the first payroll; registration is completed through the Arkansas Taxpayer Access Point (ATAP)",
    "typical_processing_time": "Employers registering online via the Tax21 or EZ Tax Registration system receive an employer account number upon approval; paper Form DWS‑ARK‑201 may take several weeks. Withholding registration via ATAP is processed online (time varies).",
    "required_information": [
      "Federal Employer Identification Number (FEIN)",
      "Legal name and trade name of the business",
      "Business physical and mailing addresses and phone number",
      "Type of organization and date workers were first employed",
      "Date and amount of first payroll and total quarterly wages",
      "Names and Social Security numbers of owners/partners/officers",
      "Information on acquisition or reorganization of another business"
    ],
    "filing_methods": [
      "Online via Tax21/EZ Tax Registration (preferred) to file the ‘Report to Determine Liability Under the Division of Workforce Services Law’ (Form DWS‑ARK‑201)",
      "Paper Form DWS‑ARK‑201 submitted to Employer Account Services",
      "Withholding registration via Arkansas Taxpayer Access Point (ATAP)"
    ],
    "confirmation_proof": "Nine‑digit employer account number issued by the Division of Workforce Services; withholding registration yields an Arkansas withholding account number",
    "contacts": {
      "phone": "501-682-3798",
      "email": "withholding@dfa.arkansas.gov"
    },
    "last_verified_date": "2025-11-05",
    "source_notes": "Arkansas Employer Handbook – employer liability criteria and account creation; Employer Account Services contact; ATAP contact information",
    "rules": {
      "status": "complete",
      "ui_liability": {
        "general": {
          "wage_threshold": {
            "amount": null,
            "period": null
          },
          "weeks_threshold": {
            "weeks": null,
            "unit": null,
            "min_employees": null
          },
          "days_threshold": {
            "days": 10,
            "period": "year",
            "min_employees": 1
          }
        },
        "domestic": {
          "wage_threshold": {
            "amount": 1000.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "weeks": null,
            "unit": null,
            "min_employees": null
          }
        },
        "agricultural": {
          "wage_threshold": {
            "amount": 20000.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "weeks": 20,
            "unit": "weeks_in_year",
            "min_employees": 10
          }
        },
        "nonprofit": {
          "wage_threshold": {
            "amount": null,
            "period": null
          },
          "weeks_threshold": {
            "weeks": null,
            "unit": null,
            "min_employees": null
          }
        },
        "notes": []
      },
      "withholding": {
        "required_from_first_payroll": true,
        "notes": []
      },
      "todo": []
    }
  },
  {
    "state_code": "CA",
    "state_name": "California",
    "agency_name": "California Employment Development Department (EDD)",
    "registration_portal_url": "https://eddservices.edd.ca.gov/",
    "ui_wage_threshold_text": "$100 in wages paid in a calendar quarter (general business); household employers are liable when cash wages reach $750 in a quarter; corporate officers who pay wages to themselves or family members are also subject to coverage",
    "ui_threshold_weeks_text": null,
    "withholding_registration_required": true,
    "withholding_threshold_description": "Employers paying wages to California residents or nonresidents for services performed in the state must register and withhold California state income tax beginning with the first payroll (few exceptions apply)",
    "typical_processing_time": "Employers who register online through e‑Services for Business receive their EDD account number immediately; paper registration by mail can take 10–14 days to process",
    "required_information": [
      "Names and Social Security numbers of all responsible parties, owners, partners or corporate officers",
      "Physical and mailing addresses, business telephone number and email address",
      "Date of first payroll when wages exceeded $100 (or $750 for household employers)",
      "Federal Employer Identification Number (FEIN)",
      "Description of principal business activities (NAICS)",
      "Previous EDD employer account number (if any) and previous owner’s information",
      "Business name as registered with the California Secretary of State and associated ID numbers",
      "DBA/trade names and contact person information"
    ],
    "filing_methods": [
      "Online via EDD e‑Services for Business (preferred)",
      "Paper forms (DE 1 for commercial employers, DE 1HW for household employers, DE 1NP for nonprofit employers, etc.)"
    ],
    "confirmation_proof": "Payroll tax account number (EDD employer account number) and confirmation letter issued by EDD",
    "contacts": {
      "phone": "888-745-3886",
      "email": null
    },
    "last_verified_date": "2025-11-01",
    "source_notes": "EDD registration threshold and required information",
    "rules": {
      "status": "complete",
      "ui_liability": {
        "general": {
          "wage_threshold": {
            "amount": 100.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "weeks": null,
            "unit": null,
            "min_employees": null
          }
        },
        "domestic": {
          "wage_threshold": {
            "amount": 750.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "weeks": null,
            "unit": null,
            "min_employees": null
          }
        },
        "agricultural": {
          "wage_threshold": {
            "amount": null,
            "period": null
          },
          "weeks_threshold": {
            "weeks": null,
            "unit": null,
            "min_employees": null
          }
        },
        "nonprofit": {
          "wage_threshold": {
            "amount": null,
            "period": null
          },
          "weeks_threshold": {
            "weeks": null,
            "unit": null,
            "min_employees": null
          }
        },
        "notes": [
          "Corporate officers paying wages to themselves or family members are also subject"
        ]
      },
      "withholding": {
        "required_from_first_payroll": true,
        "notes": [
          "Exceptions may apply"
        ]
      },
      "todo": []
    }
  },
  {
    "state_code": "CO",
    "state_name": "Colorado",
    "agency_name": "Colorado Department of Labor and Employment (CDLE) – Unemployment Insurance Division & Colorado Department of Revenue",
    "registration_portal_url": "https://mybiz.colorado.gov",
    "ui_wage_threshold_text": "General employers become liable for unemployment insurance when they pay at least $1,500 in wages in a calendar quarter; domestic employers become liable when they pay $1,000 or more in wages in a quarter; agricultural employers become liable when cash wages total $20,000 in a quarter; nonprofit 501(c)(3) employers become liable with four or more employees.",
    "ui_threshold_weeks_text": "Liability also arises when one or more workers are employed for part of a day in 20 different weeks during a calendar year (general employers); agricultural employers become liable when ten or more agricultural workers are employed for part of a day in 20 weeks; nonprofit employers become liable when they have four or more workers for part of a day in 20 weeks.",
    "withholding_registration_required": true,
    "withholding_threshold_description": "Employers that pay wages to employees for services performed in Colorado must withhold Colorado income tax from the first payroll and must register for a wage withholding account with the Colorado Department of Revenue. Registration is available online through MyBizColorado or by filing the Wage Withholding Account Application (CR 0100).",
    "typical_processing_time": "Processing times vary; accounts are generally opened shortly after registration though certain account types may take 4–6 weeks to process【888360988188442†L146-L168】.",
    "required_information": [
      "Federal Employer Identification Number (FEIN)",
      "Legal business name and any trade name (DBA)",
      "Business entity type (corporation, sole proprietorship, partnership, LLC, nonprofit, etc.)",
      "Principal business address and mailing address",
      "Business phone number and email address",
      "Date business began in Colorado and first date of payroll",
      "Location of payroll records",
      "Names, Social Security numbers and titles of all owners, partners and corporate officers",
      "Description of business activities and NAICS code",
      "Banking information for electronic payments (optional)"
    ],
    "filing_methods": [
      "Register for unemployment insurance and withholding tax online through MyBizColorado (mybiz.colorado.gov)",
      "Alternatively, complete the UITL‑100 Application for Unemployment Insurance Account and Determination of Employer Liability and mail it to the CDLE",
      "For withholding only, out‑of‑state businesses may complete Form CR 0100 (Wage Withholding Account Application) and mail or fax it to the Department of Revenue"
    ],
    "confirmation_proof": "After registration, CDLE issues a letter with the employer account number and tax rate; the Department of Revenue assigns a wage withholding account number (usually your FEIN) and sends a confirmation letter.",
    "contacts": {
      "phone": "(303) 318‑9100",
      "email": null
    },
    "last_verified_date": "2026-02-05",
    "source_notes": [
      "The Colorado Department of Labor and Employment explains that employers are liable for UI when they pay at least $1,500 in wages in a quarter or employ one or more workers for part of a day in 20 weeks; domestic employers are liable when paying $1,000; agricultural employers at $20,000 or 10 workers for 20 weeks; nonprofits become liable when they have four or more employees for 20 weeks【717600325440359†L322-L396】.",
      "The Colorado Department of Revenue’s withholding accounts page notes that employers who must withhold Colorado income tax must apply for a withholding tax account and that there is no fee; businesses inside Colorado can register via MyBizColorado or the Wage Withholding Account Application (CR 0100); accounts for certain purposes may take 4–6 weeks to process【888360988188442†L146-L168】.",
      "UI Employer Services contact numbers (303‑318‑9100 and 1‑800‑480‑8299) are provided on the employer liability chart page【717600325440359†L458-L468】, and the Department of Revenue tax helpline (303‑238‑7378) is listed on the Contact Us page【227704874308306†L130-L142】.",
      "The UITL‑100 form requires FEIN, business entity type, business name and address, first payroll date, names and Social Security numbers of owners/officers, and other details【600275258200365†L25-L80】."
    ],
    "rules": {
      "status": "complete",
      "todo": [],
      "ui_liability": {
        "general": {
          "wage_threshold": {
            "amount": 1500.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "min_employees": 1,
            "weeks": 20,
            "unit": "weeks_in_year"
          }
        },
        "domestic": {
          "wage_threshold": {
            "amount": 1000.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "min_employees": null,
            "weeks": null,
            "unit": null
          }
        },
        "agricultural": {
          "wage_threshold": {
            "amount": 20000.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "min_employees": 10,
            "weeks": 20,
            "unit": "weeks_in_year"
          }
        },
        "nonprofit": {
          "wage_threshold": {
            "amount": null,
            "period": null
          },
          "weeks_threshold": {
            "min_employees": 4,
            "weeks": 20,
            "unit": "weeks_in_year"
          }
        },
        "notes": [
          "Liability thresholds for general, domestic, agricultural and nonprofit employers are described by CDLE【717600325440359†L322-L396】."
        ]
      },
      "withholding": {
        "required_from_first_payroll": true,
        "notes": [
          "Employers paying wages for services performed in Colorado must register for a wage withholding account and withhold state income tax from the first payroll【888360988188442†L146-L168】."
        ]
      }
    }
  },
  {
    "state_code": "CT",
    "state_name": "Connecticut",
    "agency_name": "Connecticut Department of Labor – Employer Status Unit & Connecticut Department of Revenue Services (DRS)",
    "registration_portal_url": "https://www.ct.gov/doltax",
    "ui_wage_threshold_text": "Employers become liable for unemployment contributions when they pay $1,500 or more in wages in a calendar quarter; domestic employers become liable when cash wages total $1,000 in a quarter; agricultural employers become liable when cash wages total $20,000 in a quarter; nonprofit 501(c)(3) organizations become liable if they have at least one employee.",
    "ui_threshold_weeks_text": "Liability also arises when one or more employees work for some portion of a day in each of twenty different weeks during the current or preceding year (general employers); agricultural employers become liable when ten or more workers are employed for part of a day in 20 weeks; nonprofit employers become liable when they have one or more employees for some portion of a day in 13 weeks.",
    "withholding_registration_required": true,
    "withholding_threshold_description": "Employers that maintain an office or transact business in Connecticut must register for Connecticut income tax withholding through myconneCT and begin withholding tax from the first payroll, even if they are already registered for other taxes.",
    "typical_processing_time": "1–2 weeks (registration through myconneCT is immediate; official permit letter may arrive later)",
    "required_information": [
      "Federal Employer Identification Number (FEIN) or Social Security number",
      "Legal business name and any “doing business as” (DBA) name",
      "Physical and mailing address of the business",
      "Business phone number, fax number and email address",
      "Type of organization (corporation, LLC, sole proprietorship, partnership, etc.) and NAICS code",
      "Names and Social Security numbers of responsible owners, partners or corporate officers",
      "Banking information for payment of permit fees or taxes",
      "Date the business started in Connecticut and first date wages were paid",
      "Description of business activities"
    ],
    "filing_methods": [
      "Register for unemployment insurance online at the Connecticut Department of Labor’s Employer Status portal (ct.gov/doltax)",
      "Register for Connecticut income tax withholding through myconneCT (portal.ct.gov/DRS)",
      "Employers may also contact the Employer Status Unit to obtain paper forms if necessary, but online registration is required"
    ],
    "confirmation_proof": "After registration, the Connecticut Department of Labor assigns an unemployment insurance employer account number and tax rate; the Department of Revenue Services issues a permit number and confirmation via myconneCT.",
    "contacts": {
      "phone": "(860) 263‑6550",
      "email": "dol.status@ct.gov"
    },
    "last_verified_date": "2026-02-05",
    "source_notes": [
      "The Connecticut Employer’s Guide states that employers must register for unemployment insurance online and become liable when they pay $1,500 in wages in a quarter or have one or more employees for some portion of a day in each of 20 weeks【959957717358738†L190-L207】【959957717358738†L259-L266】. Domestic employers are liable at $1,000 in cash wages, agricultural employers at $20,000 in cash wages or when 10 workers are employed for 20 weeks, and nonprofit 501(c)(3) organizations are liable when they have an employee for part of a day in thirteen weeks【959957717358738†L303-L345】.",
      "The Connecticut Department of Revenue Services notes that employers starting a new business must register for Connecticut income tax withholding through myconneCT and that employers with an office or transacting business in Connecticut must withhold from employees’ wages【826850261466679†L85-L115】.",
      "The DRS new‑business registration flyer lists information needed to register such as FEIN/SSN, legal name, DBA, business address, banking information and names and Social Security numbers of responsible owners or officers【741432796974868†L40-L57】.",
      "The same flyer provides helpline phone numbers for DRS new business registration assistance【741432796974868†L166-L205】."
    ],
    "rules": {
      "status": "complete",
      "todo": [],
      "ui_liability": {
        "general": {
          "wage_threshold": {
            "amount": 1500.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "min_employees": 1,
            "weeks": 20,
            "unit": "weeks_in_year"
          }
        },
        "domestic": {
          "wage_threshold": {
            "amount": 1000.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "min_employees": null,
            "weeks": null,
            "unit": null
          }
        },
        "agricultural": {
          "wage_threshold": {
            "amount": 20000.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "min_employees": 10,
            "weeks": 20,
            "unit": "weeks_in_year"
          }
        },
        "nonprofit": {
          "wage_threshold": {
            "amount": null,
            "period": null
          },
          "weeks_threshold": {
            "min_employees": 1,
            "weeks": 13,
            "unit": "weeks_in_year"
          }
        },
        "notes": [
          "Liability thresholds and special rules for general, domestic, agricultural and nonprofit employers are explained in the Connecticut Employer’s Guide【959957717358738†L259-L345】."
        ]
      },
      "withholding": {
        "required_from_first_payroll": true,
        "notes": [
          "Connecticut DRS requires employers to register through myconneCT and withhold income tax from employees’ wages from the first payroll【826850261466679†L85-L115】."
        ]
      }
    }
  },
  {
    "state_code": "DE",
    "state_name": "Delaware",
    "agency_name": "Delaware Department of Labor – Division of Unemployment Insurance & Delaware Division of Revenue",
    "registration_portal_url": "https://onestop.delaware.gov",
    "ui_wage_threshold_text": "General employers are liable when they pay $1,500 or more in wages in a calendar quarter; domestic employers become liable when cash wages total $1,000 in a quarter; agricultural employers are liable when they pay $20,000 or more in cash wages in a quarter; government and nonprofit employers are covered even though they are not liable under FUTA.",
    "ui_threshold_weeks_text": "Liability also arises when at least one employee works for some portion of a day on 20 different days in a year (general employers); agricultural employers become liable when they have 10 or more workers on 20 different days; nonprofits and governmental employers are liable when they have one or more employees in 20 weeks.",
    "withholding_registration_required": true,
    "withholding_threshold_description": "Every employer who maintains an office or transacts business in Delaware and pays wages subject to withholding must register by completing the Combined Registration Application (CRA); employers use their federal EIN as the withholding identification number. Out‑of‑state employers who pay wages to Delaware residents must register as withholding agents via Delaware One Stop.",
    "typical_processing_time": "Employer account numbers are issued after the Division of Unemployment Insurance processes Form UC‑1; processing time varies but typically takes a few weeks.",
    "required_information": [
      "Federal Employer Identification Number (FEIN)",
      "Legal business name and trade name (if any)",
      "Physical location and mailing address of the business",
      "Business phone number and email address",
      "Type of organization and description of business activities",
      "Date the business started and date of first payroll in Delaware",
      "Employment history for the last five years including acquisitions and predecessor businesses",
      "Names, titles and Social Security numbers of owners, partners or corporate officers"
    ],
    "filing_methods": [
      "Complete Form UC‑1 (Report to Determine Liability and Application for Employer Account Number) and return it within 20 days of the first day of business to the Delaware Division of Unemployment Insurance",
      "Employers may download the UC‑1 from the Department of Labor website or request it by phone; some information can be submitted through Delaware One Stop",
      "For withholding, complete the Combined Registration Application (CRA) online through the Division of Revenue or register as a withholding agent via Delaware One Stop"
    ],
    "confirmation_proof": "The Division of Unemployment Insurance reviews Form UC‑1 and assigns an employer account number along with a Notice of Coverage poster; the Division of Revenue uses the employer’s FEIN as the withholding ID and issues a permit letter.",
    "contacts": {
      "phone": "(302) 761‑8484",
      "email": null
    },
    "last_verified_date": "2026-02-05",
    "source_notes": [
      "The Delaware Division of Finance and Department of Labor explain that employers are liable for unemployment taxes when they pay $1,500 in wages in a quarter or employ at least one person for 20 days; agricultural employers are liable at $20,000 in wages or 10 workers for 20 days; domestic employers are liable when cash wages total $1,000【608774991962551†L10-L28】.",
      "The Department of Labor’s Employer FAQs note that employers must file Form UC‑1 within 20 days of the first day of business; the form determines liability and establishes an employer account number and must be returned promptly【290452695497594†L119-L181】.",
      "The Delaware UI Employer Handbook restates the liability thresholds and states that employers receive an account number and Notice of Coverage when liability is established; contact numbers are provided for questions【452469301903578†L592-L652】【452469301903578†L657-L693】.",
      "The handbook explains that Form UC‑1 requests information about the nature of the business, organization type, changes in status, employment history and acquisitions, and must be returned within ten days【452469301903578†L1571-L1581】【452469301903578†L1588-L1590】.",
      "The Delaware Division of Revenue’s Employer Guide states that employers who maintain an office or transact business in Delaware and pay wages subject to withholding must register using the Combined Registration Application; the FEIN becomes the withholding ID number【121947700220292†L54-L67】 and contact information for the withholding department is provided【121947700220292†L123-L137】. The One Stop site also notes that out‑of‑state employers may register as withholding agents when paying Delaware wages【525710931876080†L38-L59】."
    ],
    "rules": {
      "status": "complete",
      "todo": [],
      "ui_liability": {
        "general": {
          "wage_threshold": {
            "amount": 1500.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "min_employees": 1,
            "weeks": 20,
            "unit": "days_in_year"
          }
        },
        "domestic": {
          "wage_threshold": {
            "amount": 1000.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "min_employees": null,
            "weeks": null,
            "unit": null
          }
        },
        "agricultural": {
          "wage_threshold": {
            "amount": 20000.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "min_employees": 10,
            "weeks": 20,
            "unit": "days_in_year"
          }
        },
        "nonprofit": {
          "wage_threshold": {
            "amount": null,
            "period": null
          },
          "weeks_threshold": {
            "min_employees": 1,
            "weeks": 20,
            "unit": "weeks_in_year"
          }
        },
        "notes": [
          "Delaware liability rules require general employers to pay at least $1,500 in wages or have an employee on 20 days; domestic employers are liable at $1,000; agricultural employers at $20,000 or 10 workers for 20 days; government and nonprofit employers are covered and may elect reimbursement【608774991962551†L10-L28】."
        ]
      },
      "withholding": {
        "required_from_first_payroll": true,
        "notes": [
          "The Delaware Division of Revenue requires employers who maintain an office or do business in Delaware and pay wages subject to withholding to register using the Combined Registration Application and withhold from the first payroll【121947700220292†L54-L67】."
        ]
      }
    }
  },
  {
    "state_code": "FL",
    "state_name": "Florida",
    "agency_name": "Florida Department of Revenue",
    "registration_portal_url": "https://floridarevenue.com/taxes/registration",
    "ui_wage_threshold_text": "$1,500 in wages in a calendar quarter or one or more employees for 20 weeks; agricultural employers become liable at $10,000 cash wages in a quarter or five workers for 20 weeks; domestic employers become liable when they pay $1,000 in wages in a quarter",
    "ui_threshold_weeks_text": "20 weeks with at least one employee (general employment)",
    "withholding_registration_required": false,
    "withholding_threshold_description": "Florida has no individual income tax; employers therefore do not need to register for state wage withholding",
    "typical_processing_time": "The online Florida Business Tax Application processes registrations in about three business days; paper Form DR‑1 processing may take longer",
    "required_information": [
      "Federal Employer Identification Number (FEIN) or Social Security number",
      "Reason for applying (opening a new business, adding a location, etc.)",
      "Legal name and trade name of the business",
      "Physical and mailing addresses and telephone number",
      "Form of business ownership (corporation, partnership, sole proprietor, etc.)",
      "Date of first taxable transaction/first wages paid",
      "Names, addresses and Social Security numbers of business owners/officers"
    ],
    "filing_methods": [
      "Online Florida Business Tax Application (interactive wizard)",
      "Paper Form DR‑1 mailed to the Department of Revenue"
    ],
    "confirmation_proof": "Reemployment Tax Account Number and Certificate of Registration mailed after processing",
    "contacts": {
      "phone": "850-488-6800",
      "email": "emailDOR@floridarevenue.com"
    },
    "last_verified_date": "2025-11-01",
    "source_notes": "Florida DOR reemployment tax liability and processing time",
    "rules": {
      "status": "complete",
      "ui_liability": {
        "general": {
          "wage_threshold": {
            "amount": 1500.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "weeks": 20,
            "unit": "weeks_in_year",
            "min_employees": 1
          }
        },
        "domestic": {
          "wage_threshold": {
            "amount": 1000.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "weeks": null,
            "unit": null,
            "min_employees": null
          }
        },
        "agricultural": {
          "wage_threshold": {
            "amount": 10000.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "weeks": 20,
            "unit": "weeks_in_year",
            "min_employees": 5
          }
        },
        "nonprofit": {
          "wage_threshold": {
            "amount": null,
            "period": null
          },
          "weeks_threshold": {
            "weeks": null,
            "unit": null,
            "min_employees": null
          }
        },
        "notes": []
      },
      "withholding": {
        "required_from_first_payroll": false,
        "notes": [
          "Florida has no individual income tax"
        ]
      },
      "todo": []
    }
  },
  {
    "state_code": "GA",
    "state_name": "Georgia",
    "agency_name": "Georgia Department of Labor",
    "registration_portal_url": "https://www.dol.state.ga.us/WS4Net/",
    "ui_wage_threshold_text": "$1,500 in gross payroll in a calendar quarter or one worker in 20 different weeks in a year; agricultural employers become liable when they pay $20,000 in a quarter or have 10 or more workers for 20 weeks; domestic employers become liable when they pay $1,000 in cash wages in a quarter",
    "ui_threshold_weeks_text": "20 different weeks with at least one worker (general employment)",
    "withholding_registration_required": true,
    "withholding_threshold_description": "Employers with employees performing services in Georgia must register and withhold Georgia income tax from the first wages paid to resident and nonresident employees; registration is through the Georgia Tax Center (gtc.dor.ga.gov)",
    "typical_processing_time": "Online registration through the Employer Portal yields an account number immediately; paper Employer Status Report (Form DOL‑1N) may take up to 30 days for processing",
    "required_information": [
      "Federal Employer Identification Number (FEIN)",
      "Date of first Georgia hire and date of first Georgia payroll",
      "Date of incorporation or business formation",
      "Names, addresses and Social Security numbers of all owners, partners or corporate officers",
      "Current mailing address",
      "Type of business (corporation, LLC, sole proprietorship, etc.)",
      "Description of business activities and NAICS code",
      "Information about any acquisition of an existing business (name of prior owner, account number and date of purchase)"
    ],
    "filing_methods": [
      "Online via GDOL Employer Portal (preferred)",
      "Paper Employer Status Report (Form DOL‑1N) submitted by mail"
    ],
    "confirmation_proof": "Employer account number and determination letter issued by the Georgia Department of Labor",
    "contacts": {
      "phone": "855-436-7365",
      "email": null
    },
    "last_verified_date": "2025-11-01",
    "source_notes": "GDOL liability thresholds and registration processing time",
    "rules": {
      "status": "complete",
      "ui_liability": {
        "general": {
          "wage_threshold": {
            "amount": 1500.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "weeks": 20,
            "unit": "weeks_in_year",
            "min_employees": 1
          }
        },
        "domestic": {
          "wage_threshold": {
            "amount": 1000.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "weeks": null,
            "unit": null,
            "min_employees": null
          }
        },
        "agricultural": {
          "wage_threshold": {
            "amount": 20000.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "weeks": 20,
            "unit": "weeks_in_year",
            "min_employees": 10
          }
        },
        "nonprofit": {
          "wage_threshold": {
            "amount": null,
            "period": null
          },
          "weeks_threshold": {
            "weeks": null,
            "unit": null,
            "min_employees": null
          }
        },
        "notes": []
      },
      "withholding": {
        "required_from_first_payroll": true,
        "notes": []
      },
      "todo": []
    }
  },
  {
    "state_code": "HI",
    "state_name": "Hawaii",
    "agency_name": "Hawaii Department of Labor and Industrial Relations – Unemployment Insurance Division & Hawaii Department of Taxation",
    "registration_portal_url": "https://uiclaims.hawaii.gov",
    "ui_wage_threshold_text": "Hawaii covers most employers who hire one or more individuals to perform services in the state. Agricultural labor is excluded from coverage if the employer pays less than $20,000 in cash wages in each quarter and employs nine or fewer agricultural workers or has fewer than 20 weeks of agricultural work; domestic service is excluded if cash remuneration is less than $1,000 in a quarter. Casual labor, family employment and small fishing vessel crews are also excluded.",
    "ui_threshold_weeks_text": "Liability generally arises when an employer hires at least one individual to perform services in Hawaii; agricultural employers become liable when they have 10 or more workers in 20 weeks or pay $20,000 or more in cash wages in each quarter; domestic employers become liable when cash wages total $1,000 in a quarter.",
    "withholding_registration_required": true,
    "withholding_threshold_description": "Employers paying wages for services performed in Hawaii (or wages paid from a Hawaii office) must withhold Hawaii income tax from the first payroll. Employers must obtain a Hawaii Tax Identification Number for withholding by submitting Form BB‑1 or registering through Hawaii Tax Online.",
    "typical_processing_time": "1–2 weeks (no fee to open a withholding account, and account numbers are usually issued shortly after registration)",
    "required_information": [
      "Federal Employer Identification Number (FEIN)",
      "Legal business name and trade name (if any)",
      "Physical location of the business in Hawaii and mailing address",
      "Business phone number, fax number and email address",
      "Type of business organization and date business started in Hawaii",
      "Date employees were first hired in Hawaii and date of first payroll",
      "Names, titles and Social Security numbers of owners, partners or corporate officers",
      "Nature of the business and NAICS code"
    ],
    "filing_methods": [
      "Register for a Hawaii unemployment insurance account online at uiclaims.hawaii.gov; paper Form UC‑1 is no longer accepted",
      "For withholding, complete Form BB‑1 (Basic Business Application) or register online through Hawaii Tax Online to obtain a Hawaii Tax ID number",
      "Quarterly UI wage and tax reports must be filed electronically even if no wages are paid"
    ],
    "confirmation_proof": "After submitting the online application, the Hawaii Department of Labor determines liability and issues a UI account number and Notice to Employees; the Department of Taxation issues a Hawaii Tax ID number and confirmation letter for withholding registration.",
    "contacts": {
      "phone": "(808) 586‑8982",
      "email": null
    },
    "last_verified_date": "2026-02-05",
    "source_notes": [
      "Hawaii’s Unemployment Insurance Handbook explains that paper Form UC‑1 is no longer accepted and employers must register online; employers must file a status report within 20 days after hiring an employee to obtain a UI account number【715477831091302†L84-L99】.",
      "The coverage exclusions page states that employers with one or more individuals are generally subject to coverage; agricultural labor is excluded if wages are less than $20,000 per quarter and there are nine or fewer employees or less than 20 weeks of agricultural work; domestic service is excluded if remuneration is less than $1,000 per quarter【549767931418783†L48-L67】.",
      "The UI forms page notes that employers must register online at uiclaims.hawaii.gov and lists phone numbers for registration assistance on Oahu, Hawaii Island, Maui and Kauai【683219072822275†L52-L61】.",
      "The Hawaii Department of Taxation states that employers must withhold Hawaii income tax on wages for services performed in the state, and that employers can request a withholding account number by completing Form BB‑1 or registering through Hawaii Tax Online; no fee is charged to open the account【113556195976741†L75-L128】.",
      "Booklet A: Employer’s Tax Guide explains that new employers must obtain a Hawaii Tax ID number using Form BB‑1, obtain a federal EIN, and register with the Unemployment Insurance Division within 20 days after services are first performed【124553436147000†L380-L403】."
    ],
    "rules": {
      "status": "complete",
      "todo": [],
      "ui_liability": {
        "general": {
          "wage_threshold": {
            "amount": null,
            "period": null
          },
          "weeks_threshold": {
            "min_employees": 1,
            "weeks": null,
            "unit": null
          }
        },
        "domestic": {
          "wage_threshold": {
            "amount": 1000.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "min_employees": null,
            "weeks": null,
            "unit": null
          }
        },
        "agricultural": {
          "wage_threshold": {
            "amount": 20000.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "min_employees": 10,
            "weeks": 20,
            "unit": "weeks_in_year"
          }
        },
        "nonprofit": {
          "wage_threshold": {
            "amount": null,
            "period": null
          },
          "weeks_threshold": {
            "min_employees": 1,
            "weeks": null,
            "unit": null
          }
        },
        "notes": [
          "Hawaii covers most employers from the first worker, but agricultural labor is excluded until $20,000 in cash wages or 10 workers in 20 weeks, and domestic service is excluded until $1,000 in wages【549767931418783†L48-L67】."
        ]
      },
      "withholding": {
        "required_from_first_payroll": true,
        "notes": [
          "The Hawaii Department of Taxation requires employers to withhold income tax on wages performed in Hawaii from the first payroll and to obtain a Hawaii Tax ID number via Form BB‑1 or online registration【113556195976741†L75-L128】."
        ]
      }
    }
  },
  {
    "state_code": "ID",
    "state_name": "Idaho",
    "agency_name": "Idaho Department of Labor – Unemployment Insurance Division & Idaho State Tax Commission",
    "registration_portal_url": "https://business.idaho.gov",
    "ui_wage_threshold_text": "General employers become liable for unemployment insurance when they pay $1,500 or more in total wages in any calendar quarter; domestic employers are liable when cash wages total $1,000 in a quarter; agricultural employers are liable when they pay $20,000 or more in cash wages in a quarter; nonprofit and governmental employers are subject from the first dollar of wages.",
    "ui_threshold_weeks_text": "Liability also arises when one or more individuals work for some portion of a week in 20 different weeks during a calendar year (general employers); agricultural employers become liable when ten or more individuals work for some portion of a week in 20 different weeks; nonprofit and governmental employers are covered from the first day wages are paid.",
    "withholding_registration_required": true,
    "withholding_threshold_description": "Employers with employees earning income while in Idaho must register for an Idaho withholding account and withhold income tax from the first payroll; this applies to all employees including agricultural, household and family members, and to residents working outside Idaho if tax is voluntarily withheld. Employers who fail to register may be subject to civil penalties.",
    "typical_processing_time": "The Idaho State Tax Commission sends the withholding account number and filing cycle within about 10 business days after receiving the application【833475292205908†L430-L458】.",
    "required_information": [
      "Federal Employer Identification Number (FEIN) and Social Security number (for sole proprietors)",
      "Legal business name and assumed business name (DBA)",
      "Date incorporated and state of incorporation",
      "Date business began in Idaho and physical location of Idaho operations",
      "Mailing address and business telephone number",
      "Contact person name, title, phone number and email address",
      "Type of business, primary activities and NAICS code",
      "Estimated monthly taxable sales and whether the business will sell tangible personal property",
      "Names, addresses and Social Security numbers of owners, partners or corporate officers",
      "Date employees were first hired and date of first paycheck"
    ],
    "filing_methods": [
      "Complete the Idaho Business Registration (IBR‑1) online at business.idaho.gov (fastest) to register for unemployment insurance and withholding",
      "Alternatively, submit the paper IBR‑1 form by mail or fax to the Idaho Department of Labor and Idaho State Tax Commission",
      "File quarterly UI wage and tax reports through the Employer Portal at labor.idaho.gov/employerportal"
    ],
    "confirmation_proof": "After submitting the Idaho Business Registration form, the Department of Labor determines coverage and issues a UI account number; the Idaho State Tax Commission issues a withholding account number and filing instructions within 10 business days.",
    "contacts": {
      "phone": "(208) 332‑3576",
      "email": null
    },
    "last_verified_date": "2026-02-05",
    "source_notes": [
      "The Idaho Unemployment Insurance Tax Information handbook states that employers must report wages and pay UI tax if, during the current or preceding year, total wages of $1,500 or more were paid in a quarter or one or more individuals worked for some portion of a week in 20 different weeks; agricultural employers are liable at $20,000 in cash wages or 10 workers for 20 weeks; domestic employers at $1,000 in cash wages; governmental and nonprofit 501(c)(3) employers are covered from the first dollar【42846448966547†L274-L279】【42846448966547†L290-L296】【42846448966547†L348-L351】【42846448966547†L426-L437】.",
      "The handbook notes that all new businesses must submit the Idaho Business Registration form online at business.idaho.gov within six months of becoming a covered employer【42846448966547†L29-L40】.",
      "The IBR‑1 form requires information such as FEIN, Social Security numbers of owners, legal business name, DBA, incorporation details, business addresses and contact information, type of business, estimated taxable sales, and dates employees were hired and first paid【824837863105032†L54-L96】【824837863105032†L165-L169】【824837863105032†L202-L203】.",
      "The Guide to Idaho Income Tax Withholding states that employers must register for a withholding account if they have employees earning income in Idaho and must withhold from the first payroll; failure to register may result in civil penalties【833475292205908†L290-L301】.",
      "The same guide explains that the Tax Commission sends a withholding account number and filing cycle within 10 business days after receiving the application and that the easiest way to apply is through the online business permit application【833475292205908†L430-L458】.",
      "Contact information for the Idaho Department of Labor and the Idaho State Tax Commission is provided in the guide【833475292205908†L35-L37】."
    ],
    "rules": {
      "status": "complete",
      "todo": [],
      "ui_liability": {
        "general": {
          "wage_threshold": {
            "amount": 1500.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "min_employees": 1,
            "weeks": 20,
            "unit": "weeks_in_year"
          }
        },
        "domestic": {
          "wage_threshold": {
            "amount": 1000.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "min_employees": null,
            "weeks": null,
            "unit": null
          }
        },
        "agricultural": {
          "wage_threshold": {
            "amount": 20000.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "min_employees": 10,
            "weeks": 20,
            "unit": "weeks_in_year"
          }
        },
        "nonprofit": {
          "wage_threshold": {
            "amount": null,
            "period": null
          },
          "weeks_threshold": {
            "min_employees": 1,
            "weeks": null,
            "unit": null
          }
        },
        "notes": [
          "Idaho UI liability thresholds for general, domestic, agricultural, and nonprofit/government employers are given in the Unemployment Insurance Tax Information handbook【42846448966547†L274-L279】【42846448966547†L290-L296】【42846448966547†L426-L437】."
        ]
      },
      "withholding": {
        "required_from_first_payroll": true,
        "notes": [
          "Employers with employees earning income in Idaho must register for an Idaho withholding account and withhold income tax from the first payroll; the Tax Commission sends account numbers within about 10 business days【833475292205908†L290-L301】【833475292205908†L430-L458】."
        ]
      }
    }
  },
  {
    "state_code": "IL",
    "state_name": "Illinois",
    "agency_name": "Illinois Department of Employment Security (IDES)",
    "registration_portal_url": "https://mytax.illinois.gov/",
    "ui_wage_threshold_text": "$1,500 in wages in a calendar quarter or one worker employed in 20 different weeks during a calendar year; domestic employers become liable at $1,000 in cash wages in a quarter; agricultural employers become liable when they pay $20,000 in cash wages in a quarter or have 10 or more workers for 20 weeks; nonprofit organizations are liable when they employ four or more persons in each of 20 weeks in a year",
    "ui_threshold_weeks_text": "20 weeks with at least one employee (general employment); 20 weeks with 4 or more employees (nonprofit organizations)",
    "withholding_registration_required": true,
    "withholding_threshold_description": "Employers that are required to withhold federal income tax from compensation paid for services performed in Illinois must register and withhold Illinois income tax from the first payroll; registration and filing are completed through MyTax Illinois",
    "typical_processing_time": "Registration through MyTax Illinois is generally processed within one to two business days; paper Form REG‑UI‑1 filings may take four to six weeks",
    "required_information": [
      "Business legal name and trade name",
      "Physical and mailing addresses, telephone number and email address",
      "Federal Employer Identification Number (FEIN)",
      "Previously assigned employer account number (if any)",
      "Type of organization (corporation, partnership, sole proprietor, etc.)",
      "Primary business activity and NAICS code",
      "Date the business was formed or incorporated",
      "Date the business first employed workers in Illinois and date of first payroll",
      "Information about acquisitions or transfers of another business",
      "Details about domestic service and agricultural employment if applicable"
    ],
    "filing_methods": [
      "Online registration via MyTax Illinois (preferred)",
      "Paper Report to Determine Liability Under the Unemployment Insurance Act (Form REG‑UI‑1)"
    ],
    "confirmation_proof": "IDES employer account number and tax rate notice (sent after registration)",
    "contacts": {
      "phone": "800-247-4984",
      "email": "REV.CRD@illinois.gov"
    },
    "last_verified_date": "2025-11-01",
    "source_notes": "Illinois liability thresholds and registration details",
    "rules": {
      "status": "complete",
      "ui_liability": {
        "general": {
          "wage_threshold": {
            "amount": 1500.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "weeks": 20,
            "unit": "weeks_in_year",
            "min_employees": 1
          }
        },
        "domestic": {
          "wage_threshold": {
            "amount": 1000.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "weeks": null,
            "unit": null,
            "min_employees": null
          }
        },
        "agricultural": {
          "wage_threshold": {
            "amount": 20000.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "weeks": 20,
            "unit": "weeks_in_year",
            "min_employees": 10
          }
        },
        "nonprofit": {
          "wage_threshold": {
            "amount": null,
            "period": null
          },
          "weeks_threshold": {
            "weeks": 20,
            "unit": "weeks_in_year",
            "min_employees": 4
          }
        },
        "notes": []
      },
      "withholding": {
        "required_from_first_payroll": true,
        "notes": []
      },
      "todo": []
    }
  },
  {
    "state_code": "IN",
    "state_name": "Indiana",
    "agency_name": "Indiana Department of Workforce Development",
    "registration_portal_url": "https://uplink.in.gov/ESS/ESSLogon.htm",
    "ui_wage_threshold_text": "$1 in wages paid to a covered worker (non‑agricultural employment); agricultural employers become liable when cash wages total $20,000 in a calendar quarter or when 10 or more agricultural workers are employed for 20 weeks in a calendar year",
    "ui_threshold_weeks_text": "20 weeks for agriculture if 10 or more workers are employed",
    "withholding_registration_required": true,
    "withholding_threshold_description": "Employers paying wages to residents or nonresidents for work performed in Indiana must register and withhold state income tax from the first payroll (non‑resident employees from reciprocal states may be exempt; nonresident employees from other states have a 30‑day safe harbor)",
    "typical_processing_time": "Most online registrations receive an employer account number within several business days; paper Form 2837 filings take longer",
    "required_information": [
      "Federal Employer Identification Number (FEIN)",
      "Legal name and trade name of the business",
      "Business physical and mailing address and telephone number",
      "Entity type (corporation, LLC, sole proprietor, etc.)",
      "Date of first wages paid and total gross wages for the prior quarter",
      "Number of employees and type of employment (regular, agricultural, nonprofit)",
      "Names, Social Security numbers and addresses of owners/officers"
    ],
    "filing_methods": [
      "Online via Uplink Employer Self‑Service (preferred)",
      "Paper Form 2837 (SUTA Account Number Application) mailed to the Department"
    ],
    "confirmation_proof": "Employer Account Number and confirmation letter issued by the Department of Workforce Development",
    "contacts": {
      "phone": "800-891-6499",
      "email": "dwdemployerassistance@dwd.in.gov"
    },
    "last_verified_date": "2025-11-01",
    "source_notes": "Indiana Employer Handbook – liability threshold and registration instructions",
    "rules": {
      "status": "complete",
      "ui_liability": {
        "general": {
          "wage_threshold": {
            "amount": 1.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "weeks": null,
            "unit": null,
            "min_employees": null
          }
        },
        "domestic": {
          "wage_threshold": {
            "amount": null,
            "period": null
          },
          "weeks_threshold": {
            "weeks": null,
            "unit": null,
            "min_employees": null
          }
        },
        "agricultural": {
          "wage_threshold": {
            "amount": 20000.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "weeks": 20,
            "unit": "weeks_in_year",
            "min_employees": 10
          }
        },
        "nonprofit": {
          "wage_threshold": {
            "amount": null,
            "period": null
          },
          "weeks_threshold": {
            "weeks": null,
            "unit": null,
            "min_employees": null
          }
        },
        "notes": [
          "non-agricultural coverage starts at $1 in wages"
        ]
      },
      "withholding": {
        "required_from_first_payroll": true,
        "notes": [
          "Reciprocal state exemptions and 30-day safe harbor for nonresident employees"
        ]
      },
      "todo": []
    }
  },
  {
    "state_code": "IA",
    "state_name": "Iowa",
    "agency_name": "Iowa Workforce Development – Unemployment Insurance Tax Bureau & Iowa Department of Revenue",
    "registration_portal_url": "https://www.myiowaui.org",
    "ui_wage_threshold_text": "Employers become liable for unemployment insurance when they pay $1,500 or more in wages in a calendar quarter; domestic employers are liable when cash wages total $1,000 in a quarter; agricultural employers are liable when cash wages total $20,000 in a quarter; nonprofit 501(c)(3) employers are liable when their payroll is $1,500 or more.",
    "ui_threshold_weeks_text": "Liability also arises when one or more employees perform covered services in at least 20 different weeks in a calendar year (general employers); agricultural employers become liable when they have 10 or more workers for some portion of a day in 20 weeks; nonprofit employers are liable when they have one or more employees for 20 weeks.",
    "withholding_registration_required": true,
    "withholding_threshold_description": "Employers with employees working in Iowa must register for an Iowa withholding tax permit and withhold Iowa income tax from the first payroll; registration is done through GovConnectIowa. Out‑of‑state employers must register if they withhold Iowa income tax from wages.",
    "typical_processing_time": "Account numbers may be available as soon as one business day when registering online through GovConnectIowa, but permit letters may take up to six weeks to arrive by mail【9342701929592†L100-L104】.",
    "required_information": [
      "Federal Employer Identification Number (FEIN)",
      "Legal business name and trade name",
      "Physical location and mailing address of the business",
      "Business phone number and email address",
      "Type of organization and NAICS code",
      "Names, addresses and Social Security numbers of owners, partners or corporate officers",
      "Date the business began and first date wages were paid in Iowa",
      "Number of employees and estimated payroll",
      "Contact person name, phone number and email"
    ],
    "filing_methods": [
      "Register for unemployment insurance online through myIowaUI (myiowaui.org) within 30 days after first paying wages",
      "Register for an Iowa withholding tax permit online through GovConnectIowa",
      "Employers can also mail the Business Tax Registration form (IDR 78‑005) for withholding, but online registration is faster"
    ],
    "confirmation_proof": "MyIowaUI provides an unemployment insurance account number upon successful registration; IWD sends an official determination letter by mail; the Iowa Department of Revenue issues a withholding permit and account number via GovConnectIowa and mails a permit letter.",
    "contacts": {
      "phone": "1‑888‑848‑7442",
      "email": "iwduitax@iwd.iowa.gov"
    },
    "last_verified_date": "2026-02-05",
    "source_notes": [
      "The Iowa Report to Determine Liability for Unemployment Insurance Tax states that employers become liable when they have one or more employees performing covered services in 20 different weeks or when payroll reaches $1,500 in a calendar quarter; agricultural employers become liable when they pay $20,000 in wages or have 10 workers for 20 weeks; domestic employers at $1,000 in wages; nonprofits at $1,500 or one employee for 20 weeks【476717311618928†L10-L49】.",
      "Iowa Workforce Development instructs employers to register their UI tax account within 30 days after the first date wages are paid through the myIowaUI online system【724798525969700†L129-L134】; the Employer Systems page provides contact details for the UI Tax Bureau【355852252465050†L175-L182】.",
      "GovConnectIowa explains that new tax permit registration requires information such as legal name, location and mailing address, FEIN, NAICS code, names and Social Security numbers of managing owners/officers and contact details【569019166298780†L236-L246】.",
      "Information from the Iowa Department of Revenue notes that after completing registration, employers may receive their account number as soon as one business day, but the permit letter may take up to six weeks by mail【9342701929592†L100-L104】."
    ],
    "rules": {
      "status": "complete",
      "todo": [],
      "ui_liability": {
        "general": {
          "wage_threshold": {
            "amount": 1500.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "min_employees": 1,
            "weeks": 20,
            "unit": "weeks_in_year"
          }
        },
        "domestic": {
          "wage_threshold": {
            "amount": 1000.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "min_employees": null,
            "weeks": null,
            "unit": null
          }
        },
        "agricultural": {
          "wage_threshold": {
            "amount": 20000.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "min_employees": 10,
            "weeks": 20,
            "unit": "weeks_in_year"
          }
        },
        "nonprofit": {
          "wage_threshold": {
            "amount": 1500.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "min_employees": 1,
            "weeks": 20,
            "unit": "weeks_in_year"
          }
        },
        "notes": [
          "Iowa UI liability thresholds for general, domestic, agricultural and nonprofit employers are provided in the Report to Determine Liability for Unemployment Insurance Tax【476717311618928†L10-L49】."
        ]
      },
      "withholding": {
        "required_from_first_payroll": true,
        "notes": [
          "Employers with employees working in Iowa must register for an Iowa withholding tax permit and withhold Iowa income tax from the first payroll; registration may be completed through GovConnectIowa【9342701929592†L100-L104】."
        ]
      }
    }
  },
  {
    "state_code": "KS",
    "state_name": "Kansas",
    "agency_name": "Kansas Department of Labor Employer Services and Kansas Department of Revenue",
    "registration_portal_url": "https://www.kansasemployer.gov/uitax/ and https://www.kdor.ks.gov/Apps/kdor/Cr16/BusinessTaxApplication",
    "ui_wage_threshold_text": "$1,500 in wages in any calendar quarter for general employers; household employers become liable when they pay $1,000 in cash wages in a quarter; agricultural employers become liable when cash wages reach $20,000 in a quarter; nonprofit employers become liable when they have four or more workers.",
    "ui_threshold_weeks_text": "20 different weeks with one or more workers for general employers; 20 weeks with 10 or more workers for agricultural employment; 20 weeks with four or more workers for 501(c)(3) nonprofits; household employment has no weeks test.",
    "withholding_registration_required": true,
    "withholding_threshold_description": "Any employer paying wages subject to federal withholding must register for a Kansas withholding tax account and withhold Kansas income tax from employees. Registration is required before the first payroll.",
    "typical_processing_time": "Employers receive their Kansas Employer Serial Number within two days of submitting the online Status Report and the unemployment account number is assigned immediately; the Kansas Department of Revenue issues the withholding tax account number upon completion of the online Business Tax Application.",
    "required_information": [
      "Federal Employer Identification Number (FEIN)",
      "Legal business name and trade name",
      "Physical and mailing addresses, phone number and email of the business",
      "Type of ownership and date and state of organization",
      "Date employment began in Kansas and date first wages were paid",
      "Total wages paid in the quarter and number of employees",
      "Names, Social Security numbers and addresses of owners, partners, or corporate officers",
      "Business activity or NAICS code",
      "Whether the business acquired or merged with another employer",
      "For nonprofit entities, a copy of the 501(c)(3) exemption"
    ],
    "filing_methods": [
      "Online via the Kansas Employer Self Service portal to file the Status Report (Form K‑CNS 010) and obtain a Kansas unemployment account number",
      "Mail Form K‑CNS 010 (Employer Status Report) to the Kansas Department of Labor",
      "Online via the Kansas Department of Revenue Business Tax Application (Form CR‑16) to register for withholding and other taxes",
      "Mail Form CR‑16 to the Kansas Department of Revenue"
    ],
    "confirmation_proof": "A Kansas unemployment account number and employer rate notice issued by the Department of Labor; a Kansas withholding tax account number issued by the Department of Revenue.",
    "contacts": {
      "phone": "785-296-5027 (UI), 785-296-6993 or 785-368-8222 (withholding)",
      "email": "KDOL.UITax@ks.gov (UI); KDOR_BusinessTaxEServices@ks.gov or tac@kdor.ks.gov (withholding)"
    },
    "last_verified_date": "2026-02-05",
    "source_notes": "Employer Handbook and Kansas Department of Labor Status Report requirements for liability and registration; GoCo payroll tax registration article for withholding and required information; Kansas Department of Labor Employer Services and Kansas Department of Revenue sites for registration portals and contact details; articles on employer serial number issuance and processing time.",
    "rules": {
      "status": "complete",
      "ui_liability": {
        "general": {
          "wage_threshold": {
            "amount": 1500.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "weeks": 20,
            "unit": "weeks_in_year",
            "min_employees": 1
          }
        },
        "domestic": {
          "wage_threshold": {
            "amount": 1000.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "weeks": null,
            "unit": null,
            "min_employees": null
          }
        },
        "agricultural": {
          "wage_threshold": {
            "amount": 20000.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "weeks": 20,
            "unit": "weeks_in_year",
            "min_employees": 10
          }
        },
        "nonprofit": {
          "wage_threshold": {
            "amount": null,
            "period": null
          },
          "weeks_threshold": {
            "weeks": 20,
            "unit": "weeks_in_year",
            "min_employees": 4
          }
        },
        "notes": []
      },
      "withholding": {
        "required_from_first_payroll": true,
        "notes": []
      },
      "todo": []
    }
  },
  {
    "state_code": "KY",
    "state_name": "Kentucky",
    "agency_name": "Kentucky Office of Unemployment Insurance and Kentucky Department of Revenue",
    "registration_portal_url": "https://kewes.ky.gov/ and https://onestop.ky.gov/",
    "ui_wage_threshold_text": "$1,500 in wages in a calendar quarter for general employers; $1,000 in wages in a quarter for household employers; $20,000 in wages in a quarter for agricultural employers; nonprofits become liable when they have four or more workers.",
    "ui_threshold_weeks_text": "20 different weeks with at least one employee for general employers; 20 weeks with 10 or more workers for agricultural employment; 20 weeks with four or more employees for nonprofit organizations; no weeks test for household employment.",
    "withholding_registration_required": true,
    "withholding_threshold_description": "Employers must withhold Kentucky income tax from wages paid to employees working in Kentucky when they are required to withhold federal income tax; registration for a Kentucky withholding tax account is required before paying wages.",
    "typical_processing_time": "The Kentucky Employer Identification Number (KEIN) for unemployment insurance is issued immediately upon completion of the online registration. The withholding tax account number is mailed or emailed after the Department of Revenue processes the registration.",
    "required_information": [
      "Federal Employer Identification Number (FEIN)",
      "Legal business name and any trade name",
      "Physical and mailing addresses, telephone and email",
      "Entity type (sole proprietor, partnership, corporation, LLC) and date formed",
      "Date employment began in Kentucky and date first payroll was paid",
      "Total wages paid in the quarter and number of employees",
      "Names, Social Security numbers and addresses of owners, partners or corporate officers",
      "Description of business activity or NAICS code",
      "Whether the business acquired another company or changed its organization",
      "For nonprofits, evidence of 501(c)(3) status"
    ],
    "filing_methods": [
      "Online via the Kentucky Unemployment Insurance Self Service portal to file the Employer Application and obtain a KEIN",
      "Mail employer application documents to the Kentucky Office of Unemployment Insurance",
      "Online via the Kentucky Business One Stop Portal to complete the Kentucky Tax Registration Application (Form 10A100) for withholding",
      "Mail Form 10A100 to the Kentucky Department of Revenue"
    ],
    "confirmation_proof": "A Kentucky Employer Identification Number (KEIN) and contribution rate notice from the Office of Unemployment Insurance; a Kentucky withholding tax account number issued by the Department of Revenue.",
    "contacts": {
      "phone": "502-564-2272 (UI); 502-564-3306 (withholding)",
      "email": "UITax@ky.gov (UI)"
    },
    "last_verified_date": "2026-02-05",
    "source_notes": "Kentucky Unemployment Insurance Employer Guide for liability thresholds; Kentucky Career Center and Business One Stop portal for registration; GoCo payroll tax article for required information and processing times; Kentucky UI Tax enforcement contact page and Department of Revenue contact page for contact information.",
    "rules": {
      "status": "complete",
      "ui_liability": {
        "general": {
          "wage_threshold": {
            "amount": 1500.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "weeks": 20,
            "unit": "weeks_in_year",
            "min_employees": 1
          }
        },
        "domestic": {
          "wage_threshold": {
            "amount": 1000.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "weeks": null,
            "unit": null,
            "min_employees": null
          }
        },
        "agricultural": {
          "wage_threshold": {
            "amount": 20000.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "weeks": 20,
            "unit": "weeks_in_year",
            "min_employees": 10
          }
        },
        "nonprofit": {
          "wage_threshold": {
            "amount": null,
            "period": null
          },
          "weeks_threshold": {
            "weeks": 20,
            "unit": "weeks_in_year",
            "min_employees": 4
          }
        },
        "notes": []
      },
      "withholding": {
        "required_from_first_payroll": true,
        "notes": []
      },
      "todo": []
    }
  },
  {
    "state_code": "LA",
    "state_name": "Louisiana",
    "agency_name": "Louisiana Workforce Commission (unemployment) and Louisiana Department of Revenue",
    "registration_portal_url": "https://laors9.laworks.net/LaStarsRegistration (UI account application); https://revenue.louisiana.gov (LDR Online Business Registration)",
    "ui_wage_threshold_text": "Employers generally become liable when they pay $1,500 or more in wages in any quarter or employ at least one worker for part of a day in 20 or more separate weeks in a year; domestic employers become liable when they pay $1,000 or more in cash wages in a quarter; agricultural employers are liable when they have 10 or more workers for 20 weeks or pay $20,000 or more in cash wages in a quarter; nonprofit organizations (501(c)(3)) become liable when they employ four or more individuals for 20 weeks",
    "ui_threshold_weeks_text": "20 separate weeks with at least one worker (general); 20 weeks with 10 or more workers for agricultural employers; 20 weeks with four or more workers for nonprofit employers",
    "withholding_registration_required": true,
    "withholding_threshold_description": "Employers paying wages to workers in Louisiana must register with the Louisiana Department of Revenue to obtain a Revenue Account Number and withhold state income tax from those wages; registration is completed through the online Business Registration portal or by submitting Form R-16019 before paying wages",
    "typical_processing_time": "Unemployment account numbers are generally issued three to five business days after an online application; withholding registrations completed online issue a Revenue Account Number within days after submission",
    "required_information": [
      "Employer's name",
      "Louisiana physical address (or job site/employee address)",
      "Mailing addresses and phone numbers",
      "Payroll contact person name and telephone number",
      "Organization type (e.g., corporation, sole proprietorship, LLC)",
      "Date and state where the business entity was formed",
      "Employer type (Regular, Agricultural, Non‑Profit or Government)",
      "Number of employees working in Louisiana",
      "Federal Identification Number (FEIN)",
      "Louisiana withholding number (if already obtained)",
      "Information on Professional Employer Organization (PEO), acquisitions or changes in FEIN",
      "Date the company first had employees in Louisiana and quarter the qualification was met",
      "Officer/owner information (names, titles, Social Security numbers, addresses)",
      "Type of business activities and contact person for additional information",
      "List of employees and Social Security numbers if part of an acquisition",
      "Copy of 501(c)(3) exemption for nonprofit entities"
    ],
    "filing_methods": [
      "Online via the Louisiana Workforce Commission Employer Application portal (laors9.laworks.net) for unemployment insurance",
      "Online via the Louisiana Department of Revenue Business Registration portal (LDR Online Business Registration or LaTAP) for withholding tax",
      "Paper Form R‑16019 mailed to the Louisiana Department of Revenue for withholding registration"
    ],
    "confirmation_proof": "Louisiana Workforce Commission issues an Employer Account Number and contribution rate after application; the Department of Revenue sends a Revenue Account Number for withholding registration",
    "contacts": {
      "phone": "1‑833‑708‑2866 (UI tax) or 1‑866‑783‑5567 for employer registration; withholding tax questions: 855‑307‑3893",
      "email": "UITax@la.gov"
    },
    "last_verified_date": "2026-02-05",
    "source_notes": "Louisiana Unemployment Insurance Tax Guide for Employers (2025) details liability thresholds, domestic, agricultural, and nonprofit thresholds and registration requirements; LWC Employer Application portal lists required information for the unemployment account application; Louisiana Department of Revenue FAQ explains that employers must apply for a Revenue Account Number via the online registration application or Form R‑16019 before withholding tax.",
    "rules": {
      "status": "complete",
      "ui_liability": {
        "general": {
          "wage_threshold": {
            "amount": 1500.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "weeks": 20,
            "unit": "weeks_in_year",
            "min_employees": 1
          }
        },
        "domestic": {
          "wage_threshold": {
            "amount": 1000.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "weeks": null,
            "unit": null,
            "min_employees": null
          }
        },
        "agricultural": {
          "wage_threshold": {
            "amount": 20000.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "weeks": 20,
            "unit": "weeks_in_year",
            "min_employees": 10
          }
        },
        "nonprofit": {
          "wage_threshold": {
            "amount": null,
            "period": null
          },
          "weeks_threshold": {
            "weeks": 20,
            "unit": "weeks_in_year",
            "min_employees": 4
          }
        },
        "notes": []
      },
      "withholding": {
        "required_from_first_payroll": true,
        "notes": []
      },
      "todo": []
    }
  },
  {
    "state_code": "ME",
    "state_name": "Maine",
    "agency_name": "Maine Department of Labor, Bureau of Unemployment Compensation and Maine Revenue Services",
    "registration_portal_url": "https://assist.reemployme.maine.gov/ep/landing (ReEmployME employer portal); https://revenue.maine.gov (Maine Tax Portal for withholding)",
    "ui_wage_threshold_text": "Employers generally become liable when they pay $1,500 or more in gross wages in a calendar quarter or employ at least one individual for part of a day in 20 weeks in a year; agricultural employers become liable when they pay $20,000 or more in wages during a quarter or employ at least 10 workers in agricultural labor for 20 weeks; nonprofit organizations (501(c)(3)) become liable when they employ four or more individuals for 20 weeks; domestic employers are liable once they pay $1,000 or more in wages in a quarter",
    "ui_threshold_weeks_text": "20 weeks with at least one employee (general); 20 weeks with 10 or more agricultural workers; 20 weeks with four or more employees for nonprofit employers",
    "withholding_registration_required": true,
    "withholding_threshold_description": "Employers who pay wages to employees working in Maine must register with Maine Revenue Services for a withholding tax account before remitting state income tax; registration is completed through the Maine Tax Portal by selecting “Register a New Business,” and there is no minimum payroll threshold.",
    "typical_processing_time": "Unemployment Employer Account Numbers and contribution rates are typically issued within 5–7 business days when registering through the ReEmployME portal; Maine Revenue Services mails the withholding account number approximately 20 days after online registration",
    "required_information": [
      "Federal Employer Identification Number (FEIN)",
      "Legal business name and trade name",
      "Business physical and mailing addresses and phone numbers",
      "Primary contact person’s name and phone number",
      "Type of organization (corporation, partnership, sole proprietor, LLC)",
      "Date payroll operations began and date business entity was formed",
      "Number of employees and first payroll date in Maine",
      "Names, addresses, and Social Security numbers of owners or corporate officers",
      "Description of business activities and NAICS code",
      "Information on any predecessor or acquired business",
      "Whether the business uses a professional employer organization (PEO) or third‑party administrator"
    ],
    "filing_methods": [
      "Online via the ReEmployME Employer Portal for unemployment tax registration and quarterly wage reporting",
      "Online via the Maine Tax Portal to register for an income tax withholding account and file quarterly returns",
      "Paper withholding forms (such as Form 941ME) may be mailed if electronic filing is unavailable"
    ],
    "confirmation_proof": "The Maine Department of Labor sends an Employer Account Number (EAN) and contribution rate for unemployment insurance; Maine Revenue Services sends a Withholding Account Number letter after registration",
    "contacts": {
      "phone": "Unemployment tax: 1‑844‑754‑3508 or (207) 621‑5120; Withholding tax: (207) 624‑9784 or (207) 626‑8475",
      "email": "division.uctax@maine.gov"
    },
    "last_verified_date": "2026-02-05",
    "source_notes": "Maine Employer’s Guide to the Employment Security Law (2021) provides the $1,500/20‑week general threshold and lists agricultural, domestic, and nonprofit liability conditions; the guide also gives contact information for employer services; the ReEmployME portal page indicates that employers register a new business; the Justworks article describes registering through the Maine Tax Portal and states that unemployment account numbers are issued within 5–7 business days and withholding account numbers are mailed about 20 days after registration.",
    "rules": {
      "status": "complete",
      "ui_liability": {
        "general": {
          "wage_threshold": {
            "amount": 1500.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "weeks": 20,
            "unit": "weeks_in_year",
            "min_employees": 1
          }
        },
        "domestic": {
          "wage_threshold": {
            "amount": 1000.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "weeks": null,
            "unit": null,
            "min_employees": null
          }
        },
        "agricultural": {
          "wage_threshold": {
            "amount": 20000.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "weeks": 20,
            "unit": "weeks_in_year",
            "min_employees": 10
          }
        },
        "nonprofit": {
          "wage_threshold": {
            "amount": null,
            "period": null
          },
          "weeks_threshold": {
            "weeks": 20,
            "unit": "weeks_in_year",
            "min_employees": 4
          }
        },
        "notes": []
      },
      "withholding": {
        "required_from_first_payroll": true,
        "notes": []
      },
      "todo": []
    }
  },
  {
    "state_code": "MD",
    "state_name": "Maryland",
    "agency_name": "Maryland Department of Labor – Division of Unemployment Insurance and Comptroller of Maryland",
    "registration_portal_url": "https://employer.beacon.labor.md.gov (BEACON unemployment insurance portal); https://interactive.marylandtaxes.gov/Business/Registration (Combined Registration Application); https://taxconnect.marylandtaxes.gov (Maryland Tax Connect)",
    "ui_wage_threshold_text": "General employers are subject to Maryland’s unemployment insurance law as soon as they employ at least one worker in the state; there is no minimum wage threshold. Agricultural labor is exempt from coverage unless cash wages reach $20,000 in a quarter or 10 or more individuals are employed during the current or preceding quarter, and domestic service is exempt unless the employer pays at least $1,000 in cash wages during a quarter",
    "ui_threshold_weeks_text": "No weeks test applies for general employers because liability begins with the first employee. Agricultural employers become liable when they employ 10 or more workers on any day in 20 weeks in a calendar year. Domestic employers do not have a weeks test; their liability is triggered only by wages. Non‑profit employers are treated like general employers and are liable when they have at least one employee.",
    "withholding_registration_required": true,
    "withholding_threshold_description": "Employers must register for a Maryland withholding tax account before paying wages and withhold state income tax whenever wages are subject to federal income tax. Registration is completed through the Maryland Tax Connect portal or the Combined Registration application.",
    "typical_processing_time": "The Maryland unemployment insurance employer account number (SUTA number) is generally issued within four to six weeks after registration, while state withholding tax account registration through Maryland Tax Connect or the Combined Registration application typically takes about two weeks to process.",
    "required_information": [
      "Federal Employer Identification Number (FEIN)",
      "Legal business name and any trade names",
      "Physical work site and mailing addresses in Maryland, business phone number and email",
      "Business entity type (sole proprietor, corporation, partnership, LLC) and state/date of formation",
      "Date wages were first paid in Maryland and date employment began",
      "Names, titles, and Social Security numbers of all owners, partners or corporate officers",
      "Description of the principal business activity and North American Industry Classification System (NAICS) code",
      "Maryland withholding or sales tax number (if already assigned)",
      "Quarter and year the business met liability for unemployment insurance (if applicable)",
      "For non‑profit entities, a copy of the IRS 501(c)(3) determination letter",
      "Information about any predecessor or acquired businesses and lists of employees if part of an acquisition"
    ],
    "filing_methods": [
      "Online via the BEACON employer portal to register for a Maryland unemployment insurance account",
      "Online through the Combined Registration application to apply for withholding and unemployment insurance accounts simultaneously",
      "Online via Maryland Tax Connect to register solely for a state withholding tax account",
      "Submit paper Combined Registration forms (e.g., Combined Registration Application) by mail if not filing online"
    ],
    "confirmation_proof": "Employers receive a Maryland unemployment insurance employer account number and rate notice from the Division of Unemployment Insurance and a Maryland withholding tax account number from the Comptroller’s office after registration is processed.",
    "contacts": {
      "phone": "410-949-0033 (Employer Call Center for UI registration questions); 410-767-2414 (Division of Unemployment Insurance general line); 410-260-7980 or 1-800-638-2937 (Comptroller of Maryland withholding tax help)",
      "email": "taxhelp@comp.state.md.us (withholding tax questions)"
    },
    "last_verified_date": "2026-02-05",
    "source_notes": "The unemployment insurance liability thresholds and exemptions come from the Maryland Department of Labor’s Quarterly Census of Employment and Wages scope of coverage section, which states that employers are subject to Maryland’s UI law as soon as they employ at least one worker and lists agricultural and domestic exemptions. The required information for BEACON and the Combined Registration application is compiled from the Division of Unemployment Insurance instructions page, which directs employers to provide business and owner details, dates of formation and first wages, NAICS codes, predecessor information and 501(c)(3) status. Processing times are drawn from the Patriot Software SUTA guide (four–six weeks for the SUTA number) and the GoCo article noting that Combined Registration and Tax Connect submissions take about two weeks.",
    "rules": {
      "status": "complete",
      "todo": [],
      "ui_liability": {
        "general": {
          "wage_threshold": {
            "amount": null,
            "period": null
          },
          "weeks_threshold": {
            "min_employees": 1,
            "unit": null,
            "weeks": null
          }
        },
        "agricultural": {
          "wage_threshold": {
            "amount": 20000.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "min_employees": 10,
            "unit": "weeks_in_year",
            "weeks": 20
          }
        },
        "domestic": {
          "wage_threshold": {
            "amount": 1000.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "min_employees": null,
            "unit": null,
            "weeks": null
          }
        },
        "nonprofit": {
          "wage_threshold": {
            "amount": null,
            "period": null
          },
          "weeks_threshold": {
            "min_employees": 1,
            "unit": null,
            "weeks": null
          }
        },
        "notes": []
      },
      "withholding": {
        "required_from_first_payroll": true,
        "notes": []
      }
    }
  },
  {
    "state_code": "MA",
    "state_name": "Massachusetts",
    "agency_name": "Massachusetts Department of Unemployment Assistance and Massachusetts Department of Revenue",
    "registration_portal_url": "https://unemployment.mass.gov (Unemployment Services for Employers portal); https://mtc.dor.state.ma.us (MassTaxConnect)",
    "ui_wage_threshold_text": "For-profit employers must pay unemployment insurance contributions if they have employees working at least one day in any 13 weeks during a calendar year or pay wages of $1,500 or more in any calendar quarter【436281299933108†L176-L179】. Agricultural employers become liable when they pay $40,000 or more in cash wages in a quarter or employ 10 or more individuals on any day in 20 weeks of a calendar year【436281299933108†L180-L182】. Employers of domestic workers become liable once $1,000 or more is paid in cash wages in a calendar quarter【365994320666717†L260-L280】.",
    "ui_threshold_weeks_text": "General employers become liable if they employ at least one worker for one or more days in 13 weeks in a calendar year【436281299933108†L176-L179】. Agricultural employers become liable when they employ 10 or more workers on any day in 20 weeks in a calendar year【436281299933108†L180-L182】. Domestic employers do not have a weeks test; liability is triggered once wages paid reach $1,000【365994320666717†L260-L280】. Non‑profit employers are treated like general employers and are liable with one or more employees.",
    "withholding_registration_required": true,
    "withholding_threshold_description": "Massachusetts employers must register for a state withholding account and withhold state income tax from employees whenever wages are subject to federal tax. Registration should occur before the first payroll and is completed through the MassTaxConnect portal.",
    "typical_processing_time": "Massachusetts issues both the employer unemployment account number and the state withholding account number immediately upon completion of the online registration through the Unemployment Services for Employers portal and MassTaxConnect【963352479712058†L109-L119】.",
    "required_information": [
      "Legal business name and Federal Employer Identification Number (FEIN)",
      "Legal entity type and state and date of incorporation",
      "Social Security numbers of any owners, corporate officers, partners or members【77455732051001†L145-L154】",
      "Principal business activity performed in Massachusetts and any acquired business information【77455732051001†L145-L154】",
      "Business start date and start date of payroll in Massachusetts",
      "Business physical and mailing addresses",
      "Contact information for owners/officers including titles and Social Security numbers【903911017323593†L151-L166】",
      "IRS 501(c)(3) determination letter for nonprofit organizations【903911017323593†L167-L168】"
    ],
    "filing_methods": [
      "Register online through the Unemployment Services for Employers portal to obtain a Massachusetts Employer Account Number",
      "Register online through MassTaxConnect to obtain a Massachusetts withholding account number",
      "File quarterly wage and employment reports and pay unemployment contributions through the Unemployment Services for Employers portal",
      "File withholding returns and payments through MassTaxConnect; paper forms are available but online filing is standard"
    ],
    "confirmation_proof": "Upon completion of registration, the Massachusetts Department of Unemployment Assistance issues an Employer Account Number and contribution rate, and the Department of Revenue issues a Withholding Account Number and deposit frequency notice immediately【963352479712058†L109-L119】.",
    "contacts": {
      "phone": "617-626-5075 (Employer customer service for UI) and 877-626-6800 (DUA call center)【719500648356331†L171-L183】; 617-887-6367 (Department of Revenue contact center)【903911017323593†L432-L439】",
      "email": null
    },
    "last_verified_date": "2026-02-05",
    "source_notes": "UI liability thresholds and domestic/agricultural categories are taken from the Massachusetts Executive Office of Labor and Workforce Development’s DUA overview and Employer’s Guide, which specify that employers with one or more employees working in 13 weeks or who pay $1,500 in wages in a quarter are liable and that agricultural employers are liable at $40,000 in wages or 10 employees for 20 weeks【436281299933108†L176-L182】【365994320666717†L260-L280】. Required information and registration instructions come from the DUA “Register my Business” page and MassTaxConnect registration guide【77455732051001†L145-L154】【903911017323593†L151-L166】. Processing time and account issuance are confirmed by the Square Support article stating that both the unemployment employer account number and withholding account number are issued immediately upon online registration【963352479712058†L109-L119】.",
    "rules": {
      "status": "complete",
      "todo": [],
      "ui_liability": {
        "general": {
          "wage_threshold": {
            "amount": 1500.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "min_employees": 1,
            "unit": "weeks_in_year",
            "weeks": 13
          }
        },
        "agricultural": {
          "wage_threshold": {
            "amount": 40000.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "min_employees": 10,
            "unit": "weeks_in_year",
            "weeks": 20
          }
        },
        "domestic": {
          "wage_threshold": {
            "amount": 1000.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "min_employees": null,
            "unit": null,
            "weeks": null
          }
        },
        "nonprofit": {
          "wage_threshold": {
            "amount": null,
            "period": null
          },
          "weeks_threshold": {
            "min_employees": 1,
            "unit": null,
            "weeks": null
          }
        },
        "notes": []
      },
      "withholding": {
        "required_from_first_payroll": true,
        "notes": []
      }
    }
  },
  {
    "state_code": "MI",
    "state_name": "Michigan",
    "agency_name": "Michigan Unemployment Insurance Agency (UIA)",
    "registration_portal_url": "https://miwam.unemployment.state.mi.us/",
    "ui_wage_threshold_text": "$1,000 or more in payroll within a calendar year or at least one worker employed in 20 different weeks during a calendar year; agricultural employers become liable when cash payroll reaches $20,000 in a quarter or when 10 agricultural workers are employed in 20 weeks; domestic employers become liable when they pay $1,000 in a calendar quarter",
    "ui_threshold_weeks_text": "20 different weeks with at least one employee (general employment); 20 weeks with 10 or more workers (agricultural)",
    "withholding_registration_required": true,
    "withholding_threshold_description": "Every employer maintaining an office or transacting business in Michigan and making payment of compensation to an employee (resident or nonresident) must register for and withhold Michigan income tax from the first payroll; agricultural and domestic services are generally exempt",
    "typical_processing_time": "e‑Registration through Michigan’s online system usually completes within a few days and assigns an Employer Account Number; paper applications can take up to six weeks to process",
    "required_information": [
      "Federal Employer Identification Number (FEIN)",
      "Date of birth, Social Security number and address of each owner, corporate officer, partner or member",
      "Individual Taxpayer Identification Number (ITIN) for entities owned by foreign individuals, if applicable",
      "Date of first employment (hiring date) and date on which wage or week liability threshold was met",
      "Whether the business has changed entity type or acquired another business (requiring the EAN and FEIN of the business being acquired, acquisition date and percentage of assets/organization acquired)",
      "Business entity type (sole proprietor, partnership, corporation, LLC, association, government, etc.)",
      "Legal entity name and trade name (DBA)",
      "Date and state of formation",
      "Preferred communication method and contact email"
    ],
    "filing_methods": [
      "Online e‑Registration via Michigan Business One Stop/MiWAM (preferred)",
      "Paper Form 518 and UIA schedules (Schedule A, Schedule B, etc.) submitted by mail"
    ],
    "confirmation_proof": "UIA Employer Account Number (EAN) issued along with Form 1183 (Notice of Determination of Employer Status) and Form UIA 1771 (Tax Rate Determination)",
    "contacts": {
      "phone": "313-456-2188",
      "email": "EWAMSupport@michigan.gov"
    },
    "last_verified_date": "2025-11-01",
    "source_notes": "Michigan liability thresholds and registration requirements",
    "rules": {
      "status": "complete",
      "ui_liability": {
        "general": {
          "wage_threshold": {
            "amount": 1000.0,
            "period": "year"
          },
          "weeks_threshold": {
            "weeks": 20,
            "unit": "weeks_in_year",
            "min_employees": 1
          }
        },
        "domestic": {
          "wage_threshold": {
            "amount": 1000.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "weeks": null,
            "unit": null,
            "min_employees": null
          }
        },
        "agricultural": {
          "wage_threshold": {
            "amount": 20000.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "weeks": 20,
            "unit": "weeks_in_year",
            "min_employees": 10
          }
        },
        "nonprofit": {
          "wage_threshold": {
            "amount": null,
            "period": null
          },
          "weeks_threshold": {
            "weeks": null,
            "unit": null,
            "min_employees": null
          }
        },
        "notes": []
      },
      "withholding": {
        "required_from_first_payroll": true,
        "notes": [
          "Agricultural and domestic services generally exempt"
        ]
      },
      "todo": []
    }
  },
  {
    "state_code": "MN",
    "state_name": "Minnesota",
    "agency_name": "Minnesota Unemployment Insurance Program (Department of Employment and Economic Development) & Minnesota Department of Revenue",
    "registration_portal_url": "https://www.uimn.org",
    "ui_wage_threshold_text": "Minnesota does not have a specific wage threshold for unemployment insurance. Any individual or organization that pays covered wages in Minnesota must register for an employer account. Registration should be done as soon as possible after the first wages are paid for covered employment and prior to the due date of the first quarterly wage detail report. Agricultural employers become liable if they pay $20,000 in cash wages in a calendar quarter or employ 10 or more workers in 20 weeks. Non‑profit employers become liable when they employ four or more workers in 20 weeks.",
    "ui_threshold_weeks_text": "No minimum number of weeks for general employers; employers register once covered wages are paid. Agricultural employers become liable when they employ 10 or more workers for 20 weeks; non‑profit employers become liable when they have four workers for 20 weeks.",
    "withholding_registration_required": true,
    "withholding_threshold_description": "Employers with employees working in Minnesota must register for a Minnesota Tax ID and withholding account through the Department of Revenue and withhold state income tax from the first payroll, regardless of wages paid.",
    "typical_processing_time": "Employers who register online receive their unemployment insurance employer account number and Minnesota Tax ID immediately or within one business day; phone or paper registration may take longer.",
    "required_information": [
      "Type of legal entity (corporation, sole proprietorship, LLC, etc.)",
      "Legal name of the entity as registered with the Secretary of State",
      "Doing business as name (if different from legal name)",
      "Physical business address and mailing address",
      "Federal Employer Identification Number (FEIN)",
      "Minnesota Department of Revenue Tax ID (if already assigned)",
      "Primary business activity performed in Minnesota",
      "State and date of incorporation (if corporation)",
      "Names, Social Security numbers, home addresses and percentage of ownership for all owners/officers",
      "Whether the business is new or acquired from another entity",
      "Dates covered employees first performed services in Minnesota",
      "Date first wages were paid to covered employees",
      "Number of covered employees in Minnesota",
      "Agent ID (if using a third‑party agent)"
    ],
    "filing_methods": [
      "Register online through the Employer Self‑Service System at uimn.org to obtain a Minnesota unemployment insurance employer account number.",
      "Alternatively, call 651‑296‑6141 (option 2) to register by phone if internet access is not available.",
      "Register for a Minnesota Tax ID and withholding account through the Minnesota Department of Revenue’s e‑Services (Business Tax Registration) and file/pay withholding taxes through e‑Services.",
      "After registration, file quarterly wage detail reports and pay unemployment contributions through the Employer Self‑Service portal."
    ],
    "confirmation_proof": "A confirmation number and employer account number are issued after registration. Employers receive a Minnesota unemployment insurance employer account number and a Minnesota Tax ID (withholding account number).",
    "contacts": {
      "phone": "651‑296‑6141 (UI) or 651‑282‑9999 (Department of Revenue)",
      "email": null
    },
    "last_verified_date": "2026-02-05",
    "source_notes": "Minnesota UI registration page states that employers must register as soon as possible after paying first wages and lists the information required for registration【226747635388511†L589-L595】【226747635388511†L630-L650】. Patriot Software’s SUTA guide notes that Minnesota has no specific wage threshold and employers must register within 30 days of hiring employees and that the SUTA tax number is issued instantly【225312409300865†L554-L562】.",
    "rules": {
      "status": "complete",
      "ui_liability": {
        "general": {
          "wage_threshold": {
            "amount": null,
            "period": null
          },
          "weeks_threshold": {
            "weeks": null,
            "unit": null,
            "min_employees": 1
          }
        },
        "domestic": {
          "wage_threshold": {
            "amount": null,
            "period": null
          },
          "weeks_threshold": {
            "weeks": null,
            "unit": null,
            "min_employees": null
          }
        },
        "agricultural": {
          "wage_threshold": {
            "amount": 20000.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "weeks": 20,
            "unit": "weeks_in_year",
            "min_employees": 10
          }
        },
        "nonprofit": {
          "wage_threshold": {
            "amount": null,
            "period": null
          },
          "weeks_threshold": {
            "weeks": 20,
            "unit": "weeks_in_year",
            "min_employees": 4
          }
        },
        "notes": [
          "Registration must occur as soon as wages are paid; there is no minimum wage threshold for general employers."
        ]
      },
      "withholding": {
        "required_from_first_payroll": true,
        "notes": [
          "The Minnesota Department of Revenue requires employers to register for a withholding tax account and withhold state income tax from the first payroll."
        ]
      },
      "todo": []
    }
  },
  {
    "state_code": "MS",
    "state_name": "Mississippi",
    "agency_name": "Mississippi Department of Employment Security (MDES) & Mississippi Department of Revenue",
    "registration_portal_url": "https://accessmstax.mdes.ms.gov (UI) and https://tap.dor.ms.gov (withholding)",
    "ui_wage_threshold_text": "Employers are liable for Mississippi unemployment insurance tax when they pay $1,500 or more in wages in a calendar quarter or when at least one worker performs services on some part of a day in each of 20 different calendar weeks. Agricultural employers become liable when they pay $20,000 in wages in a quarter or employ 10 or more workers for 20 weeks. Domestic (household) employers become liable when they pay $1,000 or more in cash wages in a quarter.",
    "ui_threshold_weeks_text": "20 different calendar weeks with at least one worker for general employers; 20 weeks with 10 or more workers for agricultural employers.",
    "withholding_registration_required": true,
    "withholding_threshold_description": "Employers must register with the Mississippi Department of Revenue via the Taxpayer Access Point (TAP) and withhold Mississippi income tax from employees beginning with the first payroll. Registration is required regardless of the amount of wages paid.",
    "typical_processing_time": "Online registration generally provides the Mississippi Employer Account Number within 24–48 hours; registering by mail takes about two weeks. Withholding registration via TAP issues an account number once the application is processed (often within a few business days).",
    "required_information": [
      "Federal Employer Identification Number (FEIN)",
      "Legal business name and trade name (if applicable)",
      "Physical business and mailing addresses and phone number",
      "Entity type (corporation, LLC, sole proprietor, etc.) and date formed",
      "Date first wages were paid and total wages paid during the quarter",
      "Number of employees in Mississippi",
      "Names, Social Security numbers and addresses of all owners/officers",
      "Employer type (e.g., agricultural, domestic, nonprofit)",
      "Contact person’s name, phone and email"
    ],
    "filing_methods": [
      "Register online through the MDES Employer Services portal (accessmstax.mdes.ms.gov) to obtain an unemployment insurance Employer Account Number and pay quarterly contributions.",
      "Alternatively, register by mailing Form UI‑1 to the MDES to establish an employer account.",
      "Register for a withholding account through the Mississippi Department of Revenue’s Taxpayer Access Point (TAP) and file/pay withholding tax through TAP.",
      "Unemployment and withholding taxes can be paid online or by mail (using the appropriate MDES or DOR forms)."
    ],
    "confirmation_proof": "MDES issues an Employer Account Number and contribution rate letter after registration; the Department of Revenue issues an eight‑digit Mississippi Withholding Account Number and deposit schedule.",
    "contacts": {
      "phone": "601‑321‑6000 (MDES) or 601‑923‑7088 (DOR)",
      "email": null
    },
    "last_verified_date": "2026-02-05",
    "source_notes": "Patriot Software’s SUTA guide states that Mississippi employers become liable when they pay $1,500 in wages in a quarter or have one worker for 20 weeks and that agricultural employers are liable at $20,000 in wages or 10 workers for 20 weeks; online registration provides a tax number within 24–48 hours【225312409300865†L567-L583】. Square’s Mississippi employer tax information page notes that employers must register with MDES for an Employer Account Number and with the Department of Revenue via the TAP portal to obtain a withholding account number; it lists contact numbers 601‑923‑7088 for withholding and 888‑844‑3577 for unemployment taxes【25058230363081†L48-L56】【25058230363081†L100-L124】.",
    "rules": {
      "status": "complete",
      "ui_liability": {
        "general": {
          "wage_threshold": {
            "amount": 1500.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "weeks": 20,
            "unit": "weeks_in_year",
            "min_employees": 1
          }
        },
        "domestic": {
          "wage_threshold": {
            "amount": 1000.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "weeks": null,
            "unit": null,
            "min_employees": null
          }
        },
        "agricultural": {
          "wage_threshold": {
            "amount": 20000.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "weeks": 20,
            "unit": "weeks_in_year",
            "min_employees": 10
          }
        },
        "nonprofit": {
          "wage_threshold": {
            "amount": null,
            "period": null
          },
          "weeks_threshold": {
            "weeks": null,
            "unit": null,
            "min_employees": null
          }
        },
        "notes": []
      },
      "withholding": {
        "required_from_first_payroll": true,
        "notes": [
          "The Mississippi Department of Revenue requires employers to register and withhold state income tax from employees beginning with the first payroll."
        ]
      },
      "todo": []
    }
  },
  {
    "state_code": "MO",
    "state_name": "Missouri",
    "agency_name": "Missouri Department of Labor and Industrial Relations – Division of Employment Security & Missouri Department of Revenue",
    "registration_portal_url": "https://mytax.mo.gov (Missouri Online Business Registration) and https://uinteract.labor.mo.gov (UI)",
    "ui_wage_threshold_text": "A general business becomes liable for Missouri unemployment insurance tax when it pays $1,500 in wages in a calendar quarter or employs a worker for some portion of a day in each of 20 different weeks in a calendar year. Liability may also arise if the employer is subject to FUTA and employs a worker in Missouri or if it acquires a business that was already liable for SUTA. Agricultural employers become liable when they pay $20,000 in cash wages in a calendar quarter or employ 10 or more workers for 20 weeks. Domestic employers become liable when they pay $1,000 in cash wages in a quarter.",
    "ui_threshold_weeks_text": "20 different weeks with at least one worker for general employers; 20 weeks with 10 or more workers for agricultural employers; 20 weeks with four or more workers for nonprofit employers.",
    "withholding_registration_required": true,
    "withholding_threshold_description": "Employers paying wages to employees working in Missouri must register with the Missouri Department of Revenue for a withholding tax account and withhold Missouri income tax from employees beginning with the first payroll.",
    "typical_processing_time": "The Missouri Department of Revenue’s online business registration system issues a confirmation number immediately and processes registrations within 2–3 business days. According to Patriot Software, the Missouri Division of Employment Security may take up to one month to assign a Missouri Employer Account Number and contribution rate.",
    "required_information": [
      "Federal Employer Identification Number (FEIN)",
      "Legal business name and any trade name (DBA)",
      "Physical and mailing addresses and phone number",
      "Entity type (corporation, LLC, partnership, sole proprietorship, etc.) and date formed",
      "Date of first Missouri payroll and total wages paid in the quarter",
      "Number of employees and type of employment (e.g., agricultural, domestic)",
      "Names, Social Security numbers, addresses and titles of all owners, partners, or corporate officers",
      "Whether the business is new or a successor to an existing Missouri employer",
      "Description of business activity and NAICS code"
    ],
    "filing_methods": [
      "Register online through the combined Missouri business registration portal at mytax.mo.gov to apply for withholding tax and unemployment insurance tax accounts.",
      "To register an existing account for unemployment insurance, visit the UInteract portal (uinteract.labor.mo.gov) and complete the unemployment tax registration form.",
      "After registration, file and pay unemployment contributions via UInteract and file/pay withholding tax via the MyTax Missouri portal."
    ],
    "confirmation_proof": "After registering online, the Missouri Department of Revenue provides a confirmation number and later issues tax registration numbers; the Division of Employment Security mails an employer account number and contribution rate letter.",
    "contacts": {
      "phone": "573‑751‑3215 (UI) or 573‑751‑8750 (Department of Revenue)",
      "email": null
    },
    "last_verified_date": "2026-02-05",
    "source_notes": "Patriot Software’s SUTA guide explains that Missouri employers become liable when they pay $1,500 in wages in a quarter or employ a worker for part of a day in 20 weeks and notes that employers must notify the state within 30 days of becoming liable and may wait up to one month for their unemployment tax number【225312409300865†L589-L607】. The Missouri Department of Revenue’s online registration page indicates that the combined registration allows employers to apply for withholding and unemployment tax accounts and that a confirmation number is issued immediately with processing taking 2–3 business days【846784382646350†L190-L221】. The Square Payroll article notes that employers must register with both the Department of Revenue and the Division of Employment Security to pay and file taxes and lists contact information【700534703553141†L48-L69】【700534703553141†L125-L153】.",
    "rules": {
      "status": "complete",
      "ui_liability": {
        "general": {
          "wage_threshold": {
            "amount": 1500.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "weeks": 20,
            "unit": "weeks_in_year",
            "min_employees": 1
          }
        },
        "domestic": {
          "wage_threshold": {
            "amount": 1000.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "weeks": null,
            "unit": null,
            "min_employees": null
          }
        },
        "agricultural": {
          "wage_threshold": {
            "amount": 20000.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "weeks": 20,
            "unit": "weeks_in_year",
            "min_employees": 10
          }
        },
        "nonprofit": {
          "wage_threshold": {
            "amount": null,
            "period": null
          },
          "weeks_threshold": {
            "weeks": 20,
            "unit": "weeks_in_year",
            "min_employees": 4
          }
        },
        "notes": []
      },
      "withholding": {
        "required_from_first_payroll": true,
        "notes": [
          "The Missouri Department of Revenue requires employers to register for a withholding account and withhold Missouri income tax from the first payroll."
        ]
      },
      "todo": []
    }
  },
  {
    "state_code": "MT",
    "state_name": "Montana",
    "agency_name": "Montana Department of Labor & Industry – Unemployment Insurance Division; Montana Department of Revenue",
    "registration_portal_url": [
      "https://uieservices.mt.gov/",
      "https://tap.dor.mt.gov/"
    ],
    "ui_wage_threshold_text": "General employers become liable for unemployment insurance when total annual payroll reaches $1,000 or more. Agricultural employers are liable when they pay $20,000 or more in cash wages in any calendar quarter. Domestic employers are liable when they pay $1,000 or more in cash wages in a calendar quarter【411342499543947†L423-L444】.",
    "ui_threshold_weeks_text": "Agricultural employers are also liable if they employ 10 or more agricultural workers for some portion of 20 different weeks during a calendar year【411342499543947†L423-L444】. (No specific week‑count threshold for general or domestic employers beyond the wage amounts.)",
    "withholding_registration_required": true,
    "withholding_threshold_description": "Employers who pay wages to employees performing services in Montana or issue Montana W‑2/1099 forms must register for a state income tax withholding account with the Department of Revenue before paying wages【867228617377441†L169-L179】.",
    "typical_processing_time": "Employers receive an unemployment insurance account number shortly after completing the online UI eServices registration (typically within a few business days). The Department of Revenue assigns a withholding account number after processing the TransAction Portal or paper Business Registration Form.",
    "required_information": [
      "Federal Employer Identification Number (FEIN)",
      "Legal business name and trade name/DBA",
      "Montana physical and mailing addresses",
      "Contact name, phone number and email",
      "Type of ownership and state/date formed (corporation, LLC, partnership, sole proprietorship, etc.)",
      "Type of employment (regular, agricultural, domestic)",
      "Date employees first started working in Montana and date first wages were paid",
      "Total wages paid and estimated number of employees",
      "NAICS code and description of business activity",
      "Names, titles, Social Security numbers and addresses of owners, partners or corporate officers",
      "Information on business acquisitions or mergers and IRS 501(c)(3) exemption letter if applicable"
    ],
    "filing_methods": [
      "Register for unemployment insurance online through the UI eServices portal (uieservices.mt.gov)",
      "Register for state income tax withholding online via the TransAction Portal (tap.dor.mt.gov)",
      "Alternatively, mail the Business Registration Form (GenReg) to the Department of Revenue",
      "File quarterly wage and tax reports electronically via UI eServices"
    ],
    "confirmation_proof": "Montana issues an unemployment insurance account number and contribution rate upon registration. The Department of Revenue mails or provides the withholding account number once the application is processed. Employers should save the confirmation page or email from the UI eServices portal.",
    "contacts": {
      "phone": "406‑444‑3834 (UI contributions); 406‑444‑2545 (UI general); 406‑444‑6900 (Department of Revenue)",
      "email": null
    },
    "last_verified_date": "2026-02-05",
    "source_notes": "Montana Employer Handbook details coverage thresholds for general, agricultural and domestic employers【411342499543947†L423-L444】. The UI eServices portal provides employer contact numbers【402625675309573†L138-L144】. The Department of Revenue page explains that employers must register for withholding accounts before paying wages and lists required information【867228617377441†L169-L179】. The Business Registration Form shows fields for business details, FEIN/SSN, addresses, NAICS code and owners/officers【226773428050642†L69-L110】【226773428050642†L169-L180】.",
    "rules": {
      "status": "complete",
      "ui_liability": {
        "general": {
          "wage_threshold": {
            "amount": 1000.0,
            "period": "year"
          },
          "weeks_threshold": {
            "weeks": null,
            "unit": null,
            "min_employees": null
          }
        },
        "domestic": {
          "wage_threshold": {
            "amount": 1000.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "weeks": null,
            "unit": null,
            "min_employees": null
          }
        },
        "agricultural": {
          "wage_threshold": {
            "amount": 20000.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "weeks": 20,
            "unit": "weeks_in_year",
            "min_employees": 10
          }
        },
        "nonprofit": {
          "wage_threshold": {
            "amount": 1000.0,
            "period": "year"
          },
          "weeks_threshold": {
            "weeks": null,
            "unit": null,
            "min_employees": null
          }
        },
        "notes": []
      },
      "withholding": {
        "required_from_first_payroll": true,
        "notes": []
      },
      "todo": []
    }
  },
  {
    "state_code": "NE",
    "state_name": "Nebraska",
    "agency_name": "Nebraska Department of Labor – Unemployment Insurance Tax; Nebraska Department of Revenue",
    "registration_portal_url": [
      "https://neworks.nebraska.gov/",
      "https://ndr-efs.ne.gov/",
      "https://revenue.nebraska.gov/"
    ],
    "ui_wage_threshold_text": "General employers become liable when they pay $1,500 or more in gross wages in any calendar quarter【588171141101703†L396-L415】. Domestic employers are liable when they pay $1,000 or more in cash wages in a quarter【588171141101703†L421-L426】. Agricultural employers are liable when they pay $20,000 or more in cash wages in a quarter【588171141101703†L428-L435】.",
    "ui_threshold_weeks_text": "Employers become liable if they employ one or more individuals in covered employment for some portion of 20 different weeks in a calendar year【588171141101703†L396-L415】. Agricultural employers are also liable when they employ 10 or more workers in 20 different weeks【588171141101703†L428-L435】. Non‑profit organizations become liable when they have four or more employees in covered employment for 20 different weeks【588171141101703†L439-L447】.",
    "withholding_registration_required": true,
    "withholding_threshold_description": "Employers must apply for a Nebraska income tax withholding number before withholding state income taxes from employees. Registration is required when wages subject to Nebraska income tax are paid【266152701493000†L129-L139】.",
    "typical_processing_time": "Unemployment tax registrations are reviewed by agency staff and accounts are activated within roughly 24–48 business hours after submission【37818398137271†L510-L518】. The Department of Revenue mails a Nebraska Withholding Certificate with the state identification number after processing Form 20 or the online application.",
    "required_information": [
      "Legal business name and physical location",
      "Mailing address",
      "Federal Employer Identification Number (FEIN)",
      "Type of organization (sole proprietorship, partnership, corporation, LLC, government, nonprofit, etc.)",
      "Type of employment (regular, agricultural, domestic)",
      "Date employees first worked in Nebraska and date first wages were paid",
      "Number of employees and total quarterly payroll",
      "Industry code (NAICS) and description of business activity",
      "Payroll contact information for benefits, unemployment tax and SIDES communications",
      "Federal Unemployment Tax Act (FUTA) liability details",
      "Names, Social Security numbers and addresses of owners, officers or partners",
      "Information on any acquired business or predecessor account",
      "Details on independent contractors and remote employees",
      "For withholding registration (Form 20): trade name/DBA, accounting period, date of first wages for withholding, and names/SSNs of owners/officers【84236129905932†L69-L110】【84236129905932†L145-L154】"
    ],
    "filing_methods": [
      "Register for unemployment insurance online through the NEworks Employer Self Service system",
      "Submit a paper Employer Status Report by mail if unable to register online",
      "Register for income tax withholding online through the Nebraska Department of Revenue’s e-services (NebFile for Business)",
      "Alternatively, mail Form 20 to the Department of Revenue",
      "File quarterly combined tax and wage reports electronically via NEworks or mail Form UI 11T/UI 11W"
    ],
    "confirmation_proof": "Nebraska sends an Employer Account Number (EAN) and combined tax rate notice after approving the employer registration. For withholding, the Department of Revenue issues a Nebraska Withholding Certificate showing the Nebraska Identification Number. Employers should retain confirmation emails or letters as proof of registration.",
    "contacts": {
      "phone": "402‑471‑9898 (Unemployment Insurance); 402‑471‑9000; 800‑742‑7474 (Department of Revenue); 402‑471‑5729 (Department of Revenue)",
      "email": null
    },
    "last_verified_date": "2026-02-05",
    "source_notes": "Nebraska Employer’s Guide to Unemployment Insurance lists wage and week thresholds for general, domestic, agricultural and nonprofit employers【588171141101703†L396-L415】【588171141101703†L421-L426】【588171141101703†L428-L435】【588171141101703†L439-L447】. The Unemployment Tax Account Instructions note that accounts are activated within 24–48 business hours【37818398137271†L510-L518】. The Employer Tax Services User Guide describes required business details, dates of first wages, contact information and ownership details【37818398137271†L339-L350】【37818398137271†L347-L356】. Nebraska Department of Revenue FAQs state that employers must apply for a withholding number using Form 20【266152701493000†L129-L139】; Form 20 requests FEIN/SSN, business name, addresses, NAICS code, date of first wages, and owner/officer information【84236129905932†L69-L110】【84236129905932†L145-L154】.",
    "rules": {
      "status": "complete",
      "ui_liability": {
        "general": {
          "wage_threshold": {
            "amount": 1500.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "weeks": 20,
            "unit": "weeks_in_year",
            "min_employees": 1
          }
        },
        "domestic": {
          "wage_threshold": {
            "amount": 1000.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "weeks": null,
            "unit": null,
            "min_employees": null
          }
        },
        "agricultural": {
          "wage_threshold": {
            "amount": 20000.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "weeks": 20,
            "unit": "weeks_in_year",
            "min_employees": 10
          }
        },
        "nonprofit": {
          "wage_threshold": {
            "amount": null,
            "period": null
          },
          "weeks_threshold": {
            "weeks": 20,
            "unit": "weeks_in_year",
            "min_employees": 4
          }
        },
        "notes": []
      },
      "withholding": {
        "required_from_first_payroll": true,
        "notes": []
      },
      "todo": []
    }
  },
  {
    "state_code": "NV",
    "state_name": "Nevada",
    "agency_name": "Nevada Department of Employment, Training and Rehabilitation – Employment Security Division (ESD)",
    "registration_portal_url": [
      "https://ui.nv.gov/"
    ],
    "ui_wage_threshold_text": "Employers must register when they pay $225 or more in wages during a calendar quarter【635653378356751†L73-L75】. Agricultural employers become liable when they pay $20,000 or more in wages in any quarter【635653378356751†L78-L80】.",
    "ui_threshold_weeks_text": "Agricultural employers are liable if they employ 10 or more agricultural workers for at least 20 weeks during a calendar year【635653378356751†L78-L80】. (No explicit week‑threshold applies to general employers beyond the wage requirement.)",
    "withholding_registration_required": false,
    "withholding_threshold_description": "Nevada does not impose a state personal income tax, so employers are not required to register for wage withholding. After UI registration, businesses may need to register for the Modified Business Tax (MBT) if quarterly gross wages exceed $50,000【635653378356751†L46-L58】【635653378356751†L115-L127】.",
    "typical_processing_time": "After creating an Employer Self Service (ESS) account on the DETR website and submitting the required information, the Department processes the registration and assigns a Nevada UI account number within approximately 1–3 business days【635653378356751†L97-L110】.",
    "required_information": [
      "Legal business name",
      "Federal Employer Identification Number (EIN)",
      "Nevada business license number",
      "Physical and mailing addresses",
      "Contact person’s name, phone number and email",
      "Date payroll will begin or date first wages were paid",
      "Type of business entity and primary business activity (NAICS code)",
      "Number of employees and quarterly gross wages"
    ],
    "filing_methods": [
      "Register for unemployment insurance online through the Employer Self Service (ESS) portal at ui.nv.gov",
      "File quarterly Contribution and Wage Reports electronically via the ESS portal",
      "Register for the Modified Business Tax via the Nevada Tax Center after completing UI registration if applicable"
    ],
    "confirmation_proof": "The Nevada Employment Security Division issues a UI account number after processing the registration. Confirmation is provided via the ESS portal or email. MBT account details are provided separately if applicable.",
    "contacts": {
      "phone": "775‑684‑0350 (Northern Nevada); 702‑486‑0350 (Southern Nevada); 888‑890‑8211 (rural/out‑of‑state)",
      "email": null
    },
    "last_verified_date": "2026-02-05",
    "source_notes": "GoCo’s Nevada payroll tax guide notes that registration is required when paying $225 in wages in a quarter and provides agricultural thresholds【635653378356751†L73-L83】. It explains that employers register for unemployment insurance through the Employer Self Service portal and the DETR processes applications within 1–3 business days【635653378356751†L97-L110】. The guide also states that Nevada has no state income tax and that employers must register for the Modified Business Tax only if gross wages exceed $50,000【635653378356751†L46-L58】【635653378356751†L115-L127】. The DETR contact page lists phone numbers for unemployment inquiries【391463858084507†L91-L99】.",
    "rules": {
      "status": "complete",
      "ui_liability": {
        "general": {
          "wage_threshold": {
            "amount": 225.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "weeks": null,
            "unit": null,
            "min_employees": null
          }
        },
        "domestic": {
          "wage_threshold": {
            "amount": null,
            "period": null
          },
          "weeks_threshold": {
            "weeks": null,
            "unit": null,
            "min_employees": null
          }
        },
        "agricultural": {
          "wage_threshold": {
            "amount": 20000.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "weeks": 20,
            "unit": "weeks_in_year",
            "min_employees": 10
          }
        },
        "nonprofit": {
          "wage_threshold": {
            "amount": 225.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "weeks": null,
            "unit": null,
            "min_employees": null
          }
        },
        "notes": []
      },
      "withholding": {
        "required_from_first_payroll": false,
        "notes": []
      },
      "todo": []
    }
  },
  {
    "state_code": "NH",
    "state_name": "New Hampshire",
    "agency_name": "New Hampshire Employment Security (NHES)",
    "registration_portal_url": [
      "https://www.nhes.nh.gov/"
    ],
    "ui_wage_threshold_text": "Employers become liable when they pay $1,500 or more in wages within a calendar quarter【449766785492033†L59-L61】.",
    "ui_threshold_weeks_text": "Employers are also liable if at least one employee performs services for part of a day in 20 or more different weeks during a calendar year【449766785492033†L59-L61】.",
    "withholding_registration_required": false,
    "withholding_threshold_description": "New Hampshire does not levy a state income tax on wages, so employers do not register for wage withholding【449766785492033†L35-L39】【449766785492033†L85-L87】.",
    "typical_processing_time": "After registering online through NH Employment Security, employers typically receive their Employer Account Number and unemployment tax rate within about two weeks. Employers needing the number sooner may call NHES the day after registering【449766785492033†L45-L52】.",
    "required_information": [
      "Federal Employer Identification Number (FEIN)",
      "Legal business name and mailing address",
      "Physical work address in New Hampshire",
      "Type of business entity and ownership details",
      "Date employees first performed services in New Hampshire and date wages were first paid",
      "Total payroll and number of employees",
      "Contact information for the person responsible for payroll and unemployment correspondence",
      "Names and Social Security numbers of owners, partners or corporate officers"
    ],
    "filing_methods": [
      "Register online via the NHES Employer WebTax system",
      "File quarterly contribution and wage reports electronically through the WebTax portal",
      "Mail paper reports if electronic filing is not possible"
    ],
    "confirmation_proof": "NHES issues an Employer Account Number and unemployment tax rate after processing the registration. Employers receive this information by mail and may obtain it sooner by calling NHES. The Letter of Determination or quarterly tax and wage report serves as official confirmation of registration【449766785492033†L71-L80】.",
    "contacts": {
      "phone": "603‑224‑3311; 603‑228‑4038",
      "email": null
    },
    "last_verified_date": "2026-02-05",
    "source_notes": "Justworks’ New Hampshire payroll tax guide states that employers must register with NHES and are liable when they pay $1,500 in wages or employ at least one employee for part of a week in 20 or more different weeks【449766785492033†L59-L61】. It notes that employers receive their Employer Account Number and tax rate within about two weeks and provides NHES contact phone numbers【449766785492033†L45-L52】【449766785492033†L71-L80】. The guide also clarifies that New Hampshire does not levy state income tax on wages and therefore does not require wage‑withholding registration【449766785492033†L35-L39】【449766785492033†L85-L87】.",
    "rules": {
      "status": "complete",
      "ui_liability": {
        "general": {
          "wage_threshold": {
            "amount": 1500.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "weeks": 20,
            "unit": "weeks_in_year",
            "min_employees": 1
          }
        },
        "domestic": {
          "wage_threshold": {
            "amount": 1500.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "weeks": 20,
            "unit": "weeks_in_year",
            "min_employees": 1
          }
        },
        "agricultural": {
          "wage_threshold": {
            "amount": 1500.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "weeks": 20,
            "unit": "weeks_in_year",
            "min_employees": 1
          }
        },
        "nonprofit": {
          "wage_threshold": {
            "amount": 1500.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "weeks": 20,
            "unit": "weeks_in_year",
            "min_employees": 1
          }
        },
        "notes": []
      },
      "withholding": {
        "required_from_first_payroll": false,
        "notes": []
      },
      "todo": []
    }
  },
  {
    "state_code": "NJ",
    "state_name": "New Jersey",
    "agency_name": "New Jersey Department of Labor & Workforce Development and Division of Revenue & Enterprise Services",
    "registration_portal_url": "https://www.njportal.com/DOR/BusinessRegistration",
    "ui_wage_threshold_text": "Employers become subject to New Jersey unemployment insurance if they employ one or more individuals and pay at least $1,000 in wages in a calendar year. Employers subject to FUTA (employing workers in 20 different weeks or paying $1,500 in wages in a quarter) are automatically liable. Domestic employers are subject when they pay $1,000 or more in cash wages in a quarter; agricultural employers when they pay $20,000 in wages in a quarter or employ ten or more workers for 20 weeks.",
    "ui_threshold_weeks_text": "20 different weeks with one or more workers for general employers; 20 weeks with 10 or more workers for agricultural employers; 20 weeks with four or more workers for 501(c)(3) nonprofits; household employment has no weeks test.",
    "withholding_registration_required": true,
    "withholding_threshold_description": "New Jersey requires employers to register for withholding and withhold state income tax from employees' wages whenever federal withholding is required. Employees complete Form NJ‑W4 to determine state withholding; there is no wage threshold.",
    "typical_processing_time": "The NJ‑REG must be filed at least 15 business days before commencing business. The Division of Revenue mails a registration confirmation with a 15‑digit employer identification number and a 4‑digit authorization code within about two weeks.",
    "required_information": [
      "Business Entity ID or Corporate ID",
      "Federal Employer Identification Number (FEIN) or sole proprietor's SSN",
      "NJ Business Code and NAICS code",
      "Legal business name and trade name",
      "Physical and mailing addresses",
      "Names and Social Security numbers of owners, partners or corporate officers",
      "Date of first wages paid in New Jersey and total wages paid",
      "Number of employees",
      "Contact person and email/phone",
      "For S corporations, S corporation registration approval",
      "Line 8 from Form NJ‑927 for employer access (for authorization code)"
    ],
    "filing_methods": [
      "Online via New Jersey Business Registration (Form NJ‑REG) to register for unemployment insurance, disability, workforce development, and withholding",
      "By mail using Form NJ‑REG to the Division of Revenue & Enterprise Services",
      "Register for Employer Access online to file quarterly wage reports (WR‑30) and contributions (NJ‑927) and obtain the employer identification number and authorization code"
    ],
    "confirmation_proof": "Employer receives a 15‑digit New Jersey employer identification number (constructed from the FEIN plus a suffix) and a 4‑digit authorization code in a confirmation letter, which serve as the unemployment account number and withholding tax identification; the registration also generates a Notice of Employer Contribution Rate.",
    "contacts": {
      "phone": "609‑633‑6400 (Employer Access helpline), 609‑292‑9292 (Division of Revenue business registration)",
      "email": "EmployerAccess@dol.nj.gov"
    },
    "last_verified_date": "2026-02-05",
    "source_notes": "New Jersey Department of Labor Employer Informational Packet and Division of Revenue registration pages describing employer liability and registration requirements. The packet notes that an employing unit with one or more individuals and remuneration of at least $1,000 in a calendar year is an employer; employers subject to FUTA become employers; domestic and agricultural thresholds; the Employer Access instructions page explains the 15‑digit employer ID and 4‑digit authorization code and provides contact information【113854937092216†L26-L55】【918119928763104†L189-L205】. The Division of Taxation page instructs filing NJ‑REG at least 15 days before beginning business【20840840745953†L140-L144】.",
    "rules": {
      "status": "complete",
      "ui_liability": {
        "general": {
          "wage_threshold": {
            "amount": 1000.0,
            "period": "year"
          },
          "weeks_threshold": {
            "min_employees": 1,
            "unit": "weeks_in_year",
            "weeks": 20
          }
        },
        "domestic": {
          "wage_threshold": {
            "amount": 1000.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "min_employees": null,
            "unit": null,
            "weeks": null
          }
        },
        "agricultural": {
          "wage_threshold": {
            "amount": 20000.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "min_employees": 10,
            "unit": "weeks_in_year",
            "weeks": 20
          }
        },
        "nonprofit": {
          "wage_threshold": {
            "amount": null,
            "period": null
          },
          "weeks_threshold": {
            "min_employees": 4,
            "unit": "weeks_in_year",
            "weeks": 20
          }
        },
        "notes": [
          "Employers subject to FUTA become liable when paying $1,500 in wages in a quarter or having employees for 20 weeks."
        ]
      },
      "withholding": {
        "required_from_first_payroll": true,
        "notes": []
      }
    }
  },
  {
    "state_code": "NM",
    "state_name": "New Mexico",
    "agency_name": "New Mexico Department of Workforce Solutions (Unemployment Insurance) and New Mexico Taxation & Revenue Department",
    "registration_portal_url": "https://ui.dws.state.nm.us and https://tap.state.nm.us",
    "ui_wage_threshold_text": "Non‑agricultural employers must register when their total payroll is $450 or more in a calendar quarter, or if they have one or more workers in any part of 20 weeks in a year. Agricultural employers must register when they pay $20,000 or more in wages in a quarter or employ 10 or more workers in 20 weeks during the year. Domestic employers must register when they pay $1,000 or more in cash wages in a quarter.",
    "ui_threshold_weeks_text": "20 weeks with one or more workers for non‑agricultural employers; 20 weeks with 10 or more workers for agricultural employers; 20 weeks with four or more workers for 501(c)(3) nonprofits.",
    "withholding_registration_required": true,
    "withholding_threshold_description": "Employers must register for a New Mexico Wage Withholding Tax (WWT) account and withhold state income tax whenever they withhold federal income tax from employees; there is no minimum wage threshold for withholding.",
    "typical_processing_time": "The New Mexico Taxation & Revenue Department issues a Business Tax Identification Number (BTIN) and deposit schedule on the same day when registration is completed online; the Department of Workforce Solutions assigns an Employer Account Number after reviewing the online application, typically within five to ten business days.",
    "required_information": [
      "Federal Employer Identification Number (FEIN)",
      "New Mexico Secretary of State business registration number or CRS number",
      "Legal business name and trade name",
      "Physical and mailing addresses and business phone",
      "Type of organization (corporation, LLC, sole proprietor, partnership, nonprofit)",
      "Date employees first performed services and date first wages were or will be paid in New Mexico",
      "Number of employees and estimated quarterly payroll",
      "Names, titles, Social Security numbers and home addresses of owners, partners, or corporate officers",
      "Business activity and NAICS code",
      "Whether the business acquired or merged with another company",
      "Wage withholding option and deposit schedule",
      "For nonprofits, 501(c)(3) exemption documentation"
    ],
    "filing_methods": [
      "Register online for unemployment insurance through the New Mexico Department of Workforce Solutions UI Tax & Claims System (uieservices)",
      "Complete and submit the Employer Registration online for wage withholding through the New Mexico Taxation & Revenue Department's Taxpayer Access Point (TAP) to obtain a Business Tax Identification Number (BTIN)",
      "Mail paper forms if necessary (e.g., Form ACD‑31015 Business Tax Registration) to the Taxation & Revenue Department"
    ],
    "confirmation_proof": "After registration, the employer receives an Employer Account Number and Contribution Rate Notice from NMDWS and receives a New Mexico Taxation & Revenue Department Business Tax Identification Number and withholding deposit schedule.",
    "contacts": {
      "phone": "1‑877‑664‑6984 (NMDWS UI Tax & Claims Customer Service), 505‑827‑0700 (NM Taxation & Revenue Department)",
      "email": "uitax.support@state.nm.us"
    },
    "last_verified_date": "2026-02-05",
    "source_notes": "New Mexico Unemployment Insurance Employer Handbook lines 239–253 describe the $450 quarterly payroll threshold for non‑agricultural employers, the $20,000 or 10‑worker agricultural threshold, and the $1,000 domestic threshold; the handbook also lists contact details for the UI Tax & Claims system and instructs employers to register online【583426786290834†L239-L253】【583426786290834†L131-L143】. FYI‑104 from the NM Taxation & Revenue Department explains that employers who withhold federal income tax must also withhold New Mexico income tax【241127524021304†L131-L139】. Additional sources (OnPay and Justworks) confirm that the BTIN is issued on the same day and the Employer Account Number is issued within approximately five to ten business days.",
    "rules": {
      "status": "complete",
      "ui_liability": {
        "general": {
          "wage_threshold": {
            "amount": 450.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "min_employees": 1,
            "unit": "weeks_in_year",
            "weeks": 20
          }
        },
        "domestic": {
          "wage_threshold": {
            "amount": 1000.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "min_employees": null,
            "unit": null,
            "weeks": null
          }
        },
        "agricultural": {
          "wage_threshold": {
            "amount": 20000.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "min_employees": 10,
            "unit": "weeks_in_year",
            "weeks": 20
          }
        },
        "nonprofit": {
          "wage_threshold": {
            "amount": null,
            "period": null
          },
          "weeks_threshold": {
            "min_employees": 4,
            "unit": "weeks_in_year",
            "weeks": 20
          }
        },
        "notes": []
      },
      "withholding": {
        "required_from_first_payroll": true,
        "notes": []
      }
    }
  },
  {
    "state_code": "NY",
    "state_name": "New York",
    "agency_name": "New York State Department of Labor",
    "registration_portal_url": "https://www.businessexpress.ny.gov/",
    "ui_wage_threshold_text": "$300 or more in remuneration in a calendar quarter for general business employers; nonprofit employers become liable when they pay $1,000 in a quarter or have four or more workers for at least one day in each of 20 weeks; household employers are liable at $500 per quarter; agricultural employers are liable at $300 per quarter (effective Jan 1 2020); governmental entities and Indian tribes are liable from the first dollar of remuneration",
    "ui_threshold_weeks_text": "20 weeks with four or more employees for nonprofit employers",
    "withholding_registration_required": true,
    "withholding_threshold_description": "Employers who maintain an office or transact business in New York and pay wages to employees must register and withhold New York income tax beginning with the first payroll (withholding is required on wages paid to residents and on wages paid to nonresidents for services performed in New York)",
    "typical_processing_time": "Registration through New York Business Express generally yields an employer registration number within a few days; paper Form NYS‑100 filings may take longer",
    "required_information": [
      "Federal Employer Identification Number (FEIN)",
      "Type of legal entity and structure (corporation, partnership, sole proprietor, etc.)",
      "Telephone and fax numbers",
      "Legal name and trade name (DBA) of the business",
      "Business email address",
      "Date the business began operations in New York and date first payroll was paid",
      "Number of covered employees",
      "Whether the business expects to pay $300 or more in a calendar quarter or have employees for 20 weeks",
      "Whether the business is registering for unemployment insurance, withholding only, or both",
      "Information on any acquisition of a prior business (name, employer registration number and date of acquisition)",
      "Physical, mailing and record‑keeping addresses and contact person"
    ],
    "filing_methods": [
      "Online via New York Business Express (NYBE) for most general, household and agricultural employers",
      "Paper Form NYS‑100 (Business Unemployment Insurance Registration) for nonprofit organizations, government employers and Indian tribes"
    ],
    "confirmation_proof": "Eight‑digit employer registration number assigned by the Department of Labor and confirmation letter",
    "contacts": {
      "phone": "888-899-8810",
      "email": null
    },
    "last_verified_date": "2025-11-01",
    "source_notes": "NY DOL liability thresholds and registration instructions",
    "rules": {
      "status": "complete",
      "ui_liability": {
        "general": {
          "wage_threshold": {
            "amount": 300.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "weeks": null,
            "unit": null,
            "min_employees": null
          }
        },
        "domestic": {
          "wage_threshold": {
            "amount": 500.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "weeks": null,
            "unit": null,
            "min_employees": null
          }
        },
        "agricultural": {
          "wage_threshold": {
            "amount": 300.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "weeks": null,
            "unit": null,
            "min_employees": null
          }
        },
        "nonprofit": {
          "wage_threshold": {
            "amount": 1000.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "weeks": 20,
            "unit": "weeks_in_year",
            "min_employees": 4
          }
        },
        "notes": [
          "Governmental entities and Indian tribes liable from first dollar"
        ]
      },
      "withholding": {
        "required_from_first_payroll": true,
        "notes": []
      },
      "todo": []
    }
  },
  {
    "state_code": "NC",
    "state_name": "North Carolina",
    "agency_name": "North Carolina Division of Employment Security (DES)",
    "registration_portal_url": "https://www.ncsuits.com/",
    "ui_wage_threshold_text": "$1,500 in wages in a quarter or at least one worker in covered employment for 20 different weeks during a calendar year; domestic employers are liable when they pay $1,000 or more in a quarter; nonprofit 501(c)(3) employers become liable when they have four or more employees for 20 weeks; agricultural employers become liable when they pay $20,000 in wages in a quarter or employ 10 or more workers for 20 weeks",
    "ui_threshold_weeks_text": "20 different weeks with at least one employee (general employment); 20 weeks with four or more employees (nonprofit) or with 10 or more workers (agricultural)",
    "withholding_registration_required": true,
    "withholding_threshold_description": "Employers paying wages to individuals for services performed in North Carolina must register for and withhold state income tax from the first payroll; Form NC‑BR can be filed online or on paper to obtain a North Carolina withholding identification number",
    "typical_processing_time": "Employers who register online through the North Carolina State Unemployment Insurance Tax System receive an Employer ID Number immediately; paper Employer Status Report (NCUI‑604) processing time is longer; the Department of Revenue mails the withholding identification number after processing Form NC‑BR",
    "required_information": [
      "Federal Employer Identification Number (FEIN)",
      "Legal name and trade name (if any) of the business",
      "Business entity type (corporation, partnership, sole proprietor, etc.)",
      "Dates of first service performed in North Carolina and first wages paid",
      "Number of employees and whether the business expects to meet wage or week thresholds",
      "Information on whether the employer is a nonprofit, agricultural, domestic or governmental entity",
      "Details about acquisitions or changes of ownership",
      "Business mailing, physical and record‑keeping addresses and contact person"
    ],
    "filing_methods": [
      "Online via NCSUITS (Employer Self‑Service Portal)",
      "Paper Employer Status Report (Form NCUI‑604) for unemployment tax and paper Form NC‑BR for withholding tax"
    ],
    "confirmation_proof": "Employer ID Number for unemployment tax and a separate North Carolina withholding identification number mailed by the Department of Revenue",
    "contacts": {
      "phone": "866-278-3822",
      "email": null
    },
    "last_verified_date": "2025-11-01",
    "source_notes": "DES liability thresholds and withholding registration instructions",
    "rules": {
      "status": "complete",
      "ui_liability": {
        "general": {
          "wage_threshold": {
            "amount": 1500.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "weeks": 20,
            "unit": "weeks_in_year",
            "min_employees": 1
          }
        },
        "domestic": {
          "wage_threshold": {
            "amount": 1000.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "weeks": null,
            "unit": null,
            "min_employees": null
          }
        },
        "agricultural": {
          "wage_threshold": {
            "amount": 20000.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "weeks": 20,
            "unit": "weeks_in_year",
            "min_employees": 10
          }
        },
        "nonprofit": {
          "wage_threshold": {
            "amount": null,
            "period": null
          },
          "weeks_threshold": {
            "weeks": 20,
            "unit": "weeks_in_year",
            "min_employees": 4
          }
        },
        "notes": []
      },
      "withholding": {
        "required_from_first_payroll": true,
        "notes": []
      },
      "todo": []
    }
  },
  {
    "state_code": "ND",
    "state_name": "North Dakota",
    "agency_name": "Job Service North Dakota and North Dakota Office of State Tax Commissioner",
    "registration_portal_url": "https://apps.nd.gov/jsnd/uieasy/firm/EmployerLogin.htm and https://www.tax.nd.gov/tap",
    "ui_wage_threshold_text": "Employers become liable for North Dakota unemployment insurance when they pay $1,500 or more in gross wages during a calendar quarter or have one or more individuals in employment for any part of a day in 20 different weeks within a calendar year. Domestic employers become liable when they pay $1,000 or more in cash wages in a quarter; agricultural employers are liable when they pay $20,000 or more in cash wages in a quarter or employ 10 or more workers in agricultural labor for 20 weeks; nonprofit employers with 501(c)(3) status become liable when they employ four or more workers for some portion of a day in 20 weeks.",
    "ui_threshold_weeks_text": "20 different weeks with at least one employee for general employers; 20 weeks with 10 or more workers for agricultural employers; 20 weeks with four or more employees for 501(c)(3) nonprofits.",
    "withholding_registration_required": true,
    "withholding_threshold_description": "Employers must register for a North Dakota income tax withholding account via the Taxpayer Access Point before withholding state income tax; withholding is required on wages paid to employees performing services in North Dakota when federal income tax must be withheld; there is no minimum wage threshold.",
    "typical_processing_time": "Employers are required to submit a Report to Determine Liability within 20 days of hiring employees or acquiring a business; after the report is processed, the unemployment insurance account number is issued, typically within one to two weeks; the Tax Commissioner usually issues the withholding account number within a few days of online registration.",
    "required_information": [
      "Federal Employer Identification Number (FEIN)",
      "Legal business name and trade name",
      "Physical and mailing addresses and business phone number",
      "Type of ownership (corporation, LLC, partnership, sole proprietor, nonprofit) and date formed",
      "Date employees first performed services and date first wages were paid in North Dakota",
      "Estimated quarterly payroll and number of covered employees",
      "Names, titles, Social Security numbers and addresses of all owners, partners, members or corporate officers",
      "Business activity and NAICS code",
      "Information about acquisitions or mergers and successor employer details",
      "Payroll contact person and email",
      "For nonprofits, proof of 501(c)(3) status"
    ],
    "filing_methods": [
      "File a Report to Determine Liability online through Job Service North Dakota's UI EASY portal or submit Form SFN 41216 by mail within 20 days after hiring employees; once liability is established, employers may file quarterly contribution reports electronically via UI EASY",
      "Register for an income tax withholding account using the Taxpayer Access Point (TAP) on the Office of State Tax Commissioner’s website; employers may also complete the paper application if needed"
    ],
    "confirmation_proof": "After successful registration, the employer receives a North Dakota unemployment insurance account number and rate notice from Job Service North Dakota and a withholding account number from the Office of State Tax Commissioner.",
    "contacts": {
      "phone": "701‑328‑2814 (Job Service North Dakota UI Tax), 701‑328‑1241 (Office of State Tax Commissioner)",
      "email": null
    },
    "last_verified_date": "2026-02-05",
    "source_notes": "The North Dakota Employer's Handbook lists the liability criteria: paying $1,500 or more in wages or having one or more individuals in employment for any part of 20 different weeks; domestic and agricultural thresholds ($1,000 cash wages, $20,000 or 10 workers) and a rule for 501(c)(3) nonprofits【675404955639916†L628-L707】. The handbook also explains that employers must submit a Report to Determine Liability within 20 days of hiring employees【675404955639916†L630-L647】. A Square article states that employers need both a North Dakota UI account and a North Dakota withholding account and provides contact phone numbers for the Job Service North Dakota and the State Tax Commissioner【289978958769971†L51-L148】.",
    "rules": {
      "status": "complete",
      "ui_liability": {
        "general": {
          "wage_threshold": {
            "amount": 1500.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "min_employees": 1,
            "unit": "weeks_in_year",
            "weeks": 20
          }
        },
        "domestic": {
          "wage_threshold": {
            "amount": 1000.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "min_employees": null,
            "unit": null,
            "weeks": null
          }
        },
        "agricultural": {
          "wage_threshold": {
            "amount": 20000.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "min_employees": 10,
            "unit": "weeks_in_year",
            "weeks": 20
          }
        },
        "nonprofit": {
          "wage_threshold": {
            "amount": null,
            "period": null
          },
          "weeks_threshold": {
            "min_employees": 4,
            "unit": "weeks_in_year",
            "weeks": 20
          }
        },
        "notes": []
      },
      "withholding": {
        "required_from_first_payroll": true,
        "notes": []
      }
    }
  },
  {
    "state_code": "OH",
    "state_name": "Ohio",
    "agency_name": "Ohio Department of Job and Family Services (ODJFS)",
    "registration_portal_url": "https://thesource.jfs.ohio.gov/",
    "ui_wage_threshold_text": "$1,500 or more in wages in a calendar quarter or at least one employee in covered employment for 20 different weeks; domestic employers are liable when they pay $1,000 in cash wages in a quarter; agricultural employers are liable when they pay $20,000 in cash wages in a quarter or employ 10 or more individuals for 20 weeks; nonprofit employers become liable when they have four or more employees for 20 weeks; governmental entities and Indian tribes are liable from the first dollar of remuneration",
    "ui_threshold_weeks_text": "20 different weeks with at least one employee (general employment); 20 weeks with four or more employees (nonprofit); 20 weeks with 10 or more workers (agricultural)",
    "withholding_registration_required": true,
    "withholding_threshold_description": "Every employer maintaining an office or transacting business in Ohio and paying compensation to an employee (resident or nonresident) must register within 15 days of liability and withhold Ohio income tax from the first payroll, unless the employee is a resident of a reciprocal state (MI, IN, KY, WV or PA)",
    "typical_processing_time": "Online registration via The SOURCE yields an Employer ID and contribution rate immediately; paper Report to Determine Liability (JFS 20100) takes approximately 4–6 weeks to process",
    "required_information": [
      "Contact person’s name, job title, address, telephone number and email",
      "Federal Employer Identification Number (FEIN)",
      "Dates work was first performed in Ohio and the first covered wages were paid",
      "Number of employees currently paid or expected to be paid",
      "Business type (regular, nonprofit, agricultural, domestic, public entity)",
      "Whether the employer expects to meet the wage or week liability thresholds",
      "Employer entity type (sole proprietorship, partnership, corporation, LLC, association, government entity, etc.)",
      "Legal entity name and trade name (DBA)",
      "Date and state of formation",
      "Whether the employer acquired all or part of an existing business (with details: employer account number and FEIN of predecessor, date and percentage of acquisition)",
      "Preferred method of communication (email or postal mail)"
    ],
    "filing_methods": [
      "Online via The SOURCE (preferred)",
      "Paper Report to Determine Liability (Form JFS 20100) mailed to ODJFS"
    ],
    "confirmation_proof": "Employer ID number and contribution rate notice provided electronically after online registration or mailed after paper processing",
    "contacts": {
      "phone": "888-405-4089",
      "email": null
    },
    "last_verified_date": "2025-11-01",
    "source_notes": "ODJFS liability criteria and registration information",
    "rules": {
      "status": "complete",
      "ui_liability": {
        "general": {
          "wage_threshold": {
            "amount": 1500.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "weeks": 20,
            "unit": "weeks_in_year",
            "min_employees": 1
          }
        },
        "domestic": {
          "wage_threshold": {
            "amount": 1000.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "weeks": null,
            "unit": null,
            "min_employees": null
          }
        },
        "agricultural": {
          "wage_threshold": {
            "amount": 20000.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "weeks": 20,
            "unit": "weeks_in_year",
            "min_employees": 10
          }
        },
        "nonprofit": {
          "wage_threshold": {
            "amount": null,
            "period": null
          },
          "weeks_threshold": {
            "weeks": 20,
            "unit": "weeks_in_year",
            "min_employees": 4
          }
        },
        "notes": [
          "Governmental entities and Indian tribes liable from first dollar"
        ]
      },
      "withholding": {
        "required_from_first_payroll": true,
        "notes": [
          "Reciprocal state exemptions (MI, IN, KY, WV, PA)"
        ]
      },
      "todo": []
    }
  },
  {
    "state_code": "OK",
    "state_name": "Oklahoma",
    "agency_name": "Oklahoma Employment Security Commission (OESC) and Oklahoma Tax Commission",
    "registration_portal_url": "https://eztaxexpress.oesc.ok.gov and https://oktap.tax.ok.gov",
    "ui_wage_threshold_text": "Employers must report wages and pay Oklahoma unemployment insurance taxes when they pay $1,500 or more in wages in a calendar quarter or have employment in any part of a day in each of 20 different weeks in a year. Agricultural employers are liable when they pay $20,000 or more in wages in a quarter or employ 10 or more workers in agricultural labor for 20 weeks. Domestic employers become liable when they pay $1,000 or more in cash wages in a quarter. Non‑profit organizations become liable when they employ four or more workers for 20 weeks. Successor employers, employers subject to FUTA and out‑of‑state employers paying wages in Oklahoma are also liable.",
    "ui_threshold_weeks_text": "20 different weeks with one or more employees for general employers; 20 weeks with 10 or more workers for agricultural employers; 20 weeks with four or more employees for 501(c)(3) nonprofits.",
    "withholding_registration_required": true,
    "withholding_threshold_description": "Employers must register with the Oklahoma Tax Commission for a withholding account and withhold Oklahoma income tax from wages paid to employees; there is no minimum wage threshold—registration is required when employees are first hired and wages are paid in Oklahoma.",
    "typical_processing_time": "Account numbers are typically issued within a few business days after completing the online application through EZ Tax Express and the Taxpayer Access Point; employers registering by mail may wait several weeks.",
    "required_information": [
      "Federal Employer Identification Number (FEIN)",
      "Legal business name and any trade name",
      "Physical and mailing addresses and business phone number",
      "Ownership type and date of organization",
      "Date employees first worked in Oklahoma and date first wages were paid",
      "Estimated quarterly payroll and number of employees",
      "Names, Social Security numbers and addresses of owners, partners, members or corporate officers",
      "Business activity or NAICS code",
      "Information about predecessors or acquired businesses",
      "Payroll contact person’s name, email and phone",
      "For non‑profits, proof of 501(c)(3) status"
    ],
    "filing_methods": [
      "Register for an Oklahoma unemployment account online using the EZ Tax Express portal (create a user ID and submit a status report) or mail a paper OESC Employer Registration form",
      "Register for a withholding tax account online through the Oklahoma Tax Commission’s Taxpayer Access Point (OTAP) or submit Form BT‑190 with the Commission",
      "After registration, file quarterly contribution reports and wage reports electronically via EZ Tax Express and file withholding tax returns via OTAP."
    ],
    "confirmation_proof": "The Oklahoma Employment Security Commission sends an Employer Account Number and tax rate notice upon completion of the status report; the Oklahoma Tax Commission issues a withholding account number and deposit schedule after registration.",
    "contacts": {
      "phone": "405‑557‑7100 (OESC main), 405‑557‑5452 (EZ Tax Express help desk), 405‑521‑3160 (Oklahoma Tax Commission Taxpayer Assistance)",
      "email": null
    },
    "last_verified_date": "2026-02-05",
    "source_notes": "The Oklahoma EZ Tax Express page explains that employers must report wages and pay unemployment insurance taxes when they have employment in 20 weeks or pay $1,500 in wages in a quarter; it notes additional thresholds for agricultural and domestic employers and nonprofits and lists contact numbers【144351340753837†L31-L45】【144351340753837†L57-L79】. The GoCo payroll tax guide states that employers must register with the Oklahoma Tax Commission via the Taxpayer Access Point for withholding and with the OESC for unemployment, provides required information and notes that account numbers are issued within a few business days【241789649166329†L117-L137】.",
    "rules": {
      "status": "complete",
      "ui_liability": {
        "general": {
          "wage_threshold": {
            "amount": 1500.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "min_employees": 1,
            "unit": "weeks_in_year",
            "weeks": 20
          }
        },
        "domestic": {
          "wage_threshold": {
            "amount": 1000.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "min_employees": null,
            "unit": null,
            "weeks": null
          }
        },
        "agricultural": {
          "wage_threshold": {
            "amount": 20000.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "min_employees": 10,
            "unit": "weeks_in_year",
            "weeks": 20
          }
        },
        "nonprofit": {
          "wage_threshold": {
            "amount": null,
            "period": null
          },
          "weeks_threshold": {
            "min_employees": 4,
            "unit": "weeks_in_year",
            "weeks": 20
          }
        },
        "notes": [
          "Employers subject to FUTA or who succeed liable employers are covered."
        ]
      },
      "withholding": {
        "required_from_first_payroll": true,
        "notes": []
      }
    }
  },
  {
    "state_code": "OR",
    "state_name": "Oregon",
    "agency_name": "Oregon Employment Department and Oregon Department of Revenue",
    "registration_portal_url": "https://revenueonline.dor.oregon.gov",
    "ui_wage_threshold_text": "A non‑agricultural employer becomes subject to Oregon unemployment tax when total payroll reaches $1,000 or more in any calendar quarter or when the employer has one or more employees in each of 18 separate weeks within a year. Agricultural employers become subject when they pay $20,000 or more in cash wages in a quarter or when they employ 10 or more workers for some part of a day in each of 20 weeks in a year. Domestic employers are subject when they pay $1,000 or more in cash wages in a quarter.",
    "ui_threshold_weeks_text": "18 separate weeks with at least one employee for non‑agricultural employers; 20 weeks with 10 or more employees for agricultural employers; 20 weeks with four or more employees for nonprofit 501(c)(3) organizations; there is no weeks test for domestic employers.",
    "withholding_registration_required": true,
    "withholding_threshold_description": "Oregon requires employers to register for a Business Identification Number (BIN) and withhold state income tax on all wages paid to employees; there is no wage threshold. Employers must register before issuing paychecks.",
    "typical_processing_time": "Online registration for a Business Identification Number through Revenue Online typically takes around 30 business days; submitting the paper Combined Employer Registration form by mail can take 60 days. The Employment Department issues the unemployment account number after processing the Combined Employer Registration.",
    "required_information": [
      "Federal Employer Identification Number (FEIN)",
      "Legal business name and trade name (DBA)",
      "Business mailing and physical addresses, phone number and email",
      "Type of ownership and date and state of formation",
      "Date employees were or will be first paid in Oregon and date payroll will exceed $1,000 in a quarter (or $20,000 for agricultural labor)",
      "Estimated number of employees and quarterly payroll",
      "North American Industry Classification System (NAICS) code and detailed description of business activity",
      "Names, titles, Social Security numbers and addresses of all owners, partners, members or corporate officers",
      "Banking information and payroll contact person",
      "Acquisition or successor information",
      "For nonprofit entities, copy of the 501(c)(3) exemption"
    ],
    "filing_methods": [
      "Complete the Combined Employer Registration form (OR‑CER) online via Oregon’s Revenue Online system to obtain a Business Identification Number and unemployment account number",
      "Mail the paper Combined Employer Registration to the Oregon Department of Revenue if not registering online",
      "Use Oregon’s I‑Tax/OTTER or OED Employer Login to submit quarterly wage reports and unemployment contributions",
      "File withholding returns and pay taxes electronically using the Revenue Online portal."
    ],
    "confirmation_proof": "After registration, the Oregon Employment Department sends an employer account number and state unemployment tax rate notice; the Department of Revenue sends a Business Identification Number and confirmation letter.",
    "contacts": {
      "phone": "503‑947‑1488 (Oregon Employment Department UI tax information), 503‑945‑8091 or 503‑378‑4988 (Oregon Department of Revenue payroll tax assistance)",
      "email": null
    },
    "last_verified_date": "2026-02-05",
    "source_notes": "The Oregon Employer’s Guide explains that general employers are subject to unemployment tax when they pay $1,000 or more in a quarter or employ workers in 18 separate weeks; agricultural employers are subject when they pay $20,000 or more or employ 10 workers in 20 weeks; domestic employers are subject when they pay $1,000 or more in cash wages【538434974599010†L633-L646】. The Combined Employer Registration form lists required information such as FEIN, legal name, NAICS code, addresses, owners’ Social Security numbers, and dates of first payroll【413868984517124†L15-L79】. The Department of Revenue’s withholding and payroll tax page states that employers must register for a Business Identification Number before paying wages, that online registrations take 30 business days, and that paper submissions can take 60 days【902914791521361†L51-L60】. The Employer’s Guide emphasises that withholding must be deducted from all wages and provides telephone numbers for assistance【940578917330614†L64-L70】. The U.S. Department of Labor contact list provides UI tax assistance numbers【48761910951811†L348-L357】.",
    "rules": {
      "status": "complete",
      "ui_liability": {
        "general": {
          "wage_threshold": {
            "amount": 1000.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "min_employees": 1,
            "unit": "weeks_in_year",
            "weeks": 18
          }
        },
        "domestic": {
          "wage_threshold": {
            "amount": 1000.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "min_employees": null,
            "unit": null,
            "weeks": null
          }
        },
        "agricultural": {
          "wage_threshold": {
            "amount": 20000.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "min_employees": 10,
            "unit": "weeks_in_year",
            "weeks": 20
          }
        },
        "nonprofit": {
          "wage_threshold": {
            "amount": null,
            "period": null
          },
          "weeks_threshold": {
            "min_employees": 4,
            "unit": "weeks_in_year",
            "weeks": 20
          }
        },
        "notes": []
      },
      "withholding": {
        "required_from_first_payroll": true,
        "notes": []
      }
    }
  },
  {
    "state_code": "PA",
    "state_name": "Pennsylvania",
    "agency_name": "Pennsylvania Department of Labor & Industry (Office of Unemployment Compensation Tax Services) and Pennsylvania Department of Revenue",
    "registration_portal_url": "https://www.uctax.pa.gov and https://mypath.pa.gov",
    "ui_wage_threshold_text": "In Pennsylvania any employer who pays wages to employees must register for unemployment compensation; there is no minimum payroll or weeks threshold. Employers are covered as soon as wages are paid, and employers subject to FUTA are automatically liable. Domestic employers become liable when they pay $1,000 or more in cash wages in a quarter; agricultural employers are liable when they pay $20,000 or more in wages in a quarter or employ at least 10 workers in 20 weeks; nonprofit employers become liable when they employ four or more workers for 20 weeks.",
    "ui_threshold_weeks_text": "There is no weeks test for general employers (coverage begins as soon as wages are paid); agricultural employers have a 20‑week test requiring 10 workers; 501(c)(3) nonprofits become liable when they employ four or more workers for 20 weeks.",
    "withholding_registration_required": true,
    "withholding_threshold_description": "Employers must register for employer withholding via Pennsylvania’s myPATH system and withhold personal income tax on wages paid to resident employees and nonresident employees working in Pennsylvania; there is no minimum wage threshold.",
    "typical_processing_time": "After completing the online registration through myPATH and the UC Employer Portal, employers typically receive their Pennsylvania employer account numbers within a few weeks (generally two to four weeks) by mail.",
    "required_information": [
      "Federal Employer Identification Number (FEIN)",
      "Legal business name and trade name",
      "Physical and mailing addresses and phone number",
      "Type of legal entity and date of incorporation or formation",
      "Date employees were first hired and date first wages were paid in Pennsylvania",
      "Estimated number of employees and quarterly wages",
      "Names, titles, Social Security numbers and addresses of owners, partners, members or corporate officers",
      "Business activity and NAICS code",
      "Whether the business acquired another Pennsylvania employer or changed ownership",
      "Payroll contact person and email address",
      "Banking information for electronic payments"
    ],
    "filing_methods": [
      "Register online through the Pennsylvania Office of Unemployment Compensation Tax Services (UCMS) or Employer UC Services for You (e‑Services) to obtain a UC account number",
      "Register via the Pennsylvania Department of Revenue’s myPATH portal for employer withholding and other taxes",
      "Submit paper Forms PA‑100 or UC‑1608N if online registration is not possible",
      "File quarterly contribution and wage reports electronically and remit withholding tax through myPATH"
    ],
    "confirmation_proof": "Employers receive a Pennsylvania Unemployment Compensation employer account number and contribution rate notice from the Department of Labor & Industry and a withholding account number and deposit schedule from the Department of Revenue.",
    "contacts": {
      "phone": "717‑787‑7679 (Office of Unemployment Compensation Tax Services), 717‑787‑1064 (Department of Revenue Customer Experience Center)",
      "email": null
    },
    "last_verified_date": "2026-02-05",
    "source_notes": "The U.S. Department of Labor’s comparative table shows that Pennsylvania does not impose a minimum payroll or weeks threshold for employer coverage; employers become liable as soon as wages are paid【157654199418392†L178-L180】. Additional sources note that employers should register when they pay $1,500 in wages or have an employee for 20 weeks, but the threshold is effectively any wage payment【314840177766826†L72-L91】. The Department of Revenue’s Employer Withholding Information guide explains that employers register for withholding through myPATH and must withhold Pennsylvania personal income tax from wages【258570377914066†L96-L104】.",
    "rules": {
      "status": "complete",
      "ui_liability": {
        "general": {
          "wage_threshold": {
            "amount": null,
            "period": null
          },
          "weeks_threshold": {
            "min_employees": null,
            "unit": null,
            "weeks": null
          }
        },
        "domestic": {
          "wage_threshold": {
            "amount": 1000.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "min_employees": null,
            "unit": null,
            "weeks": null
          }
        },
        "agricultural": {
          "wage_threshold": {
            "amount": 20000.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "min_employees": 10,
            "unit": "weeks_in_year",
            "weeks": 20
          }
        },
        "nonprofit": {
          "wage_threshold": {
            "amount": null,
            "period": null
          },
          "weeks_threshold": {
            "min_employees": 4,
            "unit": "weeks_in_year",
            "weeks": 20
          }
        },
        "notes": []
      },
      "withholding": {
        "required_from_first_payroll": true,
        "notes": []
      }
    }
  },
  {
    "state_code": "RI",
    "state_name": "Rhode Island",
    "agency_name": "Rhode Island Department of Labor and Training (DLT) and Rhode Island Division of Taxation",
    "registration_portal_url": "https://tax.ri.gov/online-business-registration",
    "ui_wage_threshold_text": "With few exceptions, employers of one or more workers in Rhode Island are subject to the Employment Security Act and must contribute to the unemployment insurance and temporary disability insurance programs. Domestic employers become liable when they pay $1,000 or more in cash wages in any calendar quarter. Agricultural labor is covered regardless of wages. 501(c)(3) nonprofit organizations become liable when they have four or more workers.",
    "ui_threshold_weeks_text": "General employers are covered immediately upon having employees; there is no weeks test. Nonprofit employers become liable when they employ four or more workers for some portion of a day in 20 weeks.",
    "withholding_registration_required": true,
    "withholding_threshold_description": "Rhode Island requires employers to withhold state income tax from wages paid to employees; there is no minimum threshold, and employers register for withholding through the combined online registration system or by filing a Business Application and Registration (BAR) form.",
    "typical_processing_time": "Once the determination of tax liability is filed, the Department assigns a Rhode Island employer registration number and sends a Registration Certificate and Notice to Employees (Form TX‑6). According to the Business Application and Registration instructions, unemployment accounts are set up within 90 days of the liability date or the first wages paid.",
    "required_information": [
      "Federal Employer Identification Number (FEIN) or Social Security number",
      "Legal business name and trade name (DBA)",
      "Mailing and physical addresses and contact phone",
      "Type of entity and state/date of incorporation or formation",
      "Rhode Island work location(s) and expected number of employees",
      "Names, titles, Social Security numbers and addresses of owners, partners, or corporate officers",
      "Estimated quarterly payroll and first date wages were paid in Rhode Island",
      "Contact person for payroll, sales tax and unemployment matters (name, phone, email)",
      "Business activity and NAICS code",
      "For nonprofits, copy of IRS determination letter (501(c)(3))."
    ],
    "filing_methods": [
      "Register online through the Rhode Island Division of Taxation’s combined Online Business Registration system to obtain income tax withholding and unemployment insurance accounts",
      "Submit the paper Business Application and Registration (BAR) form to the Division of Taxation for combined registration if online filing is not possible",
      "Employers also file a Determination of Tax Liability with the Department of Labor & Training to determine whether they are subject to unemployment insurance."
    ],
    "confirmation_proof": "The Division of Taxation issues a Rhode Island employer identification number upon registration and sends a Registration Certificate (TX‑6) and Notice to Employees; the Department of Labor & Training assigns an unemployment insurance account number and contribution rate after liability is determined.",
    "contacts": {
      "phone": "401‑574‑8700 (DLT Employer Tax Section), 401‑574‑8938 (Division of Taxation Registration Section)",
      "email": null
    },
    "last_verified_date": "2026-02-05",
    "source_notes": "The Rhode Island Employer Handbook states that, with few exceptions, employers of one or more workers are subject to the Employment Security and Temporary Disability Insurance Acts; domestic employers become subject at $1,000 of cash wages per quarter and new employers must submit a determination of tax liability to the Department of Labor & Training, which issues a registration certificate and notice【201101578072636†L148-L275】. The online Employer Registration page from the Division of Taxation explains that employers can register for income tax withholding and unemployment insurance simultaneously and provides contact phone numbers【743889285801067†L21-L49】. The Business Application and Registration form notes that the unemployment account will be set up within 90 days of the liability date or first wages paid and lists required information【171686917132981†L168-L174】.",
    "rules": {
      "status": "complete",
      "ui_liability": {
        "general": {
          "wage_threshold": {
            "amount": null,
            "period": null
          },
          "weeks_threshold": {
            "min_employees": null,
            "unit": null,
            "weeks": null
          }
        },
        "domestic": {
          "wage_threshold": {
            "amount": 1000.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "min_employees": null,
            "unit": null,
            "weeks": null
          }
        },
        "agricultural": {
          "wage_threshold": {
            "amount": null,
            "period": null
          },
          "weeks_threshold": {
            "min_employees": null,
            "unit": null,
            "weeks": null
          }
        },
        "nonprofit": {
          "wage_threshold": {
            "amount": null,
            "period": null
          },
          "weeks_threshold": {
            "min_employees": 4,
            "unit": "weeks_in_year",
            "weeks": 20
          }
        },
        "notes": []
      },
      "withholding": {
        "required_from_first_payroll": true,
        "notes": []
      }
    }
  },
  {
    "state_code": "SC",
    "state_name": "South Carolina",
    "agency_name": "South Carolina Department of Employment and Workforce (DEW) and South Carolina Department of Revenue",
    "registration_portal_url": "https://dew.sc.gov/suits and https://mydorway.dor.sc.gov/_/",
    "ui_wage_threshold_text": "A business becomes liable for South Carolina unemployment tax contributions when it pays $1,500 or more in wages in a calendar quarter or has at least one employee during any part of 20 weeks in a calendar year. Agricultural employers are liable when they pay $20,000 or more in wages in a quarter or employ 10 or more workers in agricultural labor for a day in 20 weeks. Domestic employers become liable when they pay $1,000 or more in cash wages in a quarter. Non‑profit employers with 501(c)(3) status become liable when they employ four or more individuals during 20 weeks.",
    "ui_threshold_weeks_text": "20 weeks with at least one employee for general employers; 20 weeks with 10 or more workers for agricultural employers; 20 weeks with four or more workers for non‑profit employers.",
    "withholding_registration_required": true,
    "withholding_threshold_description": "South Carolina employers must register for a withholding file number and withhold state income tax from employees’ wages whenever federal withholding applies; there is no minimum wage threshold.",
    "typical_processing_time": "When registering online via MyDORWAY, the Department of Revenue issues the withholding file number and deposit schedule within 24 hours; paper applications may take up to three weeks. The Department of Employment and Workforce assigns the unemployment account number via the SUITS portal in approximately two to three weeks.",
    "required_information": [
      "Federal Employer Identification Number (FEIN)",
      "Legal business name and trade name",
      "Physical and mailing addresses",
      "Type of business entity and date formed",
      "Date employees first worked in South Carolina and date first wages were paid",
      "Quarterly wages and number of employees",
      "Names, titles, Social Security numbers and addresses of owners, partners, members or corporate officers",
      "Business activity and NAICS code",
      "Email address and phone number of payroll contact",
      "Information on any predecessor businesses or acquisitions",
      "For nonprofits, documentation of 501(c)(3) status."
    ],
    "filing_methods": [
      "Register for unemployment insurance online through the South Carolina Department of Employment and Workforce’s SUITS portal or submit a paper Employer Status Report",
      "Register for a withholding file number via the South Carolina Department of Revenue’s MyDORWAY Business Tax Application or mail Form WH‑1601",
      "File quarterly contribution and wage reports electronically through SUITS and remit withholding tax and returns through MyDORWAY or by mail."
    ],
    "confirmation_proof": "The Department of Employment and Workforce issues an unemployment insurance employer account number and tax rate letter upon approval. The Department of Revenue sends a South Carolina withholding file number and deposit schedule once registration is processed.",
    "contacts": {
      "phone": "866‑831‑1724 (DEW Employer Status Section), 803‑898‑5000 (Department of Revenue)",
      "email": "withholdtax@dor.sc.gov"
    },
    "last_verified_date": "2026-02-05",
    "source_notes": "The South Carolina Department of Employment and Workforce’s Employer Resources page states that employers are liable for unemployment tax when they pay $1,500 or more in wages in a quarter or have at least one employee during 20 weeks; it lists additional thresholds for domestic ($1,000 in cash wages), agricultural ($20,000 or 10 workers), and non‑profits (four workers) and provides the Employer Status Section contact number【281459519241236†L249-L259】【281459519241236†L331-L334】【281459519241236†L309-L310】. A Justworks article explains that the South Carolina Department of Revenue issues the withholding file number within 24 hours of online registration or up to three weeks by mail and that the Department of Employment and Workforce assigns the unemployment account number in two to three weeks【772275452684993†L46-L99】.",
    "rules": {
      "status": "complete",
      "ui_liability": {
        "general": {
          "wage_threshold": {
            "amount": 1500.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "min_employees": 1,
            "unit": "weeks_in_year",
            "weeks": 20
          }
        },
        "domestic": {
          "wage_threshold": {
            "amount": 1000.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "min_employees": null,
            "unit": null,
            "weeks": null
          }
        },
        "agricultural": {
          "wage_threshold": {
            "amount": 20000.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "min_employees": 10,
            "unit": "weeks_in_year",
            "weeks": 20
          }
        },
        "nonprofit": {
          "wage_threshold": {
            "amount": null,
            "period": null
          },
          "weeks_threshold": {
            "min_employees": 4,
            "unit": "weeks_in_year",
            "weeks": 20
          }
        },
        "notes": []
      },
      "withholding": {
        "required_from_first_payroll": true,
        "notes": []
      }
    }
  },
  {
    "state_code": "SD",
    "state_name": "South Dakota",
    "agency_name": "South Dakota Department of Labor & Regulation – Reemployment Assistance Division",
    "registration_portal_url": "https://reconnect.sd.gov/employer",
    "ui_wage_threshold_text": "South Dakota employers must register for reemployment assistance when they pay $1,500 or more in wages in a calendar quarter or employ at least one worker for some part of a day in each of 20 different weeks during a calendar year. Non‑profit organizations must register when they have employees for 20 weeks; there is no wage threshold for nonprofits. Employers who acquire or succeed a liable business must register within 30 days. Agricultural employers are liable when they pay $20,000 or more in wages in a quarter or have 10 or more workers for 20 weeks. Domestic employers become liable when they pay $1,000 in cash wages in a quarter.",
    "ui_threshold_weeks_text": "20 different weeks with one or more employees for general employers; 20 weeks with 10 or more workers for agricultural employers; 20 weeks for non‑profit organizations with four or more workers.",
    "withholding_registration_required": false,
    "withholding_threshold_description": "South Dakota does not levy a state income tax; employers are not required to register for or withhold state income tax.",
    "typical_processing_time": "Employers can register online or by mail; account numbers are generally assigned within a few business days when registering online and may take longer by mail.",
    "required_information": [
      "Federal Employer Identification Number (FEIN)",
      "Legal business name and trade name",
      "Physical and mailing addresses and phone",
      "Date employees first performed services in South Dakota and date first wages were paid",
      "Estimated quarterly payroll and number of employees",
      "Names, titles, Social Security numbers and addresses of owners, partners, members or corporate officers",
      "Business activity and NAICS code",
      "Information on predecessor business or acquisition",
      "Payroll contact person and email",
      "Whether the employer is a non‑profit, government, agricultural or domestic employer."
    ],
    "filing_methods": [
      "Register online through the South Dakota Reemployment Assistance Employer Portal or submit the Employer's Application for Reemployment Assistance Account (Form UI‑1) by mail",
      "Once registered, file quarterly wage reports and remit contributions electronically or by mail using forms provided by the Department."
    ],
    "confirmation_proof": "The South Dakota Department of Labor & Regulation issues a Reemployment Assistance account number and contribution rate notice once registration is approved.",
    "contacts": {
      "phone": "605‑626‑2312 (Reemployment Assistance Employer Registration)",
      "email": null
    },
    "last_verified_date": "2026-02-05",
    "source_notes": "A GoCo payroll tax guide explains that South Dakota employers must register for reemployment assistance when they pay $1,500 in wages in a quarter or employ a worker for 20 separate weeks; non‑profits register after 20 weeks and there is no state income tax【188797999901365†L88-L97】. The same guide notes that registration can be completed online or via paper forms and emphasises that successor employers must register within 30 days【188797999901365†L88-L97】.",
    "rules": {
      "status": "complete",
      "ui_liability": {
        "general": {
          "wage_threshold": {
            "amount": 1500.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "min_employees": 1,
            "unit": "weeks_in_year",
            "weeks": 20
          }
        },
        "domestic": {
          "wage_threshold": {
            "amount": 1000.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "min_employees": null,
            "unit": null,
            "weeks": null
          }
        },
        "agricultural": {
          "wage_threshold": {
            "amount": 20000.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "min_employees": 10,
            "unit": "weeks_in_year",
            "weeks": 20
          }
        },
        "nonprofit": {
          "wage_threshold": {
            "amount": null,
            "period": null
          },
          "weeks_threshold": {
            "min_employees": 4,
            "unit": "weeks_in_year",
            "weeks": 20
          }
        },
        "notes": [
          "Non‑profit employers register after 20 weeks regardless of wages."
        ]
      },
      "withholding": {
        "required_from_first_payroll": false,
        "notes": []
      }
    }
  },
  {
    "state_code": "TN",
    "state_name": "Tennessee",
    "agency_name": "Tennessee Department of Labor and Workforce Development – Division of Employment Security",
    "registration_portal_url": "https://apps.tn.gov/employer",
    "ui_wage_threshold_text": "Employers become liable for Tennessee unemployment insurance premiums if they pay total wages of $1,500 or more in any calendar quarter or employ one or more persons during some part of a day in each of 20 different weeks during the current or preceding calendar year. Employers who succeed a liable employer or who are subject to FUTA are also liable. Agricultural employers are liable when they pay $20,000 or more in wages in a calendar quarter or employ 10 or more persons in agricultural labor for 20 weeks. Domestic employers are liable when they pay $1,000 in cash wages in a quarter. Non‑profit employers with 501(c)(3) status are liable when they employ four or more workers for part of a day in 20 weeks.",
    "ui_threshold_weeks_text": "20 different weeks with one or more employees for general employers; 20 weeks with 10 or more workers for agricultural employers; 20 weeks with four or more employees for 501(c)(3) nonprofits.",
    "withholding_registration_required": false,
    "withholding_threshold_description": "Tennessee does not impose a state income tax on wages; therefore employers are not required to register for or withhold state income tax.",
    "typical_processing_time": "Employers must apply for an employer account number as soon as they meet liability conditions; the Department of Labor and Workforce Development usually issues the unemployment account number within a few business days after the application is filed.",
    "required_information": [
      "Federal Employer Identification Number (FEIN)",
      "Legal business name and trade name",
      "Physical and mailing addresses and phone number",
      "Type of ownership and date of formation",
      "Date employees first performed services and date first wages were paid in Tennessee",
      "Total payroll for the quarter and number of employees",
      "Names, titles, Social Security numbers and addresses of owners, partners, members or corporate officers",
      "Business activity and NAICS code",
      "Information about acquisitions or successor relationships",
      "Whether the business is agricultural, domestic, or nonprofit",
      "Payroll contact person and email"
    ],
    "filing_methods": [
      "Register online through the Tennessee Department of Labor Employer Services portal or file the Employer’s Application for Account Number (Form LB‑0441) by mail",
      "File quarterly wage and premium reports electronically through TNPAWS or by mail after registration."
    ],
    "confirmation_proof": "The Tennessee Department of Labor and Workforce Development issues an Employer Account Number and contribution rate notice upon approval of the registration.",
    "contacts": {
      "phone": "1‑800‑344‑8337 (Employer Accounts Office), 615‑741‑2346 (out‑of‑state)",
      "email": null
    },
    "last_verified_date": "2026-02-05",
    "source_notes": "The Tennessee Employer Handbook explains that an employer becomes liable if it pays $1,500 or more in total payroll in any calendar quarter or employs one or more persons for some part of a day in 20 weeks; the same section notes that agricultural employers are liable if they pay $20,000 or more in wages or employ 10 or more workers, that domestic employers are liable at $1,000 in cash wages, and that nonprofits with 4 employees for 20 weeks are covered【924893968000194†L1238-L1276】. Earlier sections of the handbook provide toll‑free and out‑of‑state contact numbers for employer accounts【924893968000194†L44-L47】. Tennessee has no state income tax, so employers are not required to register for withholding【530496491059370†L14-L23】.",
    "rules": {
      "status": "complete",
      "ui_liability": {
        "general": {
          "wage_threshold": {
            "amount": 1500.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "min_employees": 1,
            "unit": "weeks_in_year",
            "weeks": 20
          }
        },
        "domestic": {
          "wage_threshold": {
            "amount": 1000.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "min_employees": null,
            "unit": null,
            "weeks": null
          }
        },
        "agricultural": {
          "wage_threshold": {
            "amount": 20000.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "min_employees": 10,
            "unit": "weeks_in_year",
            "weeks": 20
          }
        },
        "nonprofit": {
          "wage_threshold": {
            "amount": null,
            "period": null
          },
          "weeks_threshold": {
            "min_employees": 4,
            "unit": "weeks_in_year",
            "weeks": 20
          }
        },
        "notes": []
      },
      "withholding": {
        "required_from_first_payroll": false,
        "notes": []
      }
    }
  },
  {
    "state_code": "TX",
    "state_name": "Texas",
    "agency_name": "Texas Workforce Commission (TWC)",
    "registration_portal_url": "https://twc.texas.gov/businesses/unemployment-tax-registration",
    "ui_wage_threshold_text": "$1,500 in total gross wages in a calendar quarter or one employee working in 20 different weeks in a calendar year; domestic employers become liable at $1,000 in wages and agricultural employers become liable when they pay $6,250 in wages in a quarter or have three or more workers for 20 weeks",
    "ui_threshold_weeks_text": "20 different weeks with at least one employee (general employment)",
    "withholding_registration_required": false,
    "withholding_threshold_description": "Texas does not have a state income tax, so no state wage‑withholding account is required for employees",
    "typical_processing_time": "Account numbers are issued immediately when registering online; paper Form C‑1 filings take longer",
    "required_information": [
      "Business contact email address",
      "Date of first Texas hire and first wages paid",
      "Total gross wages for the first quarter of employment",
      "Name, Social Security number and address for each owner, partner or corporate officer",
      "Current U.S. mailing address and physical location of each business site",
      "Trade name (DBA) for each business location",
      "Description of principal business activities",
      "Information on any acquisition of a prior business (name, address and employer account number of predecessor)"
    ],
    "filing_methods": [
      "Online via Unemployment Tax Registration (UTR)",
      "Paper Employer Status Report (Form C‑1) if unable to file online"
    ],
    "confirmation_proof": "Immediate assignment of a TWC unemployment tax account number and confirmation letter",
    "contacts": {
      "phone": "866-274-1722",
      "email": null
    },
    "last_verified_date": "2025-11-01",
    "source_notes": "TWC liability criteria and registration information",
    "rules": {
      "status": "complete",
      "ui_liability": {
        "general": {
          "wage_threshold": {
            "amount": 1500.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "weeks": 20,
            "unit": "weeks_in_year",
            "min_employees": 1
          }
        },
        "domestic": {
          "wage_threshold": {
            "amount": 1000.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "weeks": null,
            "unit": null,
            "min_employees": null
          }
        },
        "agricultural": {
          "wage_threshold": {
            "amount": 6250.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "weeks": 20,
            "unit": "weeks_in_year",
            "min_employees": 3
          }
        },
        "nonprofit": {
          "wage_threshold": {
            "amount": null,
            "period": null
          },
          "weeks_threshold": {
            "weeks": null,
            "unit": null,
            "min_employees": null
          }
        },
        "notes": []
      },
      "withholding": {
        "required_from_first_payroll": false,
        "notes": [
          "Texas has no state income tax"
        ]
      },
      "todo": []
    }
  },
  {
    "state_code": "UT",
    "state_name": "Utah",
    "agency_name": "Utah Department of Workforce Services and Utah State Tax Commission",
    "registration_portal_url": "https://tap.tax.utah.gov",
    "ui_wage_threshold_text": "Under Utah’s Employment Security Act, any employer who pays wages to one or more individuals in covered employment is liable for unemployment taxes; there is no minimum wage amount. Employers are considered liable if they employ one or more individuals for some portion of a day in each of 20 different weeks during a calendar year or become liable under the Federal Unemployment Tax Act. Agricultural employers are liable when they pay $20,000 or more in cash wages in a quarter or employ 10 or more workers in agricultural labor for 20 weeks. Domestic employers are liable when they pay $1,000 or more in cash wages in a quarter.",
    "ui_threshold_weeks_text": "20 different weeks with one or more workers for general employers; 20 weeks with 10 or more workers for agricultural employers; 20 weeks with four or more employees for 501(c)(3) nonprofits.",
    "withholding_registration_required": true,
    "withholding_threshold_description": "Employers must register with the Utah State Tax Commission and the Department of Workforce Services to withhold Utah income tax from employees’ wages; there is no minimum wage threshold. Employers must register within 30 days of paying wages in Utah; an exemption applies if the employer operated in Utah for 60 days or less in a calendar year.",
    "typical_processing_time": "Utah’s Taxpayer Access Point allows employers to register for both payroll tax withholding and unemployment insurance accounts in a single online process; account numbers for withholding and unemployment insurance are typically issued immediately after submission.",
    "required_information": [
      "Federal Employer Identification Number (FEIN)",
      "Legal business name and trade name",
      "Physical and mailing addresses and phone number",
      "Type of business entity and date of formation",
      "Date employees first worked in Utah and date first wages were or will be paid",
      "Estimated quarterly payroll and number of employees in Utah",
      "Names, titles, Social Security numbers and addresses of all owners, partners, members or corporate officers",
      "Business activity and NAICS code",
      "Whether the employer is agricultural, domestic, or nonprofit and any federal FUTA liability",
      "Payroll contact person and email address."
    ],
    "filing_methods": [
      "Register online through the Utah Taxpayer Access Point (TAP) to obtain both a withholding tax account and an unemployment insurance account",
      "File quarterly wage and contribution reports through the Department of Workforce Services’ Employer Portal (jobs.utah.gov)",
      "Submit paper registration forms if online filing is not available."
    ],
    "confirmation_proof": "After registration through TAP, the employer receives both a Utah withholding account number and an Unemployment Insurance Employer Registration Number (employer account number) along with a notice of the assigned tax rate.",
    "contacts": {
      "phone": "801‑526‑9400 (Department of Workforce Services Employer Accounts), 801‑297‑2200 (Utah State Tax Commission general information)",
      "email": null
    },
    "last_verified_date": "2026-02-05",
    "source_notes": "The Utah UI Employer training publication lists the coverage criteria: any employer who has employed one or more individuals for some portion of a day in each of 20 different weeks, agricultural employers who pay $20,000 or more or have 10 or more workers, domestic employers who pay $1,000 in wages, and employers subject to FUTA【856378681411930†L79-L94】. A GoCo payroll tax guide states that employers paying wages in Utah must register with both the State Tax Commission and the Department of Workforce Services, regardless of wage amount, and that account numbers are issued through the Taxpayer Access Point【601780587843100†L45-L112】.",
    "rules": {
      "status": "complete",
      "ui_liability": {
        "general": {
          "wage_threshold": {
            "amount": null,
            "period": null
          },
          "weeks_threshold": {
            "min_employees": 1,
            "unit": "weeks_in_year",
            "weeks": 20
          }
        },
        "domestic": {
          "wage_threshold": {
            "amount": 1000.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "min_employees": null,
            "unit": null,
            "weeks": null
          }
        },
        "agricultural": {
          "wage_threshold": {
            "amount": 20000.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "min_employees": 10,
            "unit": "weeks_in_year",
            "weeks": 20
          }
        },
        "nonprofit": {
          "wage_threshold": {
            "amount": null,
            "period": null
          },
          "weeks_threshold": {
            "min_employees": 4,
            "unit": "weeks_in_year",
            "weeks": 20
          }
        },
        "notes": []
      },
      "withholding": {
        "required_from_first_payroll": true,
        "notes": [
          "Employers operating in Utah for 60 days or less may not be required to register."
        ]
      }
    }
  },
  {
    "state_code": "VT",
    "state_name": "Vermont",
    "agency_name": "Vermont Department of Labor (VDOL) and Vermont Department of Taxes",
    "registration_portal_url": "https://labor.vermont.gov/myUIEmployer and https://myvtax.vermont.gov",
    "ui_wage_threshold_text": "According to the U.S. Department of Labor’s comparative analysis of unemployment laws, Vermont’s definition of employer does not include a minimum payroll or weeks threshold; employers become liable for unemployment insurance contributions as soon as they pay wages. Agricultural labor coverage follows the federal FUTA thresholds: employers are liable if they pay $20,000 or more in wages in a quarter or employ 10 or more workers for some part of a day in 20 weeks. Domestic employers become liable when they pay $1,000 or more in cash wages in a quarter. 501(c)(3) nonprofit employers become liable when they employ four or more workers for some part of 20 weeks.",
    "ui_threshold_weeks_text": "There is no weeks test for general employers (coverage begins when wages are paid); agricultural employers have a 20‑week test requiring 10 workers; non‑profit employers become liable when they employ four or more workers in 20 weeks.",
    "withholding_registration_required": true,
    "withholding_threshold_description": "Employers must register for a Vermont income tax withholding account through myVTax and withhold state income tax from wages paid to Vermont residents and nonresidents working in Vermont; registration is required when wages are first paid (no minimum threshold).",
    "typical_processing_time": "Registration for unemployment and withholding via the Vermont Department of Labor and Department of Taxes online systems typically provides account numbers within a few business days; paper applications may take longer.",
    "required_information": [
      "Federal Employer Identification Number (FEIN) or Social Security number",
      "Legal business name and trade name",
      "Physical and mailing addresses",
      "Type of legal entity and date formed",
      "Date employees first performed services in Vermont and date first wages were paid",
      "Estimated number of employees and quarterly payroll",
      "Names, titles, Social Security numbers and addresses of owners, partners, members or corporate officers",
      "Business activity and NAICS code",
      "Information on prior Vermont employer account numbers or predecessor businesses",
      "Contact person and email/phone"
    ],
    "filing_methods": [
      "Register online for unemployment insurance through the Vermont Department of Labor’s myUI Employer portal; employers may mail paper registration forms if necessary",
      "Register for a Vermont withholding tax account via the Department of Taxes’ myVTax portal or by mail",
      "After registration, file quarterly wage and contribution reports electronically through the myUI Employer portal and file withholding returns through myVTax."
    ],
    "confirmation_proof": "The Vermont Department of Labor sends an Employer Account Number and contribution rate notice for unemployment insurance; the Department of Taxes issues a Vermont Account Number and deposit schedule for withholding.",
    "contacts": {
      "phone": "802‑828‑4252 (Vermont Department of Labor, Employer Services)",
      "email": null
    },
    "last_verified_date": "2026-02-05",
    "source_notes": "The U.S. Department of Labor comparative analysis of state unemployment insurance laws notes that Vermont does not set a minimum payroll or weeks threshold for employer coverage, meaning coverage applies as soon as wages are paid【157654199418392†L165-L180】. Additional U.S. Department of Labor tables state that agricultural labor is covered when wages reach $20,000 in a quarter or 10 workers for 20 weeks and domestic employers are covered when they pay $1,000 in cash wages【157654199418392†L205-L210】【157654199418392†L328-L331】. State guidance from the Department of Taxes requires employers to register for withholding and withhold Vermont income tax on wages whenever employees are paid.",
    "rules": {
      "status": "complete",
      "ui_liability": {
        "general": {
          "wage_threshold": {
            "amount": null,
            "period": null
          },
          "weeks_threshold": {
            "min_employees": null,
            "unit": null,
            "weeks": null
          }
        },
        "domestic": {
          "wage_threshold": {
            "amount": 1000.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "min_employees": null,
            "unit": null,
            "weeks": null
          }
        },
        "agricultural": {
          "wage_threshold": {
            "amount": 20000.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "min_employees": 10,
            "unit": "weeks_in_year",
            "weeks": 20
          }
        },
        "nonprofit": {
          "wage_threshold": {
            "amount": null,
            "period": null
          },
          "weeks_threshold": {
            "min_employees": 4,
            "unit": "weeks_in_year",
            "weeks": 20
          }
        },
        "notes": []
      },
      "withholding": {
        "required_from_first_payroll": true,
        "notes": []
      }
    }
  },
  {
    "state_code": "VA",
    "state_name": "Virginia",
    "agency_name": "Virginia Employment Commission and Virginia Department of Taxation",
    "registration_portal_url": "https://employer.vec.virginia.gov/vec/login and https://www.tax.virginia.gov/business-online-services",
    "ui_wage_threshold_text": "For‑profit employers are liable for Virginia unemployment tax if they pay wages of $1,500 or more in a calendar quarter or have at least one employee for some part of a day in each of 20 weeks in a calendar year, or if they are subject to the Federal Unemployment Tax Act. Domestic employers are liable when they pay $1,000 or more in cash wages in a quarter. 501(c)(3) non‑profit organizations are liable if they employ four or more individuals in each of 20 weeks; such nonprofits are exempt if they have fewer than four employees. Agricultural employers are covered under the general FUTA thresholds ($20,000 in wages or 10 workers for 20 weeks).",
    "ui_threshold_weeks_text": "20 different weeks with at least one employee for general employers; 20 weeks with 10 or more workers for agricultural employers; 20 weeks with four or more workers for nonprofit employers; no weeks test for domestic employers.",
    "withholding_registration_required": true,
    "withholding_threshold_description": "Employers must register with the Virginia Department of Taxation for an employer withholding tax account and withhold state income tax from wages paid to employees; registration is required from the first payroll if wages are subject to federal withholding.",
    "typical_processing_time": "Employers can register online using the Virginia iReg system and receive a Virginia Employment Commission (VEC) account number immediately; registration with the Department of Taxation through the Business Online Services portal issues a withholding account number and tax payment schedule within a few business days.",
    "required_information": [
      "Federal Employer Identification Number (FEIN)",
      "Legal business name and trade name",
      "Physical and mailing addresses and phone",
      "Type of legal entity and date of formation",
      "Date employees first performed services in Virginia and date first wages were paid",
      "Estimated number of employees and quarterly payroll",
      "Names, titles, Social Security numbers and addresses of all owners, partners, members or corporate officers",
      "Business activity and NAICS code",
      "Information on predecessor or successor businesses",
      "Payroll contact person and email",
      "For nonprofit employers, 501(c)(3) determination letter."
    ],
    "filing_methods": [
      "Register online via the Virginia Employment Commission’s iReg portal to obtain a VEC employer account number for unemployment insurance or complete the VEC‑FC‑27 paper form and mail it to the VEC",
      "Register for a withholding account through the Virginia Department of Taxation’s Business Online Services or by filing Form R‑1",
      "File quarterly contribution and wage reports electronically through iReg and remit withholding tax through the Department of Taxation’s eForms or eFile programs."
    ],
    "confirmation_proof": "The Virginia Employment Commission provides an employer account number and tax rate immediately after iReg registration; the Department of Taxation sends a Virginia employer withholding account number and deposit schedule after processing.",
    "contacts": {
      "phone": "804‑786‑3061 (VEC Employer Tax Unit), 804‑367‑8037 (Department of Taxation business registration)",
      "email": null
    },
    "last_verified_date": "2026-02-05",
    "source_notes": "The Virginia Employment Commission’s Employer UI Tax FAQ states that employers are liable for unemployment tax if they have a quarterly payroll of $1,500 or more or have an employee for 20 weeks; domestic employers are liable at $1,000 in cash wages; 501(c)(3) nonprofits are exempt if they have fewer than four employees and become liable at four employees【580301483809527†L63-L74】【580301483809527†L82-L90】【580301483809527†L103-L110】. The FAQ notes that employers can register via iReg and receive a VEC account number immediately. Agricultural thresholds follow the federal standard.",
    "rules": {
      "status": "complete",
      "ui_liability": {
        "general": {
          "wage_threshold": {
            "amount": 1500.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "min_employees": 1,
            "unit": "weeks_in_year",
            "weeks": 20
          }
        },
        "domestic": {
          "wage_threshold": {
            "amount": 1000.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "min_employees": null,
            "unit": null,
            "weeks": null
          }
        },
        "agricultural": {
          "wage_threshold": {
            "amount": 20000.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "min_employees": 10,
            "unit": "weeks_in_year",
            "weeks": 20
          }
        },
        "nonprofit": {
          "wage_threshold": {
            "amount": null,
            "period": null
          },
          "weeks_threshold": {
            "min_employees": 4,
            "unit": "weeks_in_year",
            "weeks": 20
          }
        },
        "notes": []
      },
      "withholding": {
        "required_from_first_payroll": true,
        "notes": []
      }
    }
  },
  {
    "state_code": "WA",
    "state_name": "Washington",
    "agency_name": "Washington Employment Security Department",
    "registration_portal_url": "https://secure.esd.wa.gov/employerportal/",
    "ui_wage_threshold_text": "Under Washington law, employers become subject to unemployment insurance taxes as soon as they pay wages to employees; there is no minimum payroll or weeks threshold. Employers subject to FUTA or employing domestic or agricultural workers are also liable, with agricultural coverage applying when wages reach $20,000 in a quarter or 10 workers in 20 weeks and domestic coverage applying at $1,000 in cash wages in a quarter.",
    "ui_threshold_weeks_text": "No weeks test for general employers; agricultural employers are covered when they employ 10 or more workers for 20 weeks; nonprofit employers are covered when they employ four or more workers for 20 weeks.",
    "withholding_registration_required": false,
    "withholding_threshold_description": "Washington does not levy a state income tax on wages, so employers are not required to register for or withhold state income tax; however, employers must register for unemployment insurance and Paid Family & Medical Leave.",
    "typical_processing_time": "The Employment Security Department’s Employer Account Management Services portal assigns an unemployment insurance account number when registration is completed; account activation generally occurs within a few business days.",
    "required_information": [
      "Federal Employer Identification Number (FEIN)",
      "Unified Business Identifier (UBI) if registered with the Washington Secretary of State",
      "Legal business name and trade name",
      "Physical and mailing addresses and contact phone",
      "Type of business entity and date of formation",
      "Date employees first performed services in Washington and date first wages were paid",
      "Estimated quarterly payroll and number of employees",
      "Names, titles, Social Security numbers and addresses of owners, partners, members or corporate officers",
      "Business activity and NAICS code",
      "Information on predecessor or successor businesses",
      "Payroll contact person and email"
    ],
    "filing_methods": [
      "Register online through the Employment Security Department’s Employer Account Management Services portal to obtain an unemployment insurance account number",
      "Complete paper forms (e.g., Employer Account Application) if online registration is not available",
      "File quarterly wage reports and pay unemployment taxes electronically through the employer portal",
      "Register with the Department of Labor & Industries for workers’ compensation and with the Employment Security Department for Paid Family & Medical Leave, if applicable."
    ],
    "confirmation_proof": "The Employment Security Department sends an Employer Account Number and contribution rate notice once registration is processed.",
    "contacts": {
      "phone": "360‑902‑9360 (Employment Security Department Tax Unit)",
      "email": null
    },
    "last_verified_date": "2026-02-05",
    "source_notes": "The U.S. Department of Labor’s comparative analysis of state unemployment insurance laws lists Washington among states where employer coverage applies immediately (there is no minimum payroll or weeks requirement)【157654199418392†L165-L180】. The same analysis notes that agricultural labor is covered at $20,000 in wages or 10 workers and that domestic service is covered when cash wages reach $1,000【157654199418392†L205-L210】【157654199418392†L328-L331】. Washington has no state income tax, so withholding registration is not required.",
    "rules": {
      "status": "complete",
      "ui_liability": {
        "general": {
          "wage_threshold": {
            "amount": null,
            "period": null
          },
          "weeks_threshold": {
            "min_employees": null,
            "unit": null,
            "weeks": null
          }
        },
        "domestic": {
          "wage_threshold": {
            "amount": 1000.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "min_employees": null,
            "unit": null,
            "weeks": null
          }
        },
        "agricultural": {
          "wage_threshold": {
            "amount": 20000.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "min_employees": 10,
            "unit": "weeks_in_year",
            "weeks": 20
          }
        },
        "nonprofit": {
          "wage_threshold": {
            "amount": null,
            "period": null
          },
          "weeks_threshold": {
            "min_employees": 4,
            "unit": "weeks_in_year",
            "weeks": 20
          }
        },
        "notes": []
      },
      "withholding": {
        "required_from_first_payroll": false,
        "notes": [
          "No state income tax; employers may need to register for Paid Family & Medical Leave."
        ]
      }
    }
  },
  {
    "state_code": "WV",
    "state_name": "West Virginia",
    "agency_name": "WorkForce West Virginia and West Virginia State Tax Department",
    "registration_portal_url": "https://workforcewv.org and https://mytaxes.wvtax.gov",
    "ui_wage_threshold_text": "Under West Virginia law, an employing unit becomes an employer when, in any calendar quarter, it pays wages of $1,500 or more for services in employment, or when it employs at least one individual for some part of a day in each of 20 different weeks within the current or preceding calendar year. Employers subject to FUTA are automatically liable. Agricultural labor and domestic service coverage are addressed separately, and the state follows the federal thresholds—agricultural employers are liable when they pay $20,000 or more in wages in a quarter or employ 10 or more workers for 20 weeks; domestic employers are liable when they pay $1,000 or more in cash wages in a quarter. Non‑profit employers become liable when they employ four or more individuals for some part of a day in each of 20 weeks.",
    "ui_threshold_weeks_text": "20 different weeks with at least one employee for general employers; 20 weeks with 10 or more workers for agricultural employers; 20 weeks with four or more workers for nonprofit employers.",
    "withholding_registration_required": true,
    "withholding_threshold_description": "Employers must register for a West Virginia withholding tax account with the State Tax Department and withhold state income tax on wages paid to employees; there is no minimum wage threshold—registration is required from the first payroll.",
    "typical_processing_time": "Employers must file an Employer’s Initial Statement (Form UC‑A‑154) when they meet liability conditions; WorkForce West Virginia typically assigns an unemployment account number within two to three weeks after receiving the application. The State Tax Department issues the withholding account number a few days after online registration.",
    "required_information": [
      "Federal Employer Identification Number (FEIN)",
      "Legal business name and trade name",
      "Physical and mailing addresses and phone number",
      "Type of business entity and date formed",
      "Date employees first performed services in West Virginia and date first wages were paid",
      "Total wages and number of employees",
      "Names, titles, Social Security numbers and addresses of owners, partners, members or corporate officers",
      "Business activity and NAICS code",
      "Predecessor or successor business information",
      "Payroll contact person and email",
      "Whether the employer is agricultural, domestic or nonprofit."
    ],
    "filing_methods": [
      "Register for unemployment insurance by submitting the Employer’s Initial Statement (Form UC‑A‑154) online or by mail to WorkForce West Virginia",
      "Register for employer withholding through the West Virginia State Tax Department’s MyTaxes online portal or by filing Form WV/BRT‑CNP",
      "File quarterly wage reports and contributions electronically via the Employer Self‑Service portal and remit withholding tax through MyTaxes."
    ],
    "confirmation_proof": "WorkForce West Virginia sends an employer account number and contribution rate notice once registration is processed; the State Tax Department issues a West Virginia withholding tax account number and permit.",
    "contacts": {
      "phone": "304‑558‑2676 (WorkForce West Virginia Employer Status Determination Unit), 304‑558‑3333 (State Tax Department)",
      "email": "uctaxunit@wv.gov"
    },
    "last_verified_date": "2026-02-05",
    "source_notes": "The West Virginia Code defines an employer as any employing unit that pays wages of $1,500 or more in a calendar quarter or has at least one individual in employment for some part of a day in 20 different weeks during the current or preceding calendar year【870346139964908†L132-L136】. The code also references coverage for agricultural labor and domestic service. Further, WorkForce West Virginia requires an Employer’s Initial Statement (Form UC‑A‑154) to be filed and issues an account number after review; employers must register for withholding through the State Tax Department. The U.S. Department of Labor contact list provides the phone number for WorkForce West Virginia’s employer tax unit【48761910951811†L348-L479】.",
    "rules": {
      "status": "complete",
      "ui_liability": {
        "general": {
          "wage_threshold": {
            "amount": 1500.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "min_employees": 1,
            "unit": "weeks_in_year",
            "weeks": 20
          }
        },
        "domestic": {
          "wage_threshold": {
            "amount": 1000.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "min_employees": null,
            "unit": null,
            "weeks": null
          }
        },
        "agricultural": {
          "wage_threshold": {
            "amount": 20000.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "min_employees": 10,
            "unit": "weeks_in_year",
            "weeks": 20
          }
        },
        "nonprofit": {
          "wage_threshold": {
            "amount": null,
            "period": null
          },
          "weeks_threshold": {
            "min_employees": 4,
            "unit": "weeks_in_year",
            "weeks": 20
          }
        },
        "notes": []
      },
      "withholding": {
        "required_from_first_payroll": true,
        "notes": []
      }
    }
  },
  {
    "state_code": "WI",
    "state_name": "Wisconsin",
    "agency_name": "Wisconsin Department of Workforce Development (Unemployment Insurance Division) and Wisconsin Department of Revenue",
    "registration_portal_url": "https://dwd.wisconsin.gov/uitax/newemployer.htm and https://tap.revenue.wi.gov",
    "ui_wage_threshold_text": "Commercial employers become covered in Wisconsin if they pay $1,500 or more in wages in a calendar quarter or have one or more employees for some part of a day in 20 different weeks during a calendar year. Agricultural employers are liable when they pay $20,000 or more in cash wages in a quarter or employ 10 or more workers during 20 weeks. Domestic employers become covered when they pay $1,000 or more in cash wages in a quarter. 501(c)(3) nonprofit organizations become liable when they have four or more employees for some portion of a day in 20 weeks. An employer subject to the Federal Unemployment Tax Act (FUTA) is also covered.",
    "ui_threshold_weeks_text": "20 different weeks with at least one employee for commercial employers; 20 weeks with 10 or more workers for agricultural employers; 20 weeks with four or more employees for nonprofit employers; there is no weeks test for household employment.",
    "withholding_registration_required": true,
    "withholding_threshold_description": "Employers must register for a Wisconsin withholding tax account and withhold state income tax on wages paid to employees whenever federal withholding is required. There is no minimum wage threshold.",
    "typical_processing_time": "The Department of Workforce Development’s online New Employer Registration assigns a Wisconsin unemployment account number upon completion; the Department of Revenue usually issues a withholding tax number within a few business days of registering online.",
    "required_information": [
      "Federal Employer Identification Number (FEIN)",
      "Legal business name and trade name",
      "Physical and mailing addresses and phone",
      "Type of business entity and date formed",
      "Date employees first performed services in Wisconsin and date first wages were paid",
      "Total quarterly wages and number of employees",
      "Names, titles, Social Security numbers and addresses of owners, partners, members or corporate officers",
      "Business activity and NAICS code",
      "Predecessor or successor business information",
      "Payroll contact person and email",
      "For nonprofits, copy of IRS determination letter"
    ],
    "filing_methods": [
      "Register online through the Wisconsin Department of Workforce Development’s New Employer Registration portal to obtain an unemployment account number",
      "Register for a Wisconsin withholding tax number through the Department of Revenue’s tax system (My Tax Account or Business Tax Registration) or by mailing Form WT‑7",
      "File quarterly wage reports and unemployment tax reports electronically and remit withholding taxes via the My Tax Account or by mail."
    ],
    "confirmation_proof": "The Department of Workforce Development sends an employer unemployment account number and contribution rate notice once registration is approved; the Department of Revenue issues a Wisconsin withholding tax number and deposit schedule.",
    "contacts": {
      "phone": "608‑266‑3131 (DWD Employer Service for UI), 608‑266‑2776 (Department of Revenue)",
      "email": null
    },
    "last_verified_date": "2026-02-05",
    "source_notes": "The Wisconsin Employer Handbook explains that commercial employers become covered when they pay $1,500 or more in wages in a quarter or have one or more employees for some part of a day in 20 weeks, agricultural employers are liable when they pay $20,000 in cash wages or employ 10 or more workers in 20 weeks, domestic employers become covered at $1,000 cash wages, and nonprofit employers are liable at four employees in 20 weeks【291439343101585†L119-L146】. The handbook also notes that coverage is retroactive to January 1 of the year when liability is met【291439343101585†L93-L104】. Employers must register using the New Employer Registration portal to obtain an unemployment account number and register with the Department of Revenue for withholding.",
    "rules": {
      "status": "complete",
      "ui_liability": {
        "general": {
          "wage_threshold": {
            "amount": 1500.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "min_employees": 1,
            "unit": "weeks_in_year",
            "weeks": 20
          }
        },
        "domestic": {
          "wage_threshold": {
            "amount": 1000.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "min_employees": null,
            "unit": null,
            "weeks": null
          }
        },
        "agricultural": {
          "wage_threshold": {
            "amount": 20000.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "min_employees": 10,
            "unit": "weeks_in_year",
            "weeks": 20
          }
        },
        "nonprofit": {
          "wage_threshold": {
            "amount": null,
            "period": null
          },
          "weeks_threshold": {
            "min_employees": 4,
            "unit": "weeks_in_year",
            "weeks": 20
          }
        },
        "notes": []
      },
      "withholding": {
        "required_from_first_payroll": true,
        "notes": [
          "Coverage is retroactive to January 1 of the year when liability is met."
        ]
      }
    }
  },
  {
    "state_code": "WY",
    "state_name": "Wyoming",
    "agency_name": "Wyoming Department of Workforce Services – Unemployment Insurance Division",
    "registration_portal_url": "https://wyui.wyo.gov",
    "ui_wage_threshold_text": "Wyoming employers are liable for unemployment insurance tax when they pay $1,500 or more in wages during a calendar quarter or employ at least one worker for some part of a day in each of 20 different weeks in a calendar year. Agricultural employers are liable when they pay $20,000 or more in wages in a quarter or employ 10 or more workers in agricultural labor for 20 weeks. Domestic employers become liable when they pay $1,000 or more in cash wages in a quarter. Nonprofit employers become liable when they employ four or more workers for some portion of a day in each of 20 weeks. Employers subject to FUTA or who acquire a liable business are also covered.",
    "ui_threshold_weeks_text": "20 different weeks with at least one employee for general employers; 20 weeks with 10 or more workers for agricultural employers; 20 weeks with four or more workers for nonprofits.",
    "withholding_registration_required": false,
    "withholding_threshold_description": "Wyoming does not levy a state income tax; employers are not required to register for or withhold state income tax.",
    "typical_processing_time": "Employers who register online through the Wyoming Unemployment Insurance (WYUI) portal generally receive their unemployment account number within a few business days; paper applications may take longer.",
    "required_information": [
      "Federal Employer Identification Number (FEIN)",
      "Legal business name and trade name",
      "Physical and mailing addresses and phone number",
      "Type of business entity and date formed",
      "Date employees first performed services in Wyoming and date first wages were paid",
      "Total quarterly wages and number of employees",
      "Names, titles, Social Security numbers and addresses of owners, partners, members or corporate officers",
      "Business activity and NAICS code",
      "Information on acquired businesses or successors",
      "Payroll contact person and email",
      "Whether the employer is agricultural, domestic or nonprofit."
    ],
    "filing_methods": [
      "Register online via the Wyoming Department of Workforce Services Unemployment Insurance Employer Portal to obtain an unemployment account number",
      "Submit a paper Employer Registration Form to the Department if online registration is not available",
      "After registration, file quarterly wage reports and remit unemployment contributions through the WYUI portal."
    ],
    "confirmation_proof": "The Wyoming Department of Workforce Services sends an unemployment insurance employer account number and contribution rate notice after processing the registration.",
    "contacts": {
      "phone": "307‑235‑3217 (Wyoming Unemployment Insurance Tax Division)",
      "email": null
    },
    "last_verified_date": "2026-02-05",
    "source_notes": "Wyoming does not levy a state income tax, so employers only register for unemployment insurance. While state statutes specify that coverage applies to employers paying $1,500 in wages or employing a worker for 20 weeks, official sources are not easily accessible; this entry uses the standard FUTA thresholds for general, agricultural, domestic and nonprofit employers as shown in the U.S. Department of Labor comparative analysis tables. The U.S. Department of Labor contact list provides the phone number for the Wyoming Unemployment Insurance tax division【48761910951811†L348-L479】.",
    "rules": {
      "status": "complete",
      "ui_liability": {
        "general": {
          "wage_threshold": {
            "amount": 1500.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "min_employees": 1,
            "unit": "weeks_in_year",
            "weeks": 20
          }
        },
        "domestic": {
          "wage_threshold": {
            "amount": 1000.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "min_employees": null,
            "unit": null,
            "weeks": null
          }
        },
        "agricultural": {
          "wage_threshold": {
            "amount": 20000.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "min_employees": 10,
            "unit": "weeks_in_year",
            "weeks": 20
          }
        },
        "nonprofit": {
          "wage_threshold": {
            "amount": null,
            "period": null
          },
          "weeks_threshold": {
            "min_employees": 4,
            "unit": "weeks_in_year",
            "weeks": 20
          }
        },
        "notes": []
      },
      "withholding": {
        "required_from_first_payroll": false,
        "notes": []
      }
    }
  },
  {
    "state_code": "DC",
    "state_name": "District of Columbia",
    "agency_name": "District of Columbia Department of Employment Services (DOES)",
    "registration_portal_url": "https://essp.does.dc.gov",
    "ui_wage_threshold_text": "Most employers become liable for unemployment taxes on the first day wages are paid to any individual; household employers become liable once $500 or more in aggregate wages are paid in a calendar quarter",
    "ui_threshold_weeks_text": null,
    "withholding_registration_required": true,
    "withholding_threshold_description": "Every employer who pays wages to a DC resident or withholds DC income tax from employees must register for a DC withholding account using the Combined Registration Application (Form FR‑500); employers must report the number of DC resident employees, the date they began employing DC residents and the amount of tax to withhold",
    "typical_processing_time": "Online registration through the Employer Self‑Service Portal assigns a six‑digit unemployment account number upon completion; Form FR‑500 registrations through MyTax DC typically process within a few business days",
    "required_information": [
      "Federal Employer Identification Number (FEIN)",
      "Legal name and trade name of the business",
      "Business mailing and physical addresses, email and phone number",
      "Date first wages were paid in DC and estimated number of employees",
      "Number of DC resident employees and expected start date for withholding",
      "Estimated monthly DC tax to be withheld",
      "Description of business activities and date incorporated"
    ],
    "filing_methods": [
      "Online via Employer Self‑Service Portal (ESSP) for unemployment tax registration",
      "Paper Form FR‑500 available on request for household employers with five or fewer employees",
      "Combined Registration Application (Form FR‑500) via MyTax DC for withholding and other business taxes"
    ],
    "confirmation_proof": "Unique six‑digit unemployment account number issued by DOES; DC withholding registration produces a DC taxpayer ID number",
    "contacts": {
      "phone": "202-698-7550",
      "email": "uitax.info@dc.gov"
    },
    "last_verified_date": "2025-11-05",
    "source_notes": "DC UI Employer Handbook – liability and registration requirements; FR‑500 form fields for DC withholding registration",
    "rules": {
      "status": "complete",
      "ui_liability": {
        "general": {
          "wage_threshold": {
            "amount": 0.0,
            "period": null
          },
          "weeks_threshold": {
            "weeks": null,
            "unit": null,
            "min_employees": null
          }
        },
        "domestic": {
          "wage_threshold": {
            "amount": 500.0,
            "period": "quarter"
          },
          "weeks_threshold": {
            "weeks": null,
            "unit": null,
            "min_employees": null
          }
        },
        "agricultural": {
          "wage_threshold": {
            "amount": null,
            "period": null
          },
          "weeks_threshold": {
            "weeks": null,
            "unit": null,
            "min_employees": null
          }
        },
        "nonprofit": {
          "wage_threshold": {
            "amount": null,
            "period": null
          },
          "weeks_threshold": {
            "weeks": null,
            "unit": null,
            "min_employees": null
          }
        },
        "notes": [
          "Most employers become liable on the first day wages are paid (first-dollar coverage)"
        ]
      },
      "withholding": {
        "required_from_first_payroll": true,
        "notes": []
      },
      "todo": []
    }
  }
]